{"mention": "nsiders or hackers", "context_left": "A boss or requester who requires data for illegal use or commands a group or syndicate dealing with illegal products or services.  I", "context_right": "who receive instructions directly from a boss and can gain access to raw data and extract the information from a service provider.  hese individuals profit from the information they provide to the main boss or requester.", "_context_left": " I", "_context_right": "who receive instructions directly from a boss and can gain access to raw data and extract the information from a service provider. ", "sentence_left": "A boss or requester who requires data for illegal use or commands a group or syndicate dealing with illegal products or services.", "sentence_right": "hese individuals profit from the information they provide to the main boss or requester.", "label": "Adversaries may breach or otherwise leverage organizations who have access to intended victims. Access through trusted third party relationship exploits an existing connection that may not be protected or receives less scrutiny than standard mechanisms of gaining access to a network. Organizations often grant elevated access to second or third-party external providers in order to allow them to manage internal systems as well as cloud-based environments. Some examples of these relationships include IT services contractors, managed security providers, infrastructure contractors (e.g. HVAC, elevators, physical security). The third-party provider's access may be intended to be limited to the infrastructure being maintained, but may exist on the same network as the rest of the enterprise. As such, [Valid Accounts](https://attack.mitre.org/techniques/T1078) used by the other party for access to internal network systems may be compromised and used.(Citation: CISA IT Service Providers)", "label_id": 169, "label_title": "Trusted Relationship", "label_link": "https://attack.mitre.org/techniques/T1199", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-19_china-cybercrime-big-data-privacy"}
{"mention": "elling the data collected from unknown victims", "context_left": "hinese law enforcement has tried in recent years to hold companies accountable for how they handle. n 2019, seemingly legitimate Chinese companies also were observed providing third-party data crawling services and s", "context_right": "to reap a profit in addition to being exploited by underground threat actors.  ur research identified an article discussing the circumstances surrounding the arrests of the following individuals and entities:", "_context_left": "n 2019, seemingly legitimate Chinese companies also were observed providing third-party data crawling services and s", "_context_right": "to reap a profit in addition to being exploited by underground threat actors. ", "sentence_left": "hinese law enforcement has tried in recent years to hold companies accountable for how they handle.", "sentence_right": "ur research identified an article discussing the circumstances surrounding the arrests of the following individuals and entities:", "label": "The adversary is trying to steal data. Exfiltration consists of techniques that adversaries may use to steal data from your network. Once they’ve collected data, adversaries often package it to avoid detection while removing it. This can include compression and encryption. Techniques for getting data out of a target network typically include transferring it over their command and control channel or an alternate channel and may also include putting size limits on the transmission.", "label_id": 583, "label_title": "Exfiltration", "label_link": "https://attack.mitre.org/tactics/TA0010", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-19_china-cybercrime-big-data-privacy"}