{"mention": "ransomware", "context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to", "context_right": ", where significantly less effort can lead to marginally higher profits.", "_context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to ", "_context_right": ", where significantly less effort can lead to marginally higher profits.", "sentence_left": "\"It's apparent that major intrusions resulting in valuable stock for sale across his shop has taken a bit of a dive over the last year,\" said Intel 471 VP of Intelligence Mike DeBolt.", "sentence_right": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of Magecart-type attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "label": "Adversaries may encrypt data on target systems or on large numbers of systems in a network to interrupt availability to system and network resources. They can attempt to render stored data inaccessible by encrypting files or data on local and remote drives and withholding access to a decryption key. This may be done in order to extract monetary compensation from a victim in exchange for decryption or a decryption key (ransomware) or to render data permanently inaccessible in cases where the key is not saved or transmitted.(Citation: US-CERT Ransomware 2016)(Citation: FireEye WannaCry 2017)(Citation: US-CERT NotPetya 2017)(Citation: US-CERT SamSam 2018) In the case of ransomware, it is typical that common user files like Office documents, PDFs, images, videos, audio, text, and source code files will be encrypted. In some cases, adversaries may encrypt critical system files, disk partitions, and the MBR.(Citation: US-CERT NotPetya 2017) To maximize impact on the target organization, malware designed for encrypting data may have worm-like features to propagate across a network by leveraging other attack techniques like [Valid Accounts](https://attack.mitre.org/techniques/T1078), [OS Credential Dumping](https://attack.mitre.org/techniques/T1003), and [SMB/Windows Admin Shares](https://attack.mitre.org/techniques/T1021/002).(Citation: FireEye WannaCry 2017)(Citation: US-CERT NotPetya 2017) In cloud environments, storage objects within compromised accounts may also be encrypted.(Citation: Rhino S3 Ransomware Part 1)", "label_id": 467, "label_title": "Data Encrypted for Impact", "label_link": "https://attack.mitre.org/techniques/T1486", "entity_class": "CE", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "Magecart-type", "context_left": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of", "context_right": "attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "_context_left": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of ", "_context_right": " attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "sentence_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to ransomware, where significantly less effort can lead to marginally higher profits.", "sentence_right": "\"It doesn't appear Joker's Stash has pivoted his business model to address this reality, which may be the reason why we are seeing a decline in sales in his shop.", "label": "https://www.riskiq.com/what-is-magecart/ https://www.vaimo.com/magecart-attacks-protect-your-business/", "label_id": 1275, "label_title": "Magecart", "label_link": "http://www.bosch.com#node1frhbstcrx1", "entity_class": "CE", "entity_type": "GROUP", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}