{"mention": "Emotet", "context_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains. Another law enforcement action in 2021 successfully disrupted the", "context_right": "botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware. While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "_context_left": "Another law enforcement action in 2021 successfully disrupted the ", "_context_right": " botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "sentence_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "sentence_right": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "label": "[Emotet](https://attack.mitre.org/software/S0367) is a modular malware variant which is primarily used as a downloader for other malware variants such as [TrickBot](https://attack.mitre.org/software/S0266) and [IcedID](https://attack.mitre.org/software/S0483). Emotet first emerged in June 2014 and has been primarily used to target the banking sector. (Citation: Trend Micro Banking Malware Jan 2019)", "label_id": 944, "label_title": "Emotet", "label_link": "https://attack.mitre.org/software/S0367", "entity_class": "CE", "entity_type": "MALWARE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "botnet", "context_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains. Another law enforcement action in 2021 successfully disrupted the Emotet", "context_right": ", which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware. While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "_context_left": "Another law enforcement action in 2021 successfully disrupted the Emotet ", "_context_right": ", which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "sentence_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "sentence_right": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "label": "A botnet is a number of Internet-connected devices, each of which is running one or more bots. Botnets can be used to perform distributed denial-of-service attack (DDoS attack), steal data, send spam, and allows the attacker to access the device and its connection. The owner can control the botnet using command and control (C&C) software. The word \"botnet\" is a combination of the words \"robot\" and \"network\". The term is usually used with a negative or malicious connotation.", "label_id": 242177, "label_title": "Botnet", "label_link": "https://en.wikipedia.org/wiki?curid=636268", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "could steal credentials and bank details", "context_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains. Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that", "context_right": "from infected users, as well as distribute other malware. While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "_context_left": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that ", "_context_right": " from infected users, as well as distribute other malware.", "sentence_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "sentence_right": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "label": "The adversary is trying to steal account names and passwords. Credential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "label_id": 585, "label_title": "Credential Access", "label_link": "https://attack.mitre.org/tactics/TA0006", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "as well as distribute other malware.", "context_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains. Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users,", "context_right": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "_context_left": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users, ", "_context_right": "", "sentence_left": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "sentence_right": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "label": "Adversaries may transfer tools or other files from an external system into a compromised environment. Files may be copied from an external adversary controlled system through the command and control channel to bring tools into the victim network or through alternate protocols with another tool such as FTP. Files can also be copied over on Mac and Linux with native tools like scp, rsync, and sftp.", "label_id": 202, "label_title": "Ingress Tool Transfer", "label_link": "https://attack.mitre.org/techniques/T1105", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "malware-as-a-service", "context_left": "As of mid-December 2020, the shop allegedly contained 1,200 compromised payment card records and about 21,000 dumps for sale. With regards to", "context_right": ", Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials. One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects.", "_context_left": "With regards to ", "_context_right": ", Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials.", "sentence_left": "As of mid-December 2020, the shop allegedly contained 1,200 compromised payment card records and about 21,000 dumps for sale.", "sentence_right": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects", "context_left": "With regards to malware-as-a-service, Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials. One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages;", "context_right": ". Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects.", "_context_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; ", "_context_right": ".", "sentence_left": "With regards to malware-as-a-service, Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials.", "sentence_right": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects.", "label": "Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation, but adversaries may also use compromised websites for non-exploitation behavior such as acquiring [Application Access Token](https://attack.mitre.org/techniques/T1550/001). Multiple ways of delivering exploit code to a browser exist, including: * A legitimate website is compromised where adversaries have injected some form of malicious code such as JavaScript, iFrames, and cross-site scripting. * Malicious ads are paid for and served through legitimate ad providers. * Built-in web application interfaces are leveraged for the insertion of any other kind of object that can be used to display web content or contain a script that executes on the visiting client (e.g. forum posts, comments, and other user controllable web content). Often the website used by an adversary is one visited by a specific community, such as government, a particular industry, or region, where the goal is to compromise a specific user or set of users based on a shared interest. This kind of targeted attack is referred to a strategic web compromise or watering hole attack. There are several known examples of this occurring.(Citation: Shadowserver Strategic Web Compromise) Typical drive-by compromise process: 1. A user visits a website that is used to host the adversary controlled content. 2. Scripts automatically execute, typically searching versions of the browser and plugins for a potentially vulnerable version. * The user may be required to assist in this process by enabling scripting", "label_id": 15, "label_title": "Drive-by Compromise", "label_link": "https://attack.mitre.org/techniques/T1189", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "MaaS", "context_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects. Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused", "context_right": "that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects. The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "_context_left": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused ", "_context_right": " that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects.", "sentence_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects.", "sentence_right": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "record an infected device’s screen", "context_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects. Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages;", "context_right": "; grab payment card data; and steal online banking credentials through web-injects. The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "_context_left": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; ", "_context_right": "; grab payment card data; and steal online banking credentials through web-injects.", "sentence_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects.", "sentence_right": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "label": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations. Taking a screenshot is also typically possible through native utilities or API calls, such as <code>CopyFromScreen</code>, <code>xwd</code>, or <code>screencapture</code>.(Citation: CopyFromScreen .NET)(Citation: Antiquated Mac Malware)", "label_id": 26, "label_title": "Screen Capture", "label_link": "https://attack.mitre.org/techniques/T1113", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "grab payment card data; and steal online banking credentials through web-injects.", "context_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects. Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen;", "context_right": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "_context_left": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen; ", "_context_right": "", "sentence_left": "One service, first advertised in October 2020, includes the ability to intercept, send and receive text messages; grab payment card data and two-factor authentication (2FA) codes; and steal online banking payment details through web-injects.", "sentence_right": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "label": "Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation, but adversaries may also use compromised websites for non-exploitation behavior such as acquiring [Application Access Token](https://attack.mitre.org/techniques/T1550/001). Multiple ways of delivering exploit code to a browser exist, including: * A legitimate website is compromised where adversaries have injected some form of malicious code such as JavaScript, iFrames, and cross-site scripting. * Malicious ads are paid for and served through legitimate ad providers. * Built-in web application interfaces are leveraged for the insertion of any other kind of object that can be used to display web content or contain a script that executes on the visiting client (e.g. forum posts, comments, and other user controllable web content). Often the website used by an adversary is one visited by a specific community, such as government, a particular industry, or region, where the goal is to compromise a specific user or set of users based on a shared interest. This kind of targeted attack is referred to a strategic web compromise or watering hole attack. There are several known examples of this occurring.(Citation: Shadowserver Strategic Web Compromise) Typical drive-by compromise process: 1. A user visits a website that is used to host the adversary controlled content. 2. Scripts automatically execute, typically searching versions of the browser and plugins for a potentially vulnerable version. * The user may be required to assist in this process by enabling scripting", "label_id": 15, "label_title": "Drive-by Compromise", "label_link": "https://attack.mitre.org/techniques/T1189", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "keylogging modules", "context_left": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects. The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and", "context_right": ". ### Access is everything", "_context_left": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and ", "_context_right": ".", "sentence_left": "Another actor, a relative newcomer to the cybercriminal underground, started advertising an Android-focused MaaS that could intercept, send and receive text messages; record an infected device’s screen; grab payment card data; and steal online banking credentials through web-injects.", "sentence_right": "### Access is everything", "label": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. [Credential API Hooking](https://attack.mitre.org/techniques/T1056/004)) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. [Web Portal Capture](https://attack.mitre.org/techniques/T1056/003)).", "label_id": 279, "label_title": "Input Capture", "label_link": "https://attack.mitre.org/techniques/T1056", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "personal bank account login credentials", "context_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level. Intel 471 has observed a number of actors advertise possession of", "context_right": ", an organization's employee credentials, as well as system access credentials over the past few months. In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "_context_left": "Intel 471 has observed a number of actors advertise possession of ", "_context_right": ", an organization's employee credentials, as well as system access credentials over the past few months.", "sentence_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level.", "sentence_right": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "label": "The adversary is trying to steal account names and passwords. Credential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "label_id": 585, "label_title": "Credential Access", "label_link": "https://attack.mitre.org/tactics/TA0006", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "employee credentials", "context_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level. Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's", "context_right": ", as well as system access credentials over the past few months. In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "_context_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's ", "_context_right": ", as well as system access credentials over the past few months.", "sentence_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level.", "sentence_right": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "label": "The adversary is trying to steal account names and passwords. Credential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "label_id": 585, "label_title": "Credential Access", "label_link": "https://attack.mitre.org/tactics/TA0006", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "access credentials over the past few months.", "context_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level. Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system", "context_right": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "_context_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system ", "_context_right": "", "sentence_left": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level.", "sentence_right": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "label": "The adversary is trying to steal account names and passwords. Credential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "label_id": 585, "label_title": "Credential Access", "label_link": "https://attack.mitre.org/tactics/TA0006", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Spanish financial institution", "context_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system access credentials over the past few months. In the closing months of 2020, we observed one actor offering bank logins with credit card information from a", "context_right": ", while also claiming to have bank logins available from a French bank and an online bank popular in Europe. Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "_context_left": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a ", "_context_right": ", while also claiming to have bank logins available from a French bank and an online bank popular in Europe.", "sentence_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system access credentials over the past few months.", "sentence_right": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "label": "Banca March is a Spanish bank headquartered in Palma de Mallorca.  The bank was founded in Palma de Mallorca by Juan March Ordinas in 1926. In the beginning, its sphere of influence was limited to Majorca but it eventually grew to be the leading independent bank in the Balearic Islands. In 1974 it initiated an expansion onto the Spanish peninsula and in 1989 it began serious operations in the Canary Islands.  At the beginning of the 21st century Banca March has continued to expand its operations in the Balearic and Canary Islands, has begun operations in the tourist destinations of Andalusia and is in the process of modernizing its offices in Madrid, Barcelona, and London.", "label_id": 2213207, "label_title": "Banca March", "label_link": "https://en.wikipedia.org/wiki?curid=17615710", "entity_class": "NE", "entity_type": "SECTOR", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Europe", "context_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system access credentials over the past few months. In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in", "context_right": ". Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "_context_left": "In the closing months of 2020, we observed one actor offering bank logins with credit card information from a Spanish financial institution, while also claiming to have bank logins available from a French bank and an online bank popular in ", "_context_right": ".", "sentence_left": "Intel 471 has observed a number of actors advertise possession of personal bank account login credentials, an organization's employee credentials, as well as system access credentials over the past few months.", "sentence_right": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "administrator-level access to the organization’s domain controller", "context_left": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company. On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have", "context_right": ", access credentials to some databases, the source code of undisclosed applications the organization used, and the bank’s customer data. As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "_context_left": "On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have ", "_context_right": ", access credentials to some databases, the source code of undisclosed applications the organization used, and the bank’s customer data.", "sentence_left": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "sentence_right": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "label": "Adversaries may obtain and abuse credentials of existing accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Compromised credentials may be used to bypass access controls placed on various resources on systems within the network and may even be used for persistent access to remote systems and externally available services, such as VPNs, Outlook Web Access and remote desktop. Compromised credentials may also grant an adversary increased privilege to specific systems or access to restricted areas of the network. Adversaries may choose not to use malware or tools in conjunction with the legitimate access those credentials provide to make it harder to detect their presence. The overlap of permissions for local, domain, and cloud accounts across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator) to bypass access controls set within the enterprise. (Citation: TechNet Credential Theft)", "label_id": 4, "label_title": "Valid Accounts", "label_link": "https://attack.mitre.org/techniques/T1078", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "access credentials to some databases", "context_left": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company. On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have administrator-level access to the organization’s domain controller,", "context_right": ", the source code of undisclosed applications the organization used, and the bank’s customer data. As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "_context_left": "On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have administrator-level access to the organization’s domain controller, ", "_context_right": ", the source code of undisclosed applications the organization used, and the bank’s customer data.", "sentence_left": "Additionally, another actor being tracked by Intel 471 offered to sell compromised account credentials to the control panel of business process management software used by an undisclosed insurance company.", "sentence_right": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "label": "The adversary is trying to steal account names and passwords. Credential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.", "label_id": 585, "label_title": "Credential Access", "label_link": "https://attack.mitre.org/tactics/TA0006", "entity_class": "CI", "entity_type": "TACTIC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "France-based", "context_left": "On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have administrator-level access to the organization’s domain controller, access credentials to some databases, the source code of undisclosed applications the organization used, and the bank’s customer data. As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a", "context_right": "company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software. The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "_context_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a ", "_context_right": " company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "sentence_left": "On the network access side, one actor Intel 471 is tracking tried to sell unauthorized access to an undisclosed bank in Africa, claiming to have administrator-level access to the organization’s domain controller, access credentials to some databases, the source code of undisclosed applications the organization used, and the bank’s customer data.", "sentence_right": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "GitHub", "context_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software. The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes,", "context_right": "software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses. While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "_context_left": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, ", "_context_right": " software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "sentence_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "sentence_right": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Amazon Web Services", "context_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software. The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts,", "context_right": "(AWS) accounts, employee email accounts and lists of customer email addresses. While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "_context_left": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, ", "_context_right": " (AWS) accounts, employee email accounts and lists of customer email addresses.", "sentence_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "sentence_right": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "label": "Amazon Web Services (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms to individuals, companies, and governments, on a metered pay-as-you-go basis. In aggregate, these cloud computing web services provide a set of primitive abstract technical infrastructure and distributed computing building blocks and tools. One of these services is Amazon Elastic Compute Cloud, which allows users to have at their disposal a virtual cluster of computers, available all the time, through the Internet. AWS's version of virtual computers emulate most of the attributes of a real computer including, hardware central processing units (CPUs) and graphics processing units (GPUs) for processing, local/RAM memory, hard-disk/SSD storage); a choice of operating systems; networking; and pre-loaded application software such as web servers, databases, customer relationship management (CRM), etc.  The AWS technology is implemented at server farms throughout the world, and maintained by the Amazon subsidiary. Fees are based on a combination of usage, the hardware/OS/software/networking features chosen by the subscriber, required availability, redundancy, security, and service options. Subscribers can pay for a single virtual AWS computer, a dedicated physical computer, or clusters of either. As part of the subscription agreement, Amazon provides security for subscribers' system. AWS operates from many global geographical regions including 6 in North America.  In 2017, AWS comprised more than 90 services spanning a wide range including computing, storage, networking, database, analytics, application services, deployment, management, mobile, developer tools, and tools for the Internet of Things. The most popular include Amazon Elastic Compute Cloud (EC2) and Amazon Simple Storage Service", "label_id": 475111, "label_title": "Amazon Web Services", "label_link": "https://en.wikipedia.org/wiki?curid=1691376", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "AWS", "context_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software. The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (", "context_right": ") accounts, employee email accounts and lists of customer email addresses. While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "_context_left": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (", "_context_right": ") accounts, employee email accounts and lists of customer email addresses.", "sentence_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "sentence_right": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "label": "Amazon Web Services (AWS) is a subsidiary of Amazon that provides on-demand cloud computing platforms to individuals, companies, and governments, on a metered pay-as-you-go basis. In aggregate, these cloud computing web services provide a set of primitive abstract technical infrastructure and distributed computing building blocks and tools. One of these services is Amazon Elastic Compute Cloud, which allows users to have at their disposal a virtual cluster of computers, available all the time, through the Internet. AWS's version of virtual computers emulate most of the attributes of a real computer including, hardware central processing units (CPUs) and graphics processing units (GPUs) for processing, local/RAM memory, hard-disk/SSD storage); a choice of operating systems; networking; and pre-loaded application software such as web servers, databases, customer relationship management (CRM), etc.  The AWS technology is implemented at server farms throughout the world, and maintained by the Amazon subsidiary. Fees are based on a combination of usage, the hardware/OS/software/networking features chosen by the subscriber, required availability, redundancy, security, and service options. Subscribers can pay for a single virtual AWS computer, a dedicated physical computer, or clusters of either. As part of the subscription agreement, Amazon provides security for subscribers' system. AWS operates from many global geographical regions including 6 in North America.  In 2017, AWS comprised more than 90 services spanning a wide range including computing, storage, networking, database, analytics, application services, deployment, management, mobile, developer tools, and tools for the Internet of Things. The most popular include Amazon Elastic Compute Cloud (EC2) and Amazon Simple Storage Service", "label_id": 475111, "label_title": "Amazon Web Services", "label_link": "https://en.wikipedia.org/wiki?curid=1691376", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "compromised account allegedly included domain administrator privileges", "context_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software. The", "context_right": "and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses. While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "_context_left": "The ", "_context_right": " and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "sentence_left": "As recently as January 2021, another actor monitored by Intel 471 offered to sell unauthorized access to the network of a France-based company that deals in hardware and software for PoS systems, including automatic coin mechanisms, cash registers, management systems and payment software.", "sentence_right": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "label": "Adversaries may obtain and abuse credentials of existing accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Compromised credentials may be used to bypass access controls placed on various resources on systems within the network and may even be used for persistent access to remote systems and externally available services, such as VPNs, Outlook Web Access and remote desktop. Compromised credentials may also grant an adversary increased privilege to specific systems or access to restricted areas of the network. Adversaries may choose not to use malware or tools in conjunction with the legitimate access those credentials provide to make it harder to detect their presence. The overlap of permissions for local, domain, and cloud accounts across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator) to bypass access controls set within the enterprise. (Citation: TechNet Credential Theft)", "label_id": 4, "label_title": "Valid Accounts", "label_link": "https://attack.mitre.org/techniques/T1078", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "cybercriminals", "context_left": "### Criminals make money machine go BRRR When not going after the users or company itself,", "context_right": "have turned their attention to the next best thing: the machines that hold the money. The act of using malware to force ATMs to malfunction and empty their cash — known as “jackpotting” — has been around for some time, but actors are finding novel ways to get around baked-in defenses.", "_context_left": "When not going after the users or company itself, ", "_context_right": " have turned their attention to the next best thing: the machines that hold the money.", "sentence_left": "### Criminals make money machine go BRRR", "sentence_right": "The act of using malware to force ATMs to malfunction and empty their cash — known as “jackpotting” — has been around for some time, but actors are finding novel ways to get around baked-in defenses.", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Malware", "context_left": "Point-of-sale (PoS) malware also is being sold on underground markets, taking advantage of flaws in the devices used to process card payments at retail locations to steal sensitive information. Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS", "context_right": "Injector” that allegedly operated as a data sniffer without requiring additional action from the user. The malware features included payment transaction data output in a result box that included Track 1 and Track 2 data, as well as the personal identification number (PIN) code for the compromised payment card.", "_context_left": "Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS ", "_context_right": " Injector” that allegedly operated as a data sniffer without requiring additional action from the user.", "sentence_left": "Point-of-sale (PoS) malware also is being sold on underground markets, taking advantage of flaws in the devices used to process card payments at retail locations to steal sensitive information.", "sentence_right": "The malware features included payment transaction data output in a result box that included Track 1 and Track 2 data, as well as the personal identification number (PIN) code for the compromised payment card.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "It’s apparent that several threat actors leveraged multiple products, goods and services together to maximize potential impact and profit.", "context_left": "The buying, selling and trading of products, goods and services used for crimes has fueled several attack schemes, with many developed specifically to target the financial services sector.", "context_right": "The target on financial services has remained a large one, with new actors constantly developing ways to pry money away from its rightful owners.", "_context_left": "", "_context_right": "", "sentence_left": "The buying, selling and trading of products, goods and services used for crimes has fueled several attack schemes, with many developed specifically to target the financial services sector.", "sentence_right": "The target on financial services has remained a large one, with new actors constantly developing ways to pry money away from its rightful owners.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "One was Joker's Stash, the prolific carding dump shop, which announced its closure in January 2021.", "context_left": "There have been significant actions taken to undercut cybercrime this year, with each event weakening criminals’ ability to target financial services.", "context_right": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "_context_left": "", "_context_right": "", "sentence_left": "There have been significant actions taken to undercut cybercrime this year, with each event weakening criminals’ ability to target financial services.", "sentence_right": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Apr 26, 2021", "context_left": "The cybercriminal underground hasn’t forgotten about financial services", "context_right": "It is a well-worn cliche in cybersecurity: criminals prey on banks and financial services because that’s where the money is.", "_context_left": "", "_context_right": "", "sentence_left": "The cybercriminal underground hasn’t forgotten about financial services", "sentence_right": "It is a well-worn cliche in cybersecurity: criminals prey on banks and financial services because that’s where the money is.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "### Criminals make money machine go BRRR", "context_left": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "context_right": "When not going after the users or company itself, cybercriminals have turned their attention to the next best thing: the machines that hold the money.", "_context_left": "", "_context_right": "", "sentence_left": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "sentence_right": "When not going after the users or company itself, cybercriminals have turned their attention to the next best thing: the machines that hold the money.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "### One door closes, two doors open", "context_left": "In the past six months, Intel 471 has observed actors on the cybercriminal underground establish their reputation using a variety of goods, products and services that have specifically targeted financial services.", "context_right": "There have been significant actions taken to undercut cybercrime this year, with each event weakening criminals’ ability to target financial services.", "_context_left": "", "_context_right": "", "sentence_left": "In the past six months, Intel 471 has observed actors on the cybercriminal underground establish their reputation using a variety of goods, products and services that have specifically targeted financial services.", "sentence_right": "There have been significant actions taken to undercut cybercrime this year, with each event weakening criminals’ ability to target financial services.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "In 2021, that remains a fact.", "context_left": "It is a well-worn cliche in cybersecurity: criminals prey on banks and financial services because that’s where the money is.", "context_right": "However, while the overall crime remains the same, who is responsible for it and the method by which the crimes are carried out have been modified.", "_context_left": "", "_context_right": "", "sentence_left": "It is a well-worn cliche in cybersecurity: criminals prey on banks and financial services because that’s where the money is.", "sentence_right": "However, while the overall crime remains the same, who is responsible for it and the method by which the crimes are carried out have been modified.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "While each of these takedowns kneecaps criminal activity, there are actors on the underground who move to fill in the void left by the law enforcement actions.", "context_left": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "context_right": "With each of the above examples, Intel 471 has seen other actors quickly move to establish a bigger presence in the market.", "_context_left": "", "_context_right": "", "sentence_left": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "sentence_right": "With each of the above examples, Intel 471 has seen other actors quickly move to establish a bigger presence in the market.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "While an organization can help individuals recover from compromised payment cards or bank logins, bouncing back from network compromise is much more difficult and therefore presents a much larger threat.", "context_left": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "context_right": "### Criminals make money machine go BRRR", "_context_left": "", "_context_right": "", "sentence_left": "The compromised account allegedly included domain administrator privileges and enabled access to the company’s product source codes, GitHub software development platform accounts, Amazon Web Services (AWS) accounts, employee email accounts and lists of customer email addresses.", "sentence_right": "### Criminals make money machine go BRRR", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Credentials are a crucial cog for actors, serving as the tool that paves the path to ill-gotten gains.", "context_left": "Without obtaining credentials, a cybercriminal’s attempt to steal money or sensitive information is exceedingly difficult.", "context_right": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level.", "_context_left": "", "_context_right": "", "sentence_left": "Without obtaining credentials, a cybercriminal’s attempt to steal money or sensitive information is exceedingly difficult.", "sentence_right": "Financial institutions are already a heavily targeted sector, so this threat has the capability to impact those at both an individual and organizational level.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "The malware features included payment transaction data output in a result box that included Track 1 and Track 2 data, as well as the personal identification number (PIN) code for the compromised payment card.", "context_left": "Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS Malware Injector” that allegedly operated as a data sniffer without requiring additional action from the user.", "context_right": "Data collected via this kind of malware has the capability to be used in further fraudulent activity or offered for sale as a product on underground forums or via dump shop services.", "_context_left": "", "_context_right": "", "sentence_left": "Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS Malware Injector” that allegedly operated as a data sniffer without requiring additional action from the user.", "sentence_right": "Data collected via this kind of malware has the capability to be used in further fraudulent activity or offered for sale as a product on underground forums or via dump shop services.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "With regards to Joker’s Stash, we have observed the creation of and updates to numerous payment card data shops.", "context_left": "With each of the above examples, Intel 471 has seen other actors quickly move to establish a bigger presence in the market.", "context_right": "An updated shop Intel 471 has been tracking offered payment card information, particularly card verification values (CVVs) and dumps that included the data copied from payment card magnetic stripes.", "_context_left": "", "_context_right": "", "sentence_left": "With each of the above examples, Intel 471 has seen other actors quickly move to establish a bigger presence in the market.", "sentence_right": "An updated shop Intel 471 has been tracking offered payment card information, particularly card verification values (CVVs) and dumps that included the data copied from payment card magnetic stripes.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "ATMs aren’t the only hardware in criminals’ sights.", "context_left": "Intel 471 observed one actor selling ATM malware that allegedly could be deployed using a specially-crafted Raspberry Pi kit computer and be controlled remotely via a smartphone or a laptop.", "context_right": "Point-of-sale (PoS) malware also is being sold on underground markets, taking advantage of flaws in the devices used to process card payments at retail locations to steal sensitive information.", "_context_left": "", "_context_right": "", "sentence_left": "Intel 471 observed one actor selling ATM malware that allegedly could be deployed using a specially-crafted Raspberry Pi kit computer and be controlled remotely via a smartphone or a laptop.", "sentence_right": "Point-of-sale (PoS) malware also is being sold on underground markets, taking advantage of flaws in the devices used to process card payments at retail locations to steal sensitive information.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "That announcement came after law enforcement [allegedly seized proxy servers](https://intel471.com/blog/jokers-stash-fbi-interpol-dns-takedown-temporary/) used in connection with the site’s blockchain-based domains.", "context_left": "One was Joker's Stash, the prolific carding dump shop, which announced its closure in January 2021.", "context_right": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "_context_left": "", "_context_right": "", "sentence_left": "One was Joker's Stash, the prolific carding dump shop, which announced its closure in January 2021.", "sentence_right": "Another law enforcement action in 2021 successfully disrupted the Emotet botnet, which featured a modular loader that could steal credentials and bank details from infected users, as well as distribute other malware.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "The buying, selling and trading of products, goods and services used for crimes has fueled several attack schemes, with many developed specifically to target the financial services sector.", "context_left": "While the global economy took a hit over the last year as it recovers from the pandemic, the underground marketplace continues to flourish with new opportunities as the potential victim pool grows with the increase of people using online services.", "context_right": "It’s apparent that several threat actors leveraged multiple products, goods and services together to maximize potential impact and profit.", "_context_left": "", "_context_right": "", "sentence_left": "While the global economy took a hit over the last year as it recovers from the pandemic, the underground marketplace continues to flourish with new opportunities as the potential victim pool grows with the increase of people using online services.", "sentence_right": "It’s apparent that several threat actors leveraged multiple products, goods and services together to maximize potential impact and profit.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Without obtaining credentials, a cybercriminal’s attempt to steal money or sensitive information is exceedingly difficult.", "context_left": "### Access is everything", "context_right": "Credentials are a crucial cog for actors, serving as the tool that paves the path to ill-gotten gains.", "_context_left": "", "_context_right": "", "sentence_left": "### Access is everything", "sentence_right": "Credentials are a crucial cog for actors, serving as the tool that paves the path to ill-gotten gains.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "The act of using malware to force ATMs to malfunction and empty their cash — known as “jackpotting” — has been around for some time, but actors are finding novel ways to get around baked-in defenses.", "context_left": "When not going after the users or company itself, cybercriminals have turned their attention to the next best thing: the machines that hold the money.", "context_right": "Intel 471 observed one actor selling ATM malware that allegedly could be deployed using a specially-crafted Raspberry Pi kit computer and be controlled remotely via a smartphone or a laptop.", "_context_left": "", "_context_right": "", "sentence_left": "When not going after the users or company itself, cybercriminals have turned their attention to the next best thing: the machines that hold the money.", "sentence_right": "Intel 471 observed one actor selling ATM malware that allegedly could be deployed using a specially-crafted Raspberry Pi kit computer and be controlled remotely via a smartphone or a laptop.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "However, while the overall crime remains the same, who is responsible for it and the method by which the crimes are carried out have been modified.", "context_left": "In 2021, that remains a fact.", "context_right": "While the financial services sector has undoubtedly increased security procedures and adopted advanced technologies to deter attacks, underground actors continue to adapt and develop new methods of evading anti-fraud systems to gain access to sensitive information that financial businesses and organizations collect, store and transmit.", "_context_left": "", "_context_right": "", "sentence_left": "In 2021, that remains a fact.", "sentence_right": "While the financial services sector has undoubtedly increased security procedures and adopted advanced technologies to deter attacks, underground actors continue to adapt and develop new methods of evading anti-fraud systems to gain access to sensitive information that financial businesses and organizations collect, store and transmit.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "While the global economy took a hit over the last year as it recovers from the pandemic, the underground marketplace continues to flourish with new opportunities as the potential victim pool grows with the increase of people using online services.", "context_left": "Data collected via this kind of malware has the capability to be used in further fraudulent activity or offered for sale as a product on underground forums or via dump shop services.", "context_right": "The buying, selling and trading of products, goods and services used for crimes has fueled several attack schemes, with many developed specifically to target the financial services sector.", "_context_left": "", "_context_right": "", "sentence_left": "Data collected via this kind of malware has the capability to be used in further fraudulent activity or offered for sale as a product on underground forums or via dump shop services.", "sentence_right": "The buying, selling and trading of products, goods and services used for crimes has fueled several attack schemes, with many developed specifically to target the financial services sector.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "As of mid-December 2020, the shop allegedly contained 1,200 compromised payment card records and about 21,000 dumps for sale.", "context_left": "An updated shop Intel 471 has been tracking offered payment card information, particularly card verification values (CVVs) and dumps that included the data copied from payment card magnetic stripes.", "context_right": "With regards to malware-as-a-service, Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials.", "_context_left": "", "_context_right": "", "sentence_left": "An updated shop Intel 471 has been tracking offered payment card information, particularly card verification values (CVVs) and dumps that included the data copied from payment card magnetic stripes.", "sentence_right": "With regards to malware-as-a-service, Intel 471 has seen two actors sell access to malware that targets the Android operating system in an effort to pull bank credentials.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "### Access is everything", "context_left": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "context_right": "Without obtaining credentials, a cybercriminal’s attempt to steal money or sensitive information is exceedingly difficult.", "_context_left": "", "_context_right": "", "sentence_left": "The service allegedly also supported a socket secure internet protocol (SOCKS5) proxy and keylogging modules.", "sentence_right": "Without obtaining credentials, a cybercriminal’s attempt to steal money or sensitive information is exceedingly difficult.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Data collected via this kind of malware has the capability to be used in further fraudulent activity or offered for sale as a product on underground forums or via dump shop services.", "context_left": "The malware features included payment transaction data output in a result box that included Track 1 and Track 2 data, as well as the personal identification number (PIN) code for the compromised payment card.", "context_right": "While the global economy took a hit over the last year as it recovers from the pandemic, the underground marketplace continues to flourish with new opportunities as the potential victim pool grows with the increase of people using online services.", "_context_left": "", "_context_right": "", "sentence_left": "The malware features included payment transaction data output in a result box that included Track 1 and Track 2 data, as well as the personal identification number (PIN) code for the compromised payment card.", "sentence_right": "While the global economy took a hit over the last year as it recovers from the pandemic, the underground marketplace continues to flourish with new opportunities as the potential victim pool grows with the increase of people using online services.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}
{"mention": "Point-of-sale (PoS) malware also is being sold on underground markets, taking advantage of flaws in the devices used to process card payments at retail locations to steal sensitive information.", "context_left": "ATMs aren’t the only hardware in criminals’ sights.", "context_right": "Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS Malware Injector” that allegedly operated as a data sniffer without requiring additional action from the user.", "_context_left": "", "_context_right": "", "sentence_left": "ATMs aren’t the only hardware in criminals’ sights.", "sentence_right": "Intel 471 observed an actor in February 2021 selling PoS malware dubbed “ATM & POS Malware Injector” that allegedly operated as a data sniffer without requiring additional action from the user.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-04-26_financial-cybercrime-2021-jackpotting-atm"}