{"mention": "U.S.", "context_left": "On December 17, an image adorned the shop's website that claimed the", "context_right": "Federal Bureau of Investigation and Interpol had taken it into law enforcement's possession.", "_context_left": "On December 17, an image adorned the shop's website that claimed the ", "_context_right": " Federal Bureau of Investigation and Interpol had taken it into law enforcement's possession.", "sentence_left": "Law enforcement has allegedly seized proxy servers used in connection with the blockchain-based domains belonging to Joker's Stash, a prolific vendor of compromised financial card data in the cybercrime underground.", "sentence_right": "After noticing the action, Joker's Stash operators took down the site completely.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "Federal Bureau of Investigation", "context_left": "On December 17, an image adorned the shop's website that claimed the U.S.", "context_right": "and Interpol had taken it into law enforcement's possession.", "_context_left": "On December 17, an image adorned the shop's website that claimed the U.S. ", "_context_right": " and Interpol had taken it into law enforcement's possession.", "sentence_left": "Law enforcement has allegedly seized proxy servers used in connection with the blockchain-based domains belonging to Joker's Stash, a prolific vendor of compromised financial card data in the cybercrime underground.", "sentence_right": "After noticing the action, Joker's Stash operators took down the site completely.", "label": "The Federal Bureau of Investigation (FBI) is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. Operating under the jurisdiction of the United States Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.  Although many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in smaller cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.  Despite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in U.S. embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. The FBI can and does at times carry out secret activities overseas, just as the CIA has a limited", "label_id": 5289, "label_title": "Federal Bureau of Investigation", "label_link": "https://en.wikipedia.org/wiki?curid=11127", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "Interpol", "context_left": "On December 17, an image adorned the shop's website that claimed the U.S. Federal Bureau of Investigation and", "context_right": "had taken it into law enforcement's possession.", "_context_left": "On December 17, an image adorned the shop's website that claimed the U.S. Federal Bureau of Investigation and ", "_context_right": " had taken it into law enforcement's possession.", "sentence_left": "Law enforcement has allegedly seized proxy servers used in connection with the blockchain-based domains belonging to Joker's Stash, a prolific vendor of compromised financial card data in the cybercrime underground.", "sentence_right": "After noticing the action, Joker's Stash operators took down the site completely.", "label": "The International Criminal Police Organization (ICPO-INTERPOL; ), more commonly known as INTERPOL ( , ), is an international organization that facilitates worldwide police cooperation and crime control. Headquartered in Lyon, France, it was founded in 1923 as the International Criminal Police Commission (ICPC); the name INTERPOL served as the agency's telegraphic address in 1946, and was chosen as its common name in 1956.  INTERPOL provides investigative support, expertise, and training to law enforcement worldwide in battling three major areas of transnational crime: terrorism, cybercrime, and organized crime. Its broad mandate covers virtually every kind of crime, including crimes against humanity, child pornography, drug trafficking and production, political corruption, copyright infringement, and white-collar crime. The agency also helps coordinate cooperation among the world's law enforcement institutions through criminal databases and communications networks.  INTERPOL has an annual budget of around €113 million, most of which is provided through annual contributions by its membership of police forces in 181 countries. Its day-to-day operations are carried out by the General Secretariat, which is staffed by both police and civilians and led by the Secretary General, currently Jurgen Stock, the former deputy head of Germany's Federal Criminal Police Office. As of 2013, the General Secretariat employed a staff of 756, representing 100 member countries. The General Assembly, composed of all member countries, is the governing body, electing the Executive Committee and its President—currently Kim Jong Yang of South Korea—to supervise the implementation of INTERPOL's policies and administration.  INTERPOL seeks to remain as politically neutral as possible so as", "label_id": 1926511, "label_title": "Interpol", "label_link": "https://en.wikipedia.org/wiki?curid=14338129", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "cybercriminals", "context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many", "context_right": "to ransomware, where significantly less effort can lead to marginally higher profits.", "_context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many ", "_context_right": " to ransomware, where significantly less effort can lead to marginally higher profits.", "sentence_left": "\"It's apparent that major intrusions resulting in valuable stock for sale across his shop has taken a bit of a dive over the last year,\" said Intel 471 VP of Intelligence Mike DeBolt.", "sentence_right": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of Magecart-type attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "ransomware", "context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to", "context_right": ", where significantly less effort can lead to marginally higher profits.", "_context_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to ", "_context_right": ", where significantly less effort can lead to marginally higher profits.", "sentence_left": "\"It's apparent that major intrusions resulting in valuable stock for sale across his shop has taken a bit of a dive over the last year,\" said Intel 471 VP of Intelligence Mike DeBolt.", "sentence_right": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of Magecart-type attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "label": "Adversaries may encrypt data on target systems or on large numbers of systems in a network to interrupt availability to system and network resources. They can attempt to render stored data inaccessible by encrypting files or data on local and remote drives and withholding access to a decryption key. This may be done in order to extract monetary compensation from a victim in exchange for decryption or a decryption key (ransomware) or to render data permanently inaccessible in cases where the key is not saved or transmitted.(Citation: US-CERT Ransomware 2016)(Citation: FireEye WannaCry 2017)(Citation: US-CERT NotPetya 2017)(Citation: US-CERT SamSam 2018) In the case of ransomware, it is typical that common user files like Office documents, PDFs, images, videos, audio, text, and source code files will be encrypted. In some cases, adversaries may encrypt critical system files, disk partitions, and the MBR.(Citation: US-CERT NotPetya 2017) To maximize impact on the target organization, malware designed for encrypting data may have worm-like features to propagate across a network by leveraging other attack techniques like [Valid Accounts](https://attack.mitre.org/techniques/T1078), [OS Credential Dumping](https://attack.mitre.org/techniques/T1003), and [SMB/Windows Admin Shares](https://attack.mitre.org/techniques/T1021/002).(Citation: FireEye WannaCry 2017)(Citation: US-CERT NotPetya 2017) In cloud environments, storage objects within compromised accounts may also be encrypted.(Citation: Rhino S3 Ransomware Part 1)", "label_id": 467, "label_title": "Data Encrypted for Impact", "label_link": "https://attack.mitre.org/techniques/T1486", "entity_class": "CE", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "Magecart-type", "context_left": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of", "context_right": "attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "_context_left": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of ", "_context_right": " attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "sentence_left": "\"This could be a result of many things, from the pandemic to the massive shift of many cybercriminals to ransomware, where significantly less effort can lead to marginally higher profits.", "sentence_right": "\"It doesn't appear Joker's Stash has pivoted his business model to address this reality, which may be the reason why we are seeing a decline in sales in his shop.", "label": "https://www.riskiq.com/what-is-magecart/ https://www.vaimo.com/magecart-attacks-protect-your-business/", "label_id": 1275, "label_title": "Magecart", "label_link": "http://www.bosch.com#node1frhbstcrx1", "entity_class": "CE", "entity_type": "GROUP", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "The actor also suggested that people should use the forum's Tor-based domain in the meantime, which is still working.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "At the same time, the actor stressed the shop would go back to normal in a couple of days after access was restored.", "sentence_right": "We believe that this action will only serve as a temporary issue for the site.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "More annoying than crippling: Joker’s Stash takedown is temporary", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "", "sentence_right": "Dec 17, 2020", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "\"It doesn't appear Joker's Stash has pivoted his business model to address this reality, which may be the reason why we are seeing a decline in sales in his shop.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "\"Payment card fraud has shifted its attention to e-commerce targets due to a handful of factors including the pandemic forcing consumers to stay at home, and the rise of Magecart-type attacks,\" said a security expert in the financial services industry who asked to remain anonymous.", "sentence_right": "It remains to be seen how Joker's Stash reacts to this in 2021 and beyond.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "![](https://d39ec1uo9ktrut.cloudfront.net/splash-e1608237933863.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "After noticing the action, Joker's Stash operators took down the site completely.", "sentence_right": "The image that greeted users if they visited Joker's Stash's blockchain-based website on Dec. 17, 2020.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "Shortly after the action, the site's operators took to several underground forums to deal with the fallout.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The image that greeted users if they visited Joker's Stash's blockchain-based website on Dec. 17, 2020.", "sentence_right": "Messages claimed that the external proxy server associated with their blockchain-based domain name was seized.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}
{"mention": "The condition impacted the site's forums, inventory replenishments and other operations.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "In October, the actor who allegedly runs the site announced he had contracted COVID-19, spending a week in the hospital.", "sentence_right": "Intel 471 has also observed the site's clients complaining that the shop's payment card data quality was increasingly poor.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2020-12-17_jokers-stash-fbi-interpol-dns"}