{"mention": "Cybercriminals", "context_left": "", "context_right": "are interested in your SCADA systems", "_context_left": "", "_context_right": " are interested in your SCADA systems", "sentence_left": "", "sentence_right": "Feb 12, 2021", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "SCADA systems", "context_left": "Cybercriminals are interested in your", "context_right": "", "_context_left": "Cybercriminals are interested in your ", "_context_right": "", "sentence_left": "", "sentence_right": "Feb 12, 2021", "label": "Supervisory Control and Data Acquisition (SCADA) is a control system architecture that uses computers, networked data communications and graphical user interfaces for high-level process supervisory management, but uses other peripheral devices such as programmable logic controller (PLC) and discrete PID controllers to interface with the process plant or machinery. The use of SCADA has been also considered for management and operations of project-driven-process in construction.", "label_id": 31509, "label_title": "SCADA", "label_link": "https://en.wikipedia.org/wiki?curid=62437", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Florida city’s", "context_left": "The public learned this week of an alarming cybersecurity incident that could have physically harmed people: Someone managed to access a system that controlled a", "context_right": "water treatment plant, temporarily adjusting sodium hydroxide levels to amounts that could have made the population sick had the chemicals been introduced into the water supply.", "_context_left": "The public learned this week of an alarming cybersecurity incident that could have physically harmed people: Someone managed to access a system that controlled a ", "_context_right": " water treatment plant, temporarily adjusting sodium hydroxide levels to amounts that could have made the population sick had the chemicals been introduced into the water supply.", "sentence_left": "Feb 12, 2021", "sentence_right": "While city officials caught the action and reversed it within minutes, further reporting has shown the plant had an austere cybersecurity profile that is sadly familiar for public-sector organizations: [use of outdated operating systems](https://www.wfla.com/news/local-news/hacker-caught-altering-chemicals-in-oldsmar-water-supply-to-damaging-levels/), [disregard for best practices](https://arstechnica.com/information-technology/2021/02/breached-water-plant-employees-used-the-same-teamviewer-password-and-no-firewall/), and [lack of a budget](https://apnews.com/article/water-utilities-florida-coronavirus-pandemic-utilities-882ad1f6e9f80c053ef5f88a23b840f4?mid=1#cid=3510624) to support any real upgrade or staff additions.", "label": "Florida City is a city in Miami-Dade County, Florida, United States and is the southernmost municipality in the South Florida metropolitan area. Florida City is primarily a Miami suburb and a major agricultural area.  The city lies to the south and west of, and is contiguous with, Homestead. Both cities suffered catastrophic damage in August 1992 when Hurricane Andrew struck South Florida.  The city originated as a land promotion named Detroit. There were no buildings in the area when the first thirty families arrived in 1910, and they had to stay in Homestead until their houses could be built. The name was changed to Florida City when the town incorporated in 1914. It has a small historic area, but much of the city is hotels and other tourist facilities.  The city is at the eastern end of the only road running through the Everglades National Park, which terminates at Flamingo. Florida City is the southernmost city in the United States which is not on an island. It is also the last stop on the mainland north of the Florida Keys. The southern terminus of the Homestead Extension of Florida's Turnpike where it ends at its junction with U.S. 1 is located in Florida City. Homestead is immediately north and east of Florida City, and these two cities comprise the greater Homestead-Florida City area. Some of the notable unincorporated communities in the area are Redland, Leisure City, Naranja, and Princeton.", "label_id": 53716, "label_title": "Florida City, Florida", "label_link": "https://en.wikipedia.org/wiki?curid=109426", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "SCADA systems", "context_left": "Within the last year, Intel 471 has seen financially-motivated actors attempt to sell access to", "context_right": "tied to water treatment plants.", "_context_left": "Within the last year, Intel 471 has seen financially-motivated actors attempt to sell access to ", "_context_right": " tied to water treatment plants.", "sentence_left": "The actors in the cybercriminal underground understand that profile fits thousands of enterprises around the world, which gives them a rich target to set their sights on.", "sentence_right": "In May 2020, we observed a likely Iranian actor attempt to sell access to a U.S. “hydroelectric power plant.", "label": "Supervisory Control and Data Acquisition (SCADA) is a control system architecture that uses computers, networked data communications and graphical user interfaces for high-level process supervisory management, but uses other peripheral devices such as programmable logic controller (PLC) and discrete PID controllers to interface with the process plant or machinery. The use of SCADA has been also considered for management and operations of project-driven-process in construction.", "label_id": 31509, "label_title": "SCADA", "label_link": "https://en.wikipedia.org/wiki?curid=62437", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Iranian", "context_left": "In May 2020, we observed a likely", "context_right": "actor attempt to sell access to a U.S. “hydroelectric power plant.", "_context_left": "In May 2020, we observed a likely ", "_context_right": " actor attempt to sell access to a U.S. “hydroelectric power plant.", "sentence_left": "Within the last year, Intel 471 has seen financially-motivated actors attempt to sell access to SCADA systems tied to water treatment plants.", "sentence_right": "Further investigation found that what the actor was actually advertising was access to a water treatment plant in Florida, via a virtual network computing (VNC) permission that granted system access to a “Groundwater Recovery & Treatment System.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "U.S.", "context_left": "In May 2020, we observed a likely Iranian actor attempt to sell access to a", "context_right": "“hydroelectric power plant.", "_context_left": "In May 2020, we observed a likely Iranian actor attempt to sell access to a ", "_context_right": " “hydroelectric power plant.", "sentence_left": "Within the last year, Intel 471 has seen financially-motivated actors attempt to sell access to SCADA systems tied to water treatment plants.", "sentence_right": "Further investigation found that what the actor was actually advertising was access to a water treatment plant in Florida, via a virtual network computing (VNC) permission that granted system access to a “Groundwater Recovery & Treatment System.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Florida", "context_left": "Further investigation found that what the actor was actually advertising was access to a water treatment plant in", "context_right": ", via a virtual network computing (VNC) permission that granted system access to a “Groundwater Recovery & Treatment System.", "_context_left": "Further investigation found that what the actor was actually advertising was access to a water treatment plant in ", "_context_right": ", via a virtual network computing (VNC) permission that granted system access to a “Groundwater Recovery & Treatment System.", "sentence_left": "In May 2020, we observed a likely Iranian actor attempt to sell access to a U.S. “hydroelectric power plant.", "sentence_right": "Additionally, one screenshot showed levels and controls for a sodium hydroxide pump.", "label": "Florida () is the southernmost contiguous state in the United States. The state is bordered to the west by the Gulf of Mexico, to the northwest by Alabama, to the north by Georgia, to the east by the Atlantic Ocean, and to the south by the Straits of Florida. Florida is the 22nd-most extensive (), the 3rd-most populous (21,312,211 inhabitants), and the 8th-most densely populated () of the U.S. states. Jacksonville is the most populous municipality in the state and the largest city by area in the contiguous United States. The Miami metropolitan area is Florida's most populous urban area. Tallahassee is the state's capital.  Florida's $1.0 trillion economy is the fourth largest in the United States. If it were a country, Florida would be the 16th largest economy in the world, and the 58th most populous . In 2017, Florida's per capita personal income was $47,684, ranking 26th in the nation. The unemployment rate in September 2018 was 3.5% and ranked as the 18th in the United States. Florida exports nearly $55 billion in goods made in the state, the 8th highest among all states. The Miami Metropolitan Area is by far the largest urban economy in Florida and the 12th largest in the United States with a GDP of $345 billion . This is more than twice the number of the next metro area, the Tampa Bay Area, which has a GDP of $145 billion. Florida is home to 51 of the world's billionaires with most of them residing in South Florida.  The first European", "label_id": 2342852, "label_title": "Florida", "label_link": "https://en.wikipedia.org/wiki?curid=18933066", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Oldsmar", "context_left": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the", "context_right": ", Florida incident, there was no information that directly tied the two events together at the time this report was published.", "_context_left": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the ", "_context_right": ", Florida incident, there was no information that directly tied the two events together at the time this report was published.", "sentence_left": "Additionally, one screenshot showed levels and controls for a sodium hydroxide pump.", "sentence_right": "The actor shared this information in a Telegram channel that is known for cyberattacks and account cracking.", "label": "Oldsmar is a city in Pinellas County, Florida, United States. As of the 2010 census, the city had a population of 13,591. The Oldsmar name dates to April 12, 1916 when automobile pioneer Ransom E. Olds purchased of land by the northern part of Tampa Bay to establish \"R. E. Olds-on-the-Bay\". The name was later changed to Oldsmar, then to \"Tampa Shores\" in 1927, and finally back to Oldsmar in 1937. Ransom Olds named some of the original streets himself, such as Gim Gong Road for Lue Gim Gong.  Oldsmar includes several parks along Tampa Bay, historic bungalows, a downtown, and a commercial area along West Hillsborough Avenue. The historical society operates a museum in Oldsmar, and the city erected a new library in 2008.  In hopes of returning to the days of \"Old Florida\", Oldsmar's downtown is currently undergoing redevelopment efforts. Oldsmar celebrates its history every year with Oldsmar Days and Nights, including parades, car shows (featuring the Oldsmobile), and carnival rides. Notable Oldsmar businesses include the nearby Tampa Bay Downs and the production office of Nielsen Media Research.", "label_id": 53961, "label_title": "Oldsmar, Florida", "label_link": "https://en.wikipedia.org/wiki?curid=109679", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Florida", "context_left": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the Oldsmar,", "context_right": "incident, there was no information that directly tied the two events together at the time this report was published.", "_context_left": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the Oldsmar, ", "_context_right": " incident, there was no information that directly tied the two events together at the time this report was published.", "sentence_left": "Additionally, one screenshot showed levels and controls for a sodium hydroxide pump.", "sentence_right": "The actor shared this information in a Telegram channel that is known for cyberattacks and account cracking.", "label": "Florida () is the southernmost contiguous state in the United States. The state is bordered to the west by the Gulf of Mexico, to the northwest by Alabama, to the north by Georgia, to the east by the Atlantic Ocean, and to the south by the Straits of Florida. Florida is the 22nd-most extensive (), the 3rd-most populous (21,312,211 inhabitants), and the 8th-most densely populated () of the U.S. states. Jacksonville is the most populous municipality in the state and the largest city by area in the contiguous United States. The Miami metropolitan area is Florida's most populous urban area. Tallahassee is the state's capital.  Florida's $1.0 trillion economy is the fourth largest in the United States. If it were a country, Florida would be the 16th largest economy in the world, and the 58th most populous . In 2017, Florida's per capita personal income was $47,684, ranking 26th in the nation. The unemployment rate in September 2018 was 3.5% and ranked as the 18th in the United States. Florida exports nearly $55 billion in goods made in the state, the 8th highest among all states. The Miami Metropolitan Area is by far the largest urban economy in Florida and the 12th largest in the United States with a GDP of $345 billion . This is more than twice the number of the next metro area, the Tampa Bay Area, which has a GDP of $145 billion. Florida is home to 51 of the world's billionaires with most of them residing in South Florida.  The first European", "label_id": 2342852, "label_title": "Florida", "label_link": "https://en.wikipedia.org/wiki?curid=18933066", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Telegram", "context_left": "The actor shared this information in a", "context_right": "channel that is known for cyberattacks and account cracking.", "_context_left": "The actor shared this information in a ", "_context_right": " channel that is known for cyberattacks and account cracking.", "sentence_left": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the Oldsmar, Florida incident, there was no information that directly tied the two events together at the time this report was published.", "sentence_right": "It’s the same channel that has been [tied to a December 2020 incident](https://www.securityweek.com/iranian-hackers-access-unprotected-ics-israeli-water-facility) where actors allegedly had access to an unprotected human-machine interface (HMI) system at an Israeli water reservoir.", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Israeli", "context_left": "It’s the same channel that has been [tied to a December 2020 incident](https://www.securityweek.com/iranian-hackers-access-unprotected-ics-israeli-water-facility) where actors allegedly had access to an unprotected human-machine interface (HMI) system at an", "context_right": "water reservoir.", "_context_left": "It’s the same channel that has been [tied to a December 2020 incident](https://www.securityweek.com/iranian-hackers-access-unprotected-ics-israeli-water-facility) where actors allegedly had access to an unprotected human-machine interface (HMI) system at an ", "_context_right": " water reservoir.", "sentence_left": "The actor shared this information in a Telegram channel that is known for cyberattacks and account cracking.", "sentence_right": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or SCADA systems in order to build credibility in the cybercriminal underground.", "label": "Israel (; ; ), also known as the State of Israel, is a country in Western Asia, located on the southeastern shore of the Mediterranean Sea and the northern shore of the Red Sea. It has land borders with Lebanon to the north, Syria to the northeast, Jordan on the east, the Palestinian territories of the West Bank and Gaza Strip to the east and west, respectively, and Egypt to the southwest. The country contains geographically diverse features within its relatively small area. Israel's economic and technological center is Tel Aviv, while its seat of government and proclaimed capital is Jerusalem, although the state's sovereignty over Jerusalem has only partial recognition.  Israel has evidence of the earliest migration of hominids out of Africa. Canaanite tribes are archaeologically attested since the Middle Bronze Age, while the Kingdoms of Israel and Judah emerged during the Iron Age. The Neo-Assyrian Empire destroyed Israel around 720 BCE. Judah was later conquered by the Babylonian, Persian and Hellenistic empires and had existed as Jewish autonomous provinces. The successful Maccabean Revolt led to an independent Hasmonean kingdom by 110 BCE, which in 63 BCE however became a client state of the Roman Republic that subsequently installed the Herodian dynasty in 37 BCE, and in 6 CE created the Roman province of Judea. Judea lasted as a Roman province until the failed Jewish revolts resulted in widespread destruction, the expulsion of the Jewish population and the renaming of the region from \"Iudaea\" to \"Syria Palaestina\". Jewish presence in the region has", "label_id": 1453596, "label_title": "Israel", "label_link": "https://en.wikipedia.org/wiki?curid=9282173", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "SCADA systems", "context_left": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or", "context_right": "in order to build credibility in the cybercriminal underground.", "_context_left": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or ", "_context_right": " in order to build credibility in the cybercriminal underground.", "sentence_left": "It’s the same channel that has been [tied to a December 2020 incident](https://www.securityweek.com/iranian-hackers-access-unprotected-ics-israeli-water-facility) where actors allegedly had access to an unprotected human-machine interface (HMI) system at an Israeli water reservoir.", "sentence_right": "Actors with even a rudimentary understanding of how to use Shodan, a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in Oldsmar, Florida.", "label": "Supervisory Control and Data Acquisition (SCADA) is a control system architecture that uses computers, networked data communications and graphical user interfaces for high-level process supervisory management, but uses other peripheral devices such as programmable logic controller (PLC) and discrete PID controllers to interface with the process plant or machinery. The use of SCADA has been also considered for management and operations of project-driven-process in construction.", "label_id": 31509, "label_title": "SCADA", "label_link": "https://en.wikipedia.org/wiki?curid=62437", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Oldsmar", "context_left": "Actors with even a rudimentary understanding of how to use Shodan, a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in", "context_right": ", Florida.", "_context_left": "Actors with even a rudimentary understanding of how to use Shodan, a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in ", "_context_right": ", Florida.", "sentence_left": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or SCADA systems in order to build credibility in the cybercriminal underground.", "sentence_right": "Internet-connected systems like those that power critical infrastructure sectors are not regarded as a primary target for financially-motivated criminals.", "label": "Oldsmar is a city in Pinellas County, Florida, United States. As of the 2010 census, the city had a population of 13,591. The Oldsmar name dates to April 12, 1916 when automobile pioneer Ransom E. Olds purchased of land by the northern part of Tampa Bay to establish \"R. E. Olds-on-the-Bay\". The name was later changed to Oldsmar, then to \"Tampa Shores\" in 1927, and finally back to Oldsmar in 1937. Ransom Olds named some of the original streets himself, such as Gim Gong Road for Lue Gim Gong.  Oldsmar includes several parks along Tampa Bay, historic bungalows, a downtown, and a commercial area along West Hillsborough Avenue. The historical society operates a museum in Oldsmar, and the city erected a new library in 2008.  In hopes of returning to the days of \"Old Florida\", Oldsmar's downtown is currently undergoing redevelopment efforts. Oldsmar celebrates its history every year with Oldsmar Days and Nights, including parades, car shows (featuring the Oldsmobile), and carnival rides. Notable Oldsmar businesses include the nearby Tampa Bay Downs and the production office of Nielsen Media Research.", "label_id": 53961, "label_title": "Oldsmar, Florida", "label_link": "https://en.wikipedia.org/wiki?curid=109679", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Florida", "context_left": "Actors with even a rudimentary understanding of how to use Shodan, a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in Oldsmar,", "context_right": ".", "_context_left": "Actors with even a rudimentary understanding of how to use Shodan, a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in Oldsmar, ", "_context_right": ".", "sentence_left": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or SCADA systems in order to build credibility in the cybercriminal underground.", "sentence_right": "Internet-connected systems like those that power critical infrastructure sectors are not regarded as a primary target for financially-motivated criminals.", "label": "Florida () is the southernmost contiguous state in the United States. The state is bordered to the west by the Gulf of Mexico, to the northwest by Alabama, to the north by Georgia, to the east by the Atlantic Ocean, and to the south by the Straits of Florida. Florida is the 22nd-most extensive (), the 3rd-most populous (21,312,211 inhabitants), and the 8th-most densely populated () of the U.S. states. Jacksonville is the most populous municipality in the state and the largest city by area in the contiguous United States. The Miami metropolitan area is Florida's most populous urban area. Tallahassee is the state's capital.  Florida's $1.0 trillion economy is the fourth largest in the United States. If it were a country, Florida would be the 16th largest economy in the world, and the 58th most populous . In 2017, Florida's per capita personal income was $47,684, ranking 26th in the nation. The unemployment rate in September 2018 was 3.5% and ranked as the 18th in the United States. Florida exports nearly $55 billion in goods made in the state, the 8th highest among all states. The Miami Metropolitan Area is by far the largest urban economy in Florida and the 12th largest in the United States with a GDP of $345 billion . This is more than twice the number of the next metro area, the Tampa Bay Area, which has a GDP of $145 billion. Florida is home to 51 of the world's billionaires with most of them residing in South Florida.  The first European", "label_id": 2342852, "label_title": "Florida", "label_link": "https://en.wikipedia.org/wiki?curid=18933066", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Shodan", "context_left": "Actors with even a rudimentary understanding of how to use", "context_right": ", a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in Oldsmar, Florida.", "_context_left": "Actors with even a rudimentary understanding of how to use ", "_context_right": ", a search engine designed to find internet-connected systems, or where to find stolen or default credentials can obtain access to industrial control systems that could lead to incidents like what happened in Oldsmar, Florida.", "sentence_left": "Although threat actors do not often openly discuss this type of activity, there are those who seek to target ICS or SCADA systems in order to build credibility in the cybercriminal underground.", "sentence_right": "Internet-connected systems like those that power critical infrastructure sectors are not regarded as a primary target for financially-motivated criminals.", "label": "Shodan is a search engine that lets the user find specific types of computers (webcams, routers, servers, etc.) connected to the internet using a variety of filters. Some have also described it as a search engine of service banners, which are metadata that the server sends back to the client. This can be information about the server software, what options the service supports, a welcome message or anything else that the client can find out before interacting with the server.  Shodan collects data mostly on web servers (HTTP/HTTPS - port 80, 8080, 443, 8443), as well as FTP (port 21), SSH (port 22), Telnet (port 23), SNMP (port 161), IMAP (ports 143, or (encrypted) 993), SMTP (port 25), SIP (port 5060), and Real Time Streaming Protocol (RTSP, port 554). The latter can be used to access webcams and their video stream.  It was launched in 2009 by computer programmer John Matherly, who, in 2003, conceived the idea of searching devices linked to the Internet. The name Shodan is a reference to SHODAN, a character from the \"System Shock\" video game series.", "label_id": 4137724, "label_title": "Shodan (website)", "label_link": "https://en.wikipedia.org/wiki?curid=39054101", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Additionally, one screenshot showed levels and controls for a sodium hydroxide pump.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Further investigation found that what the actor was actually advertising was access to a water treatment plant in Florida, via a virtual network computing (VNC) permission that granted system access to a “Groundwater Recovery & Treatment System.", "sentence_right": "To be clear: Although Intel 471 could not definitively confirm or deny a link between the access offered by the actor and the Oldsmar, Florida incident, there was no information that directly tied the two events together at the time this report was published.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Feb 12, 2021", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Cybercriminals are interested in your SCADA systems", "sentence_right": "The public learned this week of an alarming cybersecurity incident that could have physically harmed people: Someone managed to access a system that controlled a Florida city’s water treatment plant, temporarily adjusting sodium hydroxide levels to amounts that could have made the population sick had the chemicals been introduced into the water supply.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "The actors in the cybercriminal underground understand that profile fits thousands of enterprises around the world, which gives them a rich target to set their sights on.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "While city officials caught the action and reversed it within minutes, further reporting has shown the plant had an austere cybersecurity profile that is sadly familiar for public-sector organizations: [use of outdated operating systems](https://www.wfla.com/news/local-news/hacker-caught-altering-chemicals-in-oldsmar-water-supply-to-damaging-levels/), [disregard for best practices](https://arstechnica.com/information-technology/2021/02/breached-water-plant-employees-used-the-same-teamviewer-password-and-no-firewall/), and [lack of a budget](https://apnews.com/article/water-utilities-florida-coronavirus-pandemic-utilities-882ad1f6e9f80c053ef5f88a23b840f4?mid=1#cid=3510624) to support any real upgrade or staff additions.", "sentence_right": "Within the last year, Intel 471 has seen financially-motivated actors attempt to sell access to SCADA systems tied to water treatment plants.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "Given the wide amount of poorly-guarded systems connected to the internet, it is not without reason to suggest it’s only a matter of time before someone on the cybercriminal underground turns ICS system access to a lucrative pipeline.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "However, actors are always refining their methods to find a way to make as much money as possible and boost their reputation and notoriety in the cybercrime ecosystem.", "sentence_right": "", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}
{"mention": "However, actors are always refining their methods to find a way to make as much money as possible and boost their reputation and notoriety in the cybercrime ecosystem.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Internet-connected systems like those that power critical infrastructure sectors are not regarded as a primary target for financially-motivated criminals.", "sentence_right": "Given the wide amount of poorly-guarded systems connected to the internet, it is not without reason to suggest it’s only a matter of time before someone on the cybercriminal underground turns ICS system access to a lucrative pipeline.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-02-12_scada-oldsmar-florida-water-treatment"}