{"mention": "United States", "context_left": "While these advertisements have proliferated for months, we have observed these schemes growing on underground forums that are rooted in the cybercrime ecosystem. Of those fake vaccine passes being advertised, we have seen the concentration placed on the", "context_right": "’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the European Union’s vaccine passport, which is issued in both digital and paper forms. On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "_context_left": "Of those fake vaccine passes being advertised, we have seen the concentration placed on the ", "_context_right": "’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the European Union’s vaccine passport, which is issued in both digital and paper forms.", "sentence_left": "While these advertisements have proliferated for months, we have observed these schemes growing on underground forums that are rooted in the cybercrime ecosystem.", "sentence_right": "On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "European Union’s", "context_left": "While these advertisements have proliferated for months, we have observed these schemes growing on underground forums that are rooted in the cybercrime ecosystem. Of those fake vaccine passes being advertised, we have seen the concentration placed on the United States’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the", "context_right": "vaccine passport, which is issued in both digital and paper forms. On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "_context_left": "Of those fake vaccine passes being advertised, we have seen the concentration placed on the United States’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the ", "_context_right": " vaccine passport, which is issued in both digital and paper forms.", "sentence_left": "While these advertisements have proliferated for months, we have observed these schemes growing on underground forums that are rooted in the cybercrime ecosystem.", "sentence_right": "On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "label": "The European Union (EU) is a political and economic union of member states that are located primarily in Europe. It has an area of and an estimated population of about 513 million. The EU has developed an internal single market through a standardised system of laws that apply in all member states in those matters, and only those matters, where members have agreed to act as one. EU policies aim to ensure the free movement of people, goods, services and capital within the internal market, enact legislation in justice and home affairs and maintain common policies on trade, agriculture, fisheries and regional development. For travel within the Schengen Area, passport controls have been abolished. A monetary union was established in 1999 and came into full force in 2002 and is composed of 19 EU member states which use the euro currency.  The EU and European citizenship were established when the Maastricht Treaty came into force in 1993. The EU traces its origins to the European Coal and Steel Community (ECSC) and the European Economic Community (EEC), established, respectively, by the 1951 Treaty of Paris and 1957 Treaty of Rome. The original members of what came to be known as the European Communities were the Inner Six: Belgium, France, Italy, Luxembourg, the Netherlands, and West Germany. The Communities and their successors have grown in size by the accession of new member states and in power by the addition of policy areas to their remit. The latest major amendment to the constitutional basis of the EU,", "label_id": 4321, "label_title": "European Union", "label_link": "https://en.wikipedia.org/wiki?curid=9317", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Telegram", "context_left": "The minority ruling are trying to destroy mankind. The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services", "context_right": ", WhatsApp, and Wickr, or encrypted email service ProtonMail. Another advertisement on the same forum offers fake CDC cards.", "_context_left": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services ", "_context_right": ", WhatsApp, and Wickr, or encrypted email service ProtonMail.", "sentence_left": "The minority ruling are trying to destroy mankind.", "sentence_right": "Another advertisement on the same forum offers fake CDC cards.", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Wickr", "context_left": "The minority ruling are trying to destroy mankind. The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and", "context_right": ", or encrypted email service ProtonMail. Another advertisement on the same forum offers fake CDC cards.", "_context_left": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and ", "_context_right": ", or encrypted email service ProtonMail.", "sentence_left": "The minority ruling are trying to destroy mankind.", "sentence_right": "Another advertisement on the same forum offers fake CDC cards.", "label": "Wickr is an American software company based in San Francisco. The company is best known for its instant messenger application of the same name.  The Wickr instant messaging apps allow users to exchange end-to-end encrypted and content-expiring messages, including photos, videos, and file attachments and place end-to-end encrypted video conference calls. The software is available for the iOS, Android, Mac, Windows 10, and Linux operating systems.  In November 2018, Wickr was chosen as a leader among the 10 selected emerging technology companies that research firm Forrester invited to participate in its independent evaluation.  According to the report, Wickr received the highest possible score of “differentiated” in the criteria of encryption and key management, user privacy and verification, performance, enhanced security or privacy functionality, customizations and integrations, deployment and management, vision and execution, and global reach and customer support.", "label_id": 4349543, "label_title": "Wickr", "label_link": "https://en.wikipedia.org/wiki?curid=41322476", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "European", "context_left": "Another advertisement on the same forum offers fake CDC cards. These falsified documents are focused on the", "context_right": "and French documents and associated false QR codes. The website, accessible via the TOR browser, shows what the final QR code product will look like:", "_context_left": "These falsified documents are focused on the ", "_context_right": " and French documents and associated false QR codes.", "sentence_left": "Another advertisement on the same forum offers fake CDC cards.", "sentence_right": "The website, accessible via the TOR browser, shows what the final QR code product will look like:", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "French", "context_left": "Another advertisement on the same forum offers fake CDC cards. These falsified documents are focused on the European and", "context_right": "documents and associated false QR codes. The website, accessible via the TOR browser, shows what the final QR code product will look like:", "_context_left": "These falsified documents are focused on the European and ", "_context_right": " documents and associated false QR codes.", "sentence_left": "Another advertisement on the same forum offers fake CDC cards.", "sentence_right": "The website, accessible via the TOR browser, shows what the final QR code product will look like:", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "French", "context_left": "![Screen Shot 2021 10 08 at 10 46 30 AM]() An example of a fake", "context_right": "digital COVID passport taken from an underground website. (Intel 471)", "_context_left": "An example of a fake ", "_context_right": " digital COVID passport taken from an underground website.", "sentence_left": "![Screen Shot 2021 10 08 at 10 46 30 AM]()", "sentence_right": "(Intel 471)", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "AstraZeneca", "context_left": "(Intel 471) With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market:", "context_right": ", Johnson & Johnson, Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales. However, that e-commerce website was not working at the time this blog post was published.", "_context_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: ", "_context_right": ", Johnson & Johnson, Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "sentence_left": "(Intel 471)", "sentence_right": "However, that e-commerce website was not working at the time this blog post was published.", "label": "AstraZeneca plc is a British-Swedish multinational pharmaceutical and biopharmaceutical company. In 2013, it moved its headquarters to Cambridge, UK, and concentrated its R&D in three sites: Cambridge; Gaithersburg, Maryland, USA (location of MedImmune) for work on biopharmaceuticals; and Molndal (near Gothenburg) in Sweden, for research on traditional chemical drugs. AstraZeneca has a portfolio of products for major disease areas including cancer, cardiovascular, gastrointestinal, infection, neuroscience, respiratory and inflammation.  The company was founded in 1999 through the merger of the Swedish Astra AB and the English Zeneca Group (itself formed by the demerger of the pharmaceutical operations of Imperial Chemical Industries in 1993). Since the merger it has been among the world's largest pharmaceutical companies and has made numerous corporate acquisitions, including Cambridge Antibody Technology (in 2006), MedImmune (in 2007), Spirogen (in 2013) and Definiens (by MedImmune in 2014).  AstraZeneca has a primary listing on the London Stock Exchange and is a constituent of the FTSE 100 Index. It has secondary listings on the New York Stock Exchange and the OMX exchange.", "label_id": 184672, "label_title": "AstraZeneca", "label_link": "https://en.wikipedia.org/wiki?curid=441872", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Johnson & Johnson", "context_left": "(Intel 471) With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca,", "context_right": ", Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales. However, that e-commerce website was not working at the time this blog post was published.", "_context_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, ", "_context_right": ", Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "sentence_left": "(Intel 471)", "sentence_right": "However, that e-commerce website was not working at the time this blog post was published.", "label": "Johnson & Johnson is an American multinational medical devices, pharmaceutical and consumer packaged goods manufacturing company founded in 1886. Its common stock is a component of the Dow Jones Industrial Average and the company is ranked No. 37 on the 2018 Fortune 500 list of the largest United States corporations by total revenue. J&J is one of the world's most valuable companies.  Johnson & Johnson is headquartered in New Brunswick, New Jersey, the consumer division being located in Skillman, New Jersey. The corporation includes some 250 subsidiary companies with operations in 60 countries and products sold in over 175 countries. Johnson & Johnson had worldwide sales of $70.1 billion during calendar year 2015. Johnson & Johnson's brands include numerous household names of medications and first aid supplies. Among its well-known consumer products are the Band-Aid Brand line of bandages, Tylenol medications, Johnson's Baby products, Neutrogena skin and beauty products, Clean & Clear facial wash and Acuvue contact lenses.", "label_id": 94318, "label_title": "Johnson & Johnson", "label_link": "https://en.wikipedia.org/wiki?curid=166826", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Moderna", "context_left": "(Intel 471) With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson,", "context_right": ", Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales. However, that e-commerce website was not working at the time this blog post was published.", "_context_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson, ", "_context_right": ", Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "sentence_left": "(Intel 471)", "sentence_right": "However, that e-commerce website was not working at the time this blog post was published.", "label": "Pfizer Inc. () is an American multinational pharmaceutical corporation headquartered in New York City, with its research headquarters in Groton, Connecticut. It is one of the world's largest pharmaceutical companies. It is listed on the New York Stock Exchange, and its shares have been a component of the Dow Jones Industrial Average since 2004. Pfizer ranked No. 57 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.  On December 19, 2018, Pfizer announced a joint merger of their consumer healthcare division with UK pharma giant GlaxoSmithKline; the British company will maintain a controlling share (listed at 68%).  The company develops and produces medicines and vaccines for a wide range of medical disciplines, including immunology, oncology, cardiology, endocrinology, and neurology. Its products include the blockbuster drug Lipitor (atorvastatin), used to lower LDL blood cholesterol; Lyrica (pregabalin) for neuropathic pain and fibromyalgia; Diflucan (fluconazole), an oral antifungal medication; Zithromax (azithromycin), an antibiotic; Viagra (sildenafil) for erectile dysfunction; and Celebrex (also Celebra, celecoxib), an anti-inflammatory drug.  In 2016, Pfizer Inc. was expected to merge with Allergan, Plc to create the Ireland-based \"Pfizer plc\" in a deal that would have been worth $160 billion. The merger was called off in April 2016, however, because of new rules from the United States Treasury against tax inversions, a method of avoiding taxes by merging with a foreign company. The company has made the second-largest pharmaceutical settlement with the United States Department of Justice.", "label_id": 31452, "label_title": "Pfizer", "label_link": "https://en.wikipedia.org/wiki?curid=62304", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Pfizer", "context_left": "(Intel 471) With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson, Moderna,", "context_right": ", and Sputnik V. Buyers were then directed to visit a particular website set up for sales. However, that e-commerce website was not working at the time this blog post was published.", "_context_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson, Moderna, ", "_context_right": ", and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "sentence_left": "(Intel 471)", "sentence_right": "However, that e-commerce website was not working at the time this blog post was published.", "label": "Pfizer Inc. () is an American multinational pharmaceutical corporation headquartered in New York City, with its research headquarters in Groton, Connecticut. It is one of the world's largest pharmaceutical companies. It is listed on the New York Stock Exchange, and its shares have been a component of the Dow Jones Industrial Average since 2004. Pfizer ranked No. 57 on the 2018 Fortune 500 list of the largest United States corporations by total revenue.  On December 19, 2018, Pfizer announced a joint merger of their consumer healthcare division with UK pharma giant GlaxoSmithKline; the British company will maintain a controlling share (listed at 68%).  The company develops and produces medicines and vaccines for a wide range of medical disciplines, including immunology, oncology, cardiology, endocrinology, and neurology. Its products include the blockbuster drug Lipitor (atorvastatin), used to lower LDL blood cholesterol; Lyrica (pregabalin) for neuropathic pain and fibromyalgia; Diflucan (fluconazole), an oral antifungal medication; Zithromax (azithromycin), an antibiotic; Viagra (sildenafil) for erectile dysfunction; and Celebrex (also Celebra, celecoxib), an anti-inflammatory drug.  In 2016, Pfizer Inc. was expected to merge with Allergan, Plc to create the Ireland-based \"Pfizer plc\" in a deal that would have been worth $160 billion. The merger was called off in April 2016, however, because of new rules from the United States Treasury against tax inversions, a method of avoiding taxes by merging with a foreign company. The company has made the second-largest pharmaceutical settlement with the United States Department of Justice.", "label_id": 31452, "label_title": "Pfizer", "label_link": "https://en.wikipedia.org/wiki?curid=62304", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "“Watch out and stay away from the vaccine; it’s poisonous.", "context_left": "“We do this to help people who are in critical situations and want to travel urgently,” the advertisement reads.", "context_right": "Kindly pass out the message to those who are still blind out there, so many secrets are hidden from us.", "_context_left": "", "_context_right": "", "sentence_left": "“We do this to help people who are in critical situations and want to travel urgently,” the advertisement reads.", "sentence_right": "Kindly pass out the message to those who are still blind out there, so many secrets are hidden from us.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Kindly pass out the message to those who are still blind out there, so many secrets are hidden from us.", "context_left": "“Watch out and stay away from the vaccine; it’s poisonous.", "context_right": "The minority ruling are trying to destroy mankind.", "_context_left": "", "_context_right": "", "sentence_left": "“Watch out and stay away from the vaccine; it’s poisonous.", "sentence_right": "The minority ruling are trying to destroy mankind.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "There have been numerous reports that this falsified document practice has been going on for months.", "context_left": "However, that e-commerce website was not working at the time this blog post was published.", "context_right": "However, we have seen the market change as the virus causes different issues in various parts of the world.", "_context_left": "", "_context_right": "", "sentence_left": "However, that e-commerce website was not working at the time this blog post was published.", "sentence_right": "However, we have seen the market change as the virus causes different issues in various parts of the world.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "“We do this to help people who are in critical situations and want to travel urgently,” the advertisement reads.", "context_left": "On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "context_right": "“Watch out and stay away from the vaccine; it’s poisonous.", "_context_left": "", "_context_right": "", "sentence_left": "On one particular cybercrime forum, an actor has listed several advertisements for fake vaccination cards that parrots a lot of the misinformation that surround the various COVID-19 vaccines.", "sentence_right": "“Watch out and stay away from the vaccine; it’s poisonous.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "However, that e-commerce website was not working at the time this blog post was published.", "context_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson, Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "context_right": "There have been numerous reports that this falsified document practice has been going on for months.", "_context_left": "", "_context_right": "", "sentence_left": "With regards to the actual vaccine, an actor’s advertisement that Intel 471 observed claimed to be able to send potential buyers numerous different vaccines currently on the market: AstraZeneca, Johnson & Johnson, Moderna, Pfizer, and Sputnik V. Buyers were then directed to visit a particular website set up for sales.", "sentence_right": "There have been numerous reports that this falsified document practice has been going on for months.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "Another advertisement on the same forum offers fake CDC cards.", "context_left": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and Wickr, or encrypted email service ProtonMail.", "context_right": "These falsified documents are focused on the European and French documents and associated false QR codes.", "_context_left": "", "_context_right": "", "sentence_left": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and Wickr, or encrypted email service ProtonMail.", "sentence_right": "These falsified documents are focused on the European and French documents and associated false QR codes.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "* Read open-source news to determine which countries are not getting enough, or any, deliveries of the vaccine.", "context_left": "Actors will:", "context_right": "* Market the illegal vaccine to these developing countries since these nations have no private way of obtaining vaccines and must instead rely on COVAX distribution.", "_context_left": "", "_context_right": "", "sentence_left": "Actors will:", "sentence_right": "* Market the illegal vaccine to these developing countries since these nations have no private way of obtaining vaccines and must instead rely on COVAX distribution.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "![Screen Shot 2021 10 08 at 10 46 30 AM]()", "context_left": "The website, accessible via the TOR browser, shows what the final QR code product will look like:", "context_right": "An example of a fake French digital COVID passport taken from an underground website.", "_context_left": "", "_context_right": "", "sentence_left": "The website, accessible via the TOR browser, shows what the final QR code product will look like:", "sentence_right": "An example of a fake French digital COVID passport taken from an underground website.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "No matter the damage wrought, it shows that cybercriminals and the forums where they gather online will take on any scheme, no matter how technical, in order to make money.", "context_left": "In addition, fake vaccine passports harm healthcare, erodes government trust with false information, and can disrupt local and national economies.", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "In addition, fake vaccine passports harm healthcare, erodes government trust with false information, and can disrupt local and national economies.", "sentence_right": "", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "The minority ruling are trying to destroy mankind.", "context_left": "Kindly pass out the message to those who are still blind out there, so many secrets are hidden from us.", "context_right": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and Wickr, or encrypted email service ProtonMail.", "_context_left": "", "_context_right": "", "sentence_left": "Kindly pass out the message to those who are still blind out there, so many secrets are hidden from us.", "sentence_right": "The actor has set up several communication channels for anyone interested: potential customers can reach out via encrypted messaging services Telegram, WhatsApp, and Wickr, or encrypted email service ProtonMail.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}
{"mention": "While these advertisements have proliferated for months, we have observed these schemes growing on underground forums that are rooted in the cybercrime ecosystem.", "context_left": "Intel 471 has observed numerous actors on various underground forums selling fake COVID vaccine certifications, as well as several forums hosting advertisements for COVID-19 vaccines.", "context_right": "Of those fake vaccine passes being advertised, we have seen the concentration placed on the United States’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the European Union’s vaccine passport, which is issued in both digital and paper forms.", "_context_left": "", "_context_right": "", "sentence_left": "Intel 471 has observed numerous actors on various underground forums selling fake COVID vaccine certifications, as well as several forums hosting advertisements for COVID-19 vaccines.", "sentence_right": "Of those fake vaccine passes being advertised, we have seen the concentration placed on the United States’ Centers for Disease Control and Prevention’s vaccination card, which is a paper form, and the European Union’s vaccine passport, which is issued in both digital and paper forms.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "intel471_2021-10-20_fake-covid-vaccination-cards-cybercrime"}