{"mention": "Iran", "context_left": "TA428 Group abusing recent conflict between", "context_right": "and USA", "_context_left": "TA428 Group abusing recent conflict between ", "_context_right": " and USA", "sentence_left": "", "sentence_right": "January 09, 2020", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "USA", "context_left": "TA428 Group abusing recent conflict between Iran and", "context_right": "", "_context_left": "TA428 Group abusing recent conflict between Iran and ", "_context_right": "", "sentence_left": "", "sentence_right": "January 09, 2020", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "TA428", "context_left": "", "context_right": "Group abusing recent conflict between Iran and USA", "_context_left": "", "_context_right": " Group abusing recent conflict between Iran and USA", "sentence_left": "", "sentence_right": "January 09, 2020", "label": "TA428", "label_id": 1312, "label_title": "TA428", "label_link": "http://www.bosch.com#node1fvup9pj1x43", "entity_class": "CE", "entity_type": "GROUP", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "India", "context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect", "context_right": "and Pakistan.doc” which is directly related to recent political events between Iran and the USA.", "_context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect ", "_context_right": " and Pakistan.doc” which is directly related to recent political events between Iran and the USA.", "sentence_left": "January 09, 2020", "sentence_right": "![](https://lab52.io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "Pakistan", "context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and", "context_right": ".doc” which is directly related to recent political events between Iran and the USA.", "_context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and ", "_context_right": ".doc” which is directly related to recent political events between Iran and the USA.", "sentence_left": "January 09, 2020", "sentence_right": "![](https://lab52.io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "Iran", "context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and Pakistan.doc” which is directly related to recent political events between", "context_right": "and the USA.", "_context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and Pakistan.doc” which is directly related to recent political events between ", "_context_right": " and the USA.", "sentence_left": "January 09, 2020", "sentence_right": "![](https://lab52.io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "USA", "context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and Pakistan.doc” which is directly related to recent political events between Iran and the", "context_right": ".", "_context_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and Pakistan.doc” which is directly related to recent political events between Iran and the ", "_context_right": ".", "sentence_left": "January 09, 2020", "sentence_right": "![](https://lab52.io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "lab52", "context_left": "![](https://", "context_right": ".io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "_context_left": "![](https://", "_context_right": ".io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "sentence_left": "Recently, a suspicious document has caught our attention due to its recent creation date (06-01-2020) and its title “How Swuleimani’s death will affect India and Pakistan.doc” which is directly related to recent political events between Iran and the USA.", "sentence_right": "The document is in RTF format, and has an OLE object related with the Equation Editor.", "label": "A company, abbreviated as co., is a legal entity made up of an association of people, be they natural, legal, or a mixture of both, for carrying on a commercial or industrial enterprise. Company members share a common purpose, and unite to focus their various talents and organize their collectively available skills or resources to achieve specific, declared goals. Companies take various forms, such as:   A company or association of persons can be created at law as a legal person so that the company in itself can accept limited liability for civil responsibility and taxation incurred as members perform (or fail to discharge) their duty within the publicly declared \"\"birth certificate\"\" or published policy.  Companies as legal persons may associate and register themselves collectively as other companies – often known as a corporate group. When a company closes, it may need a \"\"death certificate\"\" to avoid further legal obligations.", "label_id": 986634, "label_title": "Company", "label_link": "https://en.wikipedia.org/wiki?curid=4918223", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "document is in RTF format, and has an OLE object related with the Equation Editor", "context_left": "The", "context_right": ".", "_context_left": "The ", "_context_right": ".", "sentence_left": "![](https://lab52.io/blog/wp-content/uploads/2020/01/Captura-de-pantalla-de-2020-01-09-16-44-17.png)", "sentence_right": "During the last years, this OLE objects have been a good indicator that a document may aim to exploit the CVE-2018-0798 vulnerability in order to infect with some kind of malware.", "label": "Adversaries may send phishing messages to gain access to victim systems. All forms of phishing are electronically delivered social engineering. Phishing can be targeted, known as spearphishing. In spearphishing, a specific individual, company, or industry will be targeted by the adversary. More generally, adversaries can conduct non-targeted phishing, such as in mass malware spam campaigns. Adversaries may send victims emails containing malicious attachments or links, typically to execute malicious code on victim systems. Phishing may also be conducted via third-party services, like social media platforms. Phishing may also involve social engineering techniques, such as posing as a trusted source.", "label_id": 161, "label_title": "Phishing", "label_link": "https://attack.mitre.org/techniques/T1566", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "document may aim to exploit the CVE-2018-0798 vulnerability in order to infect with some kind of malware.", "context_left": "During the last years, this OLE objects have been a good indicator that a", "context_right": "", "_context_left": "During the last years, this OLE objects have been a good indicator that a ", "_context_right": "", "sentence_left": "The document is in RTF format, and has an OLE object related with the Equation Editor.", "sentence_right": "This particular document turns out to be one of these examples, and does it by dropping a binary called 8.t. in the “% TEMP%” folder of the user.", "label": "Adversaries may exploit software vulnerabilities in client applications to execute code. Vulnerabilities can exist in software due to unsecure coding practices that can lead to unanticipated behavior. Adversaries can take advantage of certain vulnerabilities through targeted exploitation for the purpose of arbitrary code execution. Oftentimes the most valuable exploits to an offensive toolkit are those that can be used to obtain code execution on a remote system because they can be used to gain access to that system. Users will expect to see files related to the applications they commonly used to do work, so they are a useful target for exploit research and development because of their high utility. Several types exist: ### Browser-based Exploitation Web browsers are a common target through [Drive-by Compromise](https://attack.mitre.org/techniques/T1189) and [Spearphishing Link](https://attack.mitre.org/techniques/T1566/002). Endpoint systems may be compromised through normal web browsing or from certain users being targeted by links in spearphishing emails to adversary controlled sites used to exploit the web browser. These often do not require an action by the user for the exploit to be executed. ### Office Applications Common office and productivity applications such as Microsoft Office are also targeted through [Phishing](https://attack.mitre.org/techniques/T1566). Malicious files will be transmitted directly as attachments or through links to download them. These require the user to open the document or file for the exploit to run. ### Common Third-party Applications Other applications that are commonly seen or are part of the software deployed in a target network may also be used for exploitation. Applications such as Adobe Reader and Flash,", "label_id": 549, "label_title": "Exploitation for Client Execution", "label_link": "https://attack.mitre.org/techniques/T1203", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "particular document turns out to be one of these examples, and does it by dropping a binary called 8.t. in the “% TEMP%” folder of the user.", "context_left": "This", "context_right": "", "_context_left": "This ", "_context_right": "", "sentence_left": "During the last years, this OLE objects have been a good indicator that a document may aim to exploit the CVE-2018-0798 vulnerability in order to infect with some kind of malware.", "sentence_right": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ProofPoint related with a suspected Chinese cybercrime Group known as [TA428]", "label": "Adversaries may send phishing messages to gain access to victim systems. All forms of phishing are electronically delivered social engineering. Phishing can be targeted, known as spearphishing. In spearphishing, a specific individual, company, or industry will be targeted by the adversary. More generally, adversaries can conduct non-targeted phishing, such as in mass malware spam campaigns. Adversaries may send victims emails containing malicious attachments or links, typically to execute malicious code on victim systems. Phishing may also be conducted via third-party services, like social media platforms. Phishing may also involve social engineering techniques, such as posing as a trusted source.", "label_id": 161, "label_title": "Phishing", "label_link": "https://attack.mitre.org/techniques/T1566", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "ProofPoint", "context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from", "context_right": "related with a suspected Chinese cybercrime Group known as [TA428]", "_context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ", "_context_right": " related with a suspected Chinese cybercrime Group known as [TA428]", "sentence_left": "This particular document turns out to be one of these examples, and does it by dropping a binary called 8.t. in the “% TEMP%” folder of the user.", "sentence_right": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "Chinese", "context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ProofPoint related with a suspected", "context_right": "cybercrime Group known as [TA428]", "_context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ProofPoint related with a suspected ", "_context_right": " cybercrime Group known as [TA428]", "sentence_left": "This particular document turns out to be one of these examples, and does it by dropping a binary called 8.t. in the “% TEMP%” folder of the user.", "sentence_right": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "TA428", "context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ProofPoint related with a suspected Chinese cybercrime Group known as [", "context_right": "]", "_context_left": "Up to this point, everything coincides in terms of TTPs with what is described in the following report, from ProofPoint related with a suspected Chinese cybercrime Group known as [", "_context_right": "]", "sentence_left": "This particular document turns out to be one of these examples, and does it by dropping a binary called 8.t. in the “% TEMP%” folder of the user.", "sentence_right": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "label": "TA428", "label_id": 1312, "label_title": "TA428", "label_link": "http://www.bosch.com#node1fvup9pj1x43", "entity_class": "CE", "entity_type": "GROUP", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "DLL executable file", "context_left": "After this infection chain, what we get is a", "context_right": "with extension “.wll” used for “Word.addin.8” files, that is installed in the path “%APPDATA%\\Microsoft\\Word\\STARTUP” which causes that MSWord at the next application startup to load this “.wll” executable file.", "_context_left": "After this infection chain, what we get is a ", "_context_right": " with extension “.wll” used for “Word.addin.8” files, that is installed in the path “%APPDATA%\\Microsoft\\Word\\STARTUP” which causes that MSWord at the next application startup to load this “.wll” executable file.", "sentence_left": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "sentence_right": "(Which also coincides with the TTPs described in the previous post)", "label": "An adversary may rely upon specific actions by a user in order to gain execution. Users may be subjected to social engineering to get them to execute malicious code by, for example, opening a malicious document file or link. These user actions will typically be observed as follow-on behavior from forms of [Phishing](https://attack.mitre.org/techniques/T1566). While [User Execution](https://attack.mitre.org/techniques/T1204) frequently occurs shortly after Initial Access it may occur at other phases of an intrusion, such as when an adversary places a file in a shared directory or on a user's desktop hoping that a user will click on it. This activity may also be seen shortly after [Internal Spearphishing](https://attack.mitre.org/techniques/T1534).", "label_id": 260, "label_title": "User Execution", "label_link": "https://attack.mitre.org/techniques/T1204", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "wll” used for “Word.addin.8” files, that is installed in the path “%APPDATA%\\Microsoft\\Word\\STARTUP”", "context_left": "After this infection chain, what we get is a DLL executable file with extension “.", "context_right": "which causes that MSWord at the next application startup to load this “.wll” executable file.", "_context_left": "After this infection chain, what we get is a DLL executable file with extension “.", "_context_right": " which causes that MSWord at the next application startup to load this “.wll” executable file.", "sentence_left": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "sentence_right": "(Which also coincides with the TTPs described in the previous post)", "label": "Adversaries may leverage Microsoft Office-based applications for persistence between startups. Microsoft Office is a fairly common application suite on Windows-based operating systems within an enterprise network. There are multiple mechanisms that can be used with Office for persistence when an Office-based application is started; this can include the use of Office Template Macros and add-ins. A variety of features have been discovered in Outlook that can be abused to obtain persistence, such as Outlook rules, forms, and Home Page.(Citation: SensePost Ruler GitHub) These persistence mechanisms can work within Outlook or be used through Office 365.(Citation: TechNet O365 Outlook Rules)", "label_id": 264, "label_title": "Office Application Startup", "label_link": "https://attack.mitre.org/techniques/T1137", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "causes that MSWord at the next application startup to load this “.wll” executable file.", "context_left": "After this infection chain, what we get is a DLL executable file with extension “.wll” used for “Word.addin.8” files, that is installed in the path “%APPDATA%\\Microsoft\\Word\\STARTUP” which", "context_right": "", "_context_left": "After this infection chain, what we get is a DLL executable file with extension “.wll” used for “Word.addin.8” files, that is installed in the path “%APPDATA%\\Microsoft\\Word\\STARTUP” which ", "_context_right": "", "sentence_left": "(https://www.proofpoint.com/us/threat-insight/post/chinese-apt-operation-lagtime-it-targets-government-information-technology).", "sentence_right": "(Which also coincides with the TTPs described in the previous post)", "label": "Adversaries may leverage Microsoft Office-based applications for persistence between startups. Microsoft Office is a fairly common application suite on Windows-based operating systems within an enterprise network. There are multiple mechanisms that can be used with Office for persistence when an Office-based application is started; this can include the use of Office Template Macros and add-ins. A variety of features have been discovered in Outlook that can be abused to obtain persistence, such as Outlook rules, forms, and Home Page.(Citation: SensePost Ruler GitHub) These persistence mechanisms can work within Outlook or be used through Office 365.(Citation: TechNet O365 Outlook Rules)", "label_id": 264, "label_title": "Office Application Startup", "label_link": "https://attack.mitre.org/techniques/T1137", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "PoisonIvy", "context_left": "This DLL consists in a packed version of a", "context_right": "RAT sample, that after a few seconds makes traffic to the C2 server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "_context_left": "This DLL consists in a packed version of a ", "_context_right": " RAT sample, that after a few seconds makes traffic to the C2 server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "sentence_left": "(Which also coincides with the TTPs described in the previous post)", "sentence_right": "The IP address is part of the infrastructure that appears in the post, indicating that it is probably the same actor reusing his old infrastructure in a new campaign, taking advantage of the conflict mentioned at the beginning of the article.", "label": "[PoisonIvy](https://attack.mitre.org/software/S0012) is a popular remote access tool (RAT) that has been used by many groups. (Citation: FireEye Poison Ivy) (Citation: Symantec Elderwood Sept 2012) (Citation: Symantec Darkmoon Aug 2005)", "label_id": 926, "label_title": "PoisonIvy", "label_link": "https://attack.mitre.org/software/S0012", "entity_class": "CE", "entity_type": "MALWARE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "C2", "context_left": "This DLL consists in a packed version of a PoisonIvy RAT sample, that after a few seconds makes traffic to the", "context_right": "server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "_context_left": "This DLL consists in a packed version of a PoisonIvy RAT sample, that after a few seconds makes traffic to the ", "_context_right": " server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "sentence_left": "(Which also coincides with the TTPs described in the previous post)", "sentence_right": "The IP address is part of the infrastructure that appears in the post, indicating that it is probably the same actor reusing his old infrastructure in a new campaign, taking advantage of the conflict mentioned at the beginning of the article.", "label": "The adversary is trying to communicate with compromised systems to control them. Command and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.", "label_id": 581, "label_title": "Command and Control", "label_link": "https://attack.mitre.org/tactics/TA0011", "entity_class": "CE", "entity_type": "TACTIC", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "DLL consists in a packed version", "context_left": "This", "context_right": "of a PoisonIvy RAT sample, that after a few seconds makes traffic to the C2 server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "_context_left": "This ", "_context_right": " of a PoisonIvy RAT sample, that after a few seconds makes traffic to the C2 server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "sentence_left": "(Which also coincides with the TTPs described in the previous post)", "sentence_right": "The IP address is part of the infrastructure that appears in the post, indicating that it is probably the same actor reusing his old infrastructure in a new campaign, taking advantage of the conflict mentioned at the beginning of the article.", "label": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. Payloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and [Deobfuscate/Decode Files or Information](https://attack.mitre.org/techniques/T1140) for [User Execution](https://attack.mitre.org/techniques/T1204). The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary. (Citation: Volexity PowerDuke November 2016) Adversaries may also used compressed or archived scripts, such as JavaScript. Portions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery. (Citation: Linux/Cdorked.A We Live Security Analysis) Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. (Citation: Carbon Black Obfuscation Sept 2016) Adversaries may also obfuscate commands executed from payloads or directly via a [Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059). Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms. (Citation: FireEye Obfuscation June 2017) (Citation: FireEye Revoke-Obfuscation July 2017)(Citation: PaloAlto EncodedCommand March 2017)", "label_id": 544, "label_title": "Obfuscated Files or Information", "label_link": "https://attack.mitre.org/techniques/T1027", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "traffic to the C2 server “95.179.131.29”, through port 443, and in case of error, through port 8080 using HTTP traffic.", "context_left": "This DLL consists in a packed version of a PoisonIvy RAT sample, that after a few seconds makes", "context_right": "", "_context_left": "This DLL consists in a packed version of a PoisonIvy RAT sample, that after a few seconds makes ", "_context_right": "", "sentence_left": "(Which also coincides with the TTPs described in the previous post)", "sentence_right": "The IP address is part of the infrastructure that appears in the post, indicating that it is probably the same actor reusing his old infrastructure in a new campaign, taking advantage of the conflict mentioned at the beginning of the article.", "label": "Adversaries may communicate using application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. Adversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, or DNS. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP.", "label_id": 452, "label_title": "Application Layer Protocol", "label_link": "https://attack.mitre.org/techniques/T1071", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "infecting their victims through this kind of phishing campaings.", "context_left": "It is always critical to remain alert with any attachments that is related to any recent geopolitical conflict, as previously stated, the attackers usually take advantage of them as a mean of", "context_right": "", "_context_left": "It is always critical to remain alert with any attachments that is related to any recent geopolitical conflict, as previously stated, the attackers usually take advantage of them as a mean of ", "_context_right": "", "sentence_left": "The IP address is part of the infrastructure that appears in the post, indicating that it is probably the same actor reusing his old infrastructure in a new campaign, taking advantage of the conflict mentioned at the beginning of the article.", "sentence_right": "| Document SHA256  | 0eb7ba6457367f8f5f917f37ebbf1e7ccf0e971557dbe5d7547e49d129ac0e98 |", "label": "Adversaries may send phishing messages to gain access to victim systems. All forms of phishing are electronically delivered social engineering. Phishing can be targeted, known as spearphishing. In spearphishing, a specific individual, company, or industry will be targeted by the adversary. More generally, adversaries can conduct non-targeted phishing, such as in mass malware spam campaigns. Adversaries may send victims emails containing malicious attachments or links, typically to execute malicious code on victim systems. Phishing may also be conducted via third-party services, like social media platforms. Phishing may also involve social engineering techniques, such as posing as a trusted source.", "label_id": 161, "label_title": "Phishing", "label_link": "https://attack.mitre.org/techniques/T1566", "entity_class": "CE", "entity_type": "TECHNIQUE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}
{"mention": "Poison IvyC2", "context_left": "|", "context_right": "| 95.179.131.29 |", "_context_left": "| ", "_context_right": "     | 95.179.131.29 |", "sentence_left": "| Poison IvySHA256 | 02dec90a18545d4bfbac5de19c6499142e141c3c0abaecdc8ac56b8eede167aa |", "sentence_right": "", "label": "[PoisonIvy](https://attack.mitre.org/software/S0012) is a popular remote access tool (RAT) that has been used by many groups. (Citation: FireEye Poison Ivy) (Citation: Symantec Elderwood Sept 2012) (Citation: Symantec Darkmoon Aug 2005)", "label_id": 926, "label_title": "PoisonIvy", "label_link": "https://attack.mitre.org/software/S0012", "entity_class": "CE", "entity_type": "MALWARE", "document": "lab52_2020-01-09_icefog-apt-group-abusing-recent"}