{"mention": "Proofpoint", "context_left": "Now that they are back, TA542 email campaigns are once again the most prevalent by message volume by a large margin, with only a few other actors coming close.", "context_right": "has blocked hundreds of thousands of messages (sometimes coming close to one million) each day. There is no clear industry targeting among TA542 campaigns.", "_context_left": "", "_context_right": " has blocked hundreds of thousands of messages (sometimes coming close to one million) each day.", "sentence_left": "Now that they are back, TA542 email campaigns are once again the most prevalent by message volume by a large margin, with only a few other actors coming close.", "sentence_right": "There is no clear industry targeting among TA542 campaigns.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Proofpoint", "context_left": "There is no clear industry targeting among TA542 campaigns. While there are some innovations and incremental changes,", "context_right": "researchers have noted surprisingly minimal change in TA542’s tactics or tooling, considering the long break. Many trends [observed previously](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta542-banker-malware-distribution-service) still remain relevant.", "_context_left": "While there are some innovations and incremental changes, ", "_context_right": " researchers have noted surprisingly minimal change in TA542’s tactics or tooling, considering the long break.", "sentence_left": "There is no clear industry targeting among TA542 campaigns.", "sentence_right": "Many trends [observed previously](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta542-banker-malware-distribution-service) still remain relevant.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Germany", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume)", "context_right": ", Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) ", "_context_right": ", Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Austria", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany,", "context_right": ", Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, ", "_context_right": ", Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Austria (, ; ), officially the Republic of Austria (, ), is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of , a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below , and its highest point is . The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene.  Austria played a central role in European History from the late 18th to the early 20th century. It initially emerged as a margraviate around 976 and developed into a duchy and later archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal houses in history. As archduchy, it was a major component and administrative centre of the Holy Roman Empire. Following the Holy Roman Empire's dissolution, Austria founded its own empire in the 19th century, which became a great power and the leading force of the German Confederation. Subsequent to the Austro-Prussian War", "label_id": 3101003, "label_title": "Austria", "label_link": "https://en.wikipedia.org/wiki?curid=26964606", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Switzerland", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria,", "context_right": ", United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, ", "_context_right": ", United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Switzerland, officially the Swiss Confederation, is a sovereign state situated in the confluence of western, central, and southern Europe. It is a federal republic composed of 26 cantons, with federal authorities seated in Bern. Switzerland is a landlocked country bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. It is geographically divided between the Alps, the Swiss Plateau and the Jura, spanning a total area of , and land area of . While the Alps occupy the greater part of the territory, the Swiss population of approximately 8.5 million is concentrated mostly on the plateau, where the largest cities are located, among them the two global cities and economic centres of Zurich and Geneva.  The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. Since the Reformation of the 16th century, Switzerland has maintained a strong policy of armed neutrality; it has not fought an international war since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. Switzerland is the birthplace of the Red Cross, one of the world's oldest and best known humanitarian organisations, and is home to numerous international organisations, including the second largest UN office. It is a founding member of", "label_id": 13217, "label_title": "Switzerland", "label_link": "https://en.wikipedia.org/wiki?curid=26748", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United States", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland,", "context_right": ", United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, ", "_context_right": ", United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United Kingdom", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States,", "context_right": ", and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, ", "_context_right": ", and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country located off the north-western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the United Kingdom that shares a land border with another sovereign state, the Republic of Ireland. Apart from this land border, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the south-west, giving it the 12th-longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. The United Kingdom's were home to an estimated 66.0 million inhabitants in 2017.  The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The current monarch is Queen Elizabeth II, who has reigned since 1952, making her the world's longest-serving current head of state. The United Kingdom's capital and largest city is London, a global city and financial centre with an urban area population of 10.3 million. Other major cities include Birmingham, Manchester, Glasgow, Leeds and Liverpool.  The United Kingdom consists of four constituent countries: England, Scotland, Wales, and Northern Ireland. Their capitals are London, Edinburgh, Cardiff, and Belfast, respectively. Apart from England, the countries have their own devolved governments, each with varying powers, but such power is delegated by the Parliament of the United Kingdom,", "label_id": 15734, "label_title": "United Kingdom", "label_link": "https://en.wikipedia.org/wiki?curid=31717", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Canada", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and", "context_right": ", while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and ", "_context_right": ", while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesia", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as", "context_right": ", the Philippines, Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as ", "_context_right": ", the Philippines, Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Philippines", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the", "context_right": ", Sweden, and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the ", "_context_right": ", Sweden, and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Sweden", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines,", "context_right": ", and India. ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, ", "_context_right": ", and India.", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "India", "context_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files. * Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and", "context_right": ". ![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "_context_left": "* Country targeting: The actor continues to target a core set of countries including (listed by message volume) Germany, Austria, Switzerland, United States, United Kingdom, and Canada, while at the same time experimenting with targeting new geographies such as Indonesia, the Philippines, Sweden, and ", "_context_right": ".", "sentence_left": "* Attachments / URLs: Similar to activity observed before their break, TA542 continues to use Word attachments with macros, PDF attachments, and URLs linking to Word files.", "sentence_right": "![Emotet_1](/sites/default/files/inline-images/Emotet_1.png)", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Proofpoint", "context_left": "**Precursor Campaign** Before diving into the analysis, it’s important to mention that", "context_right": "and other researchers were able to see warnings that Emotet was about to return. Those watching active Emotet infections took notice that new email sending modules were received.", "_context_left": "Before diving into the analysis, it’s important to mention that ", "_context_right": " and other researchers were able to see warnings that Emotet was about to return.", "sentence_left": "**Precursor Campaign**", "sentence_right": "Those watching active Emotet infections took notice that new email sending modules were received.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Proofpoint", "context_left": "It's also possible to watch for unusual (old) Emotet email in inboxes. On July 14, 2020", "context_right": "researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020. These emails came from many sender IPs, as if multiple emotet bots reactivated.", "_context_left": "On July 14, 2020 ", "_context_right": " researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020.", "sentence_left": "It's also possible to watch for unusual (old) Emotet email in inboxes.", "sentence_right": "These emails came from many sender IPs, as if multiple emotet bots reactivated.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Germany", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume):", "context_right": ", Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): ", "_context_right": ", Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Austria", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany,", "context_right": ", Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, ", "_context_right": ", Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "Austria (, ; ), officially the Republic of Austria (, ), is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of , a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below , and its highest point is . The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene.  Austria played a central role in European History from the late 18th to the early 20th century. It initially emerged as a margraviate around 976 and developed into a duchy and later archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal houses in history. As archduchy, it was a major component and administrative centre of the Holy Roman Empire. Following the Holy Roman Empire's dissolution, Austria founded its own empire in the 19th century, which became a great power and the leading force of the German Confederation. Subsequent to the Austro-Prussian War", "label_id": 3101003, "label_title": "Austria", "label_link": "https://en.wikipedia.org/wiki?curid=26964606", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Switzerland", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany, Austria,", "context_right": ", United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, ", "_context_right": ", United States, United Kingdom, Japan, and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "Switzerland, officially the Swiss Confederation, is a sovereign state situated in the confluence of western, central, and southern Europe. It is a federal republic composed of 26 cantons, with federal authorities seated in Bern. Switzerland is a landlocked country bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. It is geographically divided between the Alps, the Swiss Plateau and the Jura, spanning a total area of , and land area of . While the Alps occupy the greater part of the territory, the Swiss population of approximately 8.5 million is concentrated mostly on the plateau, where the largest cities are located, among them the two global cities and economic centres of Zurich and Geneva.  The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. Since the Reformation of the 16th century, Switzerland has maintained a strong policy of armed neutrality; it has not fought an international war since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. Switzerland is the birthplace of the Red Cross, one of the world's oldest and best known humanitarian organisations, and is home to numerous international organisations, including the second largest UN office. It is a founding member of", "label_id": 13217, "label_title": "Switzerland", "label_link": "https://en.wikipedia.org/wiki?curid=26748", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United States", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland,", "context_right": ", United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, ", "_context_right": ", United Kingdom, Japan, and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United Kingdom", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States,", "context_right": ", Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, ", "_context_right": ", Japan, and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country located off the north-western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the United Kingdom that shares a land border with another sovereign state, the Republic of Ireland. Apart from this land border, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the south-west, giving it the 12th-longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. The United Kingdom's were home to an estimated 66.0 million inhabitants in 2017.  The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The current monarch is Queen Elizabeth II, who has reigned since 1952, making her the world's longest-serving current head of state. The United Kingdom's capital and largest city is London, a global city and financial centre with an urban area population of 10.3 million. Other major cities include Birmingham, Manchester, Glasgow, Leeds and Liverpool.  The United Kingdom consists of four constituent countries: England, Scotland, Wales, and Northern Ireland. Their capitals are London, Edinburgh, Cardiff, and Belfast, respectively. Apart from England, the countries have their own devolved governments, each with varying powers, but such power is delegated by the Parliament of the United Kingdom,", "label_id": 15734, "label_title": "United Kingdom", "label_link": "https://en.wikipedia.org/wiki?curid=31717", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japan", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom,", "context_right": ", and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, ", "_context_right": ", and Latin American countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Latin American", "context_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically. The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and", "context_right": "countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "_context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and ", "_context_right": " countries.", "sentence_left": "TA542 continues the trend of consistently targeting certain regions, while also adding new countries periodically.", "sentence_right": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and India.", "label": "Latin America is a group of countries and dependencies in the Western Hemisphere where Romance languages such as Spanish, Portuguese, and French are predominantly spoken; it is broader than the terms Ibero-America or Hispanic America. The term \"Latin America\" was first used in an 1856 conference with the title \"Initiative of the Americas. Idea for a Federal Congress of the Republics\" (Iniciativa de la America. Idea de un Congreso Federal de las Republicas), by the Chilean politician Francisco Bilbao. The term was used also by Napoleon III's French government in the 1860s as \"Amerique latine\" to consider French-speaking territories in the Americas (French Canadians, French Louisiana, French Guiana, Haiti, Guadeloupe, Martinique, Saint Martin, Saint Barthelemy), along with the larger group of countries where Spanish and Portuguese languages prevailed, including the Spanish-speaking portions of the United States (Southwestern United States and Florida) Today, areas of Canada and the United States (with the exception of Puerto Rico) where Spanish, Portuguese and French are predominant are typically not included in definitions of Latin America.  Latin America consists of 13 dependencies and 20 countries which cover an area that stretches from the northern border of Mexico to the southern tip of South America, including the Caribbean. It has an area of approximately 19,197,000 km (7,412,000 sq mi), almost 13% of the Earth's land surface area. As of , its population was estimated at more than floor(/1e6) million and in 2014, Latin America had a combined nominal GDP of US$5,573,397 million and a GDP PPP of 7,531,585 million USD.", "label_id": 9017, "label_title": "Latin America", "label_link": "https://en.wikipedia.org/wiki?curid=18524", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesia", "context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include", "context_right": ", the Philippines, Sweden, and India. Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "_context_left": "Other regions targeted recently but less consistently include ", "_context_right": ", the Philippines, Sweden, and India.", "sentence_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_right": "Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Philippines", "context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the", "context_right": ", Sweden, and India. Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "_context_left": "Other regions targeted recently but less consistently include Indonesia, the ", "_context_right": ", Sweden, and India.", "sentence_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_right": "Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Sweden", "context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines,", "context_right": ", and India. Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "_context_left": "Other regions targeted recently but less consistently include Indonesia, the Philippines, ", "_context_right": ", and India.", "sentence_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_right": "Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "India", "context_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries. Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and", "context_right": ". Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "_context_left": "Other regions targeted recently but less consistently include Indonesia, the Philippines, Sweden, and ", "_context_right": ".", "sentence_left": "The core regions that Emotet still targets include (listed by message volume): Germany, Austria, Switzerland, United States, United Kingdom, Japan, and Latin American countries.", "sentence_right": "Each country is typically targeted with appropriate language in email bodies, subjects, filenames, and branding.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Germany", "context_left": "| **Country** | **Language** | **Note** | |", "context_right": "| German | Consistent targeting | | Austria | German | Consistent targeting |", "_context_left": "| ", "_context_right": " | German | Consistent targeting |", "sentence_left": "| **Country** | **Language** | **Note** |", "sentence_right": "| Austria | German | Consistent targeting |", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "German", "context_left": "| **Country** | **Language** | **Note** | | Germany |", "context_right": "| Consistent targeting | | Austria | German | Consistent targeting |", "_context_left": "| Germany | ", "_context_right": " | Consistent targeting |", "sentence_left": "| **Country** | **Language** | **Note** |", "sentence_right": "| Austria | German | Consistent targeting |", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Austria", "context_left": "| Germany | German | Consistent targeting | |", "context_right": "| German | Consistent targeting | | Switzerland | German | Consistent targeting |", "_context_left": "| ", "_context_right": " | German | Consistent targeting |", "sentence_left": "| Germany | German | Consistent targeting |", "sentence_right": "| Switzerland | German | Consistent targeting |", "label": "Austria (, ; ), officially the Republic of Austria (, ), is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of , a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below , and its highest point is . The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene.  Austria played a central role in European History from the late 18th to the early 20th century. It initially emerged as a margraviate around 976 and developed into a duchy and later archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal houses in history. As archduchy, it was a major component and administrative centre of the Holy Roman Empire. Following the Holy Roman Empire's dissolution, Austria founded its own empire in the 19th century, which became a great power and the leading force of the German Confederation. Subsequent to the Austro-Prussian War", "label_id": 3101003, "label_title": "Austria", "label_link": "https://en.wikipedia.org/wiki?curid=26964606", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "German", "context_left": "| Germany | German | Consistent targeting | | Austria |", "context_right": "| Consistent targeting | | Switzerland | German | Consistent targeting |", "_context_left": "| Austria | ", "_context_right": " | Consistent targeting |", "sentence_left": "| Germany | German | Consistent targeting |", "sentence_right": "| Switzerland | German | Consistent targeting |", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Switzerland", "context_left": "| Austria | German | Consistent targeting | |", "context_right": "| German | Consistent targeting | | United Kingdom | English | Consistent targeting |", "_context_left": "| ", "_context_right": " | German | Consistent targeting |", "sentence_left": "| Austria | German | Consistent targeting |", "sentence_right": "| United Kingdom | English | Consistent targeting |", "label": "Switzerland, officially the Swiss Confederation, is a sovereign state situated in the confluence of western, central, and southern Europe. It is a federal republic composed of 26 cantons, with federal authorities seated in Bern. Switzerland is a landlocked country bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. It is geographically divided between the Alps, the Swiss Plateau and the Jura, spanning a total area of , and land area of . While the Alps occupy the greater part of the territory, the Swiss population of approximately 8.5 million is concentrated mostly on the plateau, where the largest cities are located, among them the two global cities and economic centres of Zurich and Geneva.  The establishment of the Old Swiss Confederacy dates to the late medieval period, resulting from a series of military successes against Austria and Burgundy. Swiss independence from the Holy Roman Empire was formally recognized in the Peace of Westphalia in 1648. Since the Reformation of the 16th century, Switzerland has maintained a strong policy of armed neutrality; it has not fought an international war since 1815 and did not join the United Nations until 2002. Nevertheless, it pursues an active foreign policy and is frequently involved in peace-building processes around the world. Switzerland is the birthplace of the Red Cross, one of the world's oldest and best known humanitarian organisations, and is home to numerous international organisations, including the second largest UN office. It is a founding member of", "label_id": 13217, "label_title": "Switzerland", "label_link": "https://en.wikipedia.org/wiki?curid=26748", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "German", "context_left": "| Austria | German | Consistent targeting | | Switzerland |", "context_right": "| Consistent targeting | | United Kingdom | English | Consistent targeting |", "_context_left": "| Switzerland | ", "_context_right": " | Consistent targeting |", "sentence_left": "| Austria | German | Consistent targeting |", "sentence_right": "| United Kingdom | English | Consistent targeting |", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United Kingdom", "context_left": "| Switzerland | German | Consistent targeting | |", "context_right": "| English | Consistent targeting | | United States | English | Consistent targeting |", "_context_left": "| ", "_context_right": " | English | Consistent targeting |", "sentence_left": "| Switzerland | German | Consistent targeting |", "sentence_right": "| United States | English | Consistent targeting |", "label": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country located off the north-western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the United Kingdom that shares a land border with another sovereign state, the Republic of Ireland. Apart from this land border, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the south-west, giving it the 12th-longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. The United Kingdom's were home to an estimated 66.0 million inhabitants in 2017.  The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The current monarch is Queen Elizabeth II, who has reigned since 1952, making her the world's longest-serving current head of state. The United Kingdom's capital and largest city is London, a global city and financial centre with an urban area population of 10.3 million. Other major cities include Birmingham, Manchester, Glasgow, Leeds and Liverpool.  The United Kingdom consists of four constituent countries: England, Scotland, Wales, and Northern Ireland. Their capitals are London, Edinburgh, Cardiff, and Belfast, respectively. Apart from England, the countries have their own devolved governments, each with varying powers, but such power is delegated by the Parliament of the United Kingdom,", "label_id": 15734, "label_title": "United Kingdom", "label_link": "https://en.wikipedia.org/wiki?curid=31717", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United States", "context_left": "| United Kingdom | English | Consistent targeting | |", "context_right": "| English | Consistent targeting | | Canada | English, French | Consistent targeting |", "_context_left": "| ", "_context_right": " | English | Consistent targeting |", "sentence_left": "| United Kingdom | English | Consistent targeting |", "sentence_right": "| Canada | English, French | Consistent targeting |", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Canada", "context_left": "| United States | English | Consistent targeting | |", "context_right": "| English, French | Consistent targeting | | United Arab Emirates | English | Consistent targeting |", "_context_left": "| ", "_context_right": " | English, French | Consistent targeting |", "sentence_left": "| United States | English | Consistent targeting |", "sentence_right": "| United Arab Emirates | English | Consistent targeting |", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "French", "context_left": "| United States | English | Consistent targeting | | Canada | English,", "context_right": "| Consistent targeting | | United Arab Emirates | English | Consistent targeting |", "_context_left": "| Canada | English, ", "_context_right": " | Consistent targeting |", "sentence_left": "| United States | English | Consistent targeting |", "sentence_right": "| United Arab Emirates | English | Consistent targeting |", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "United Arab Emirates", "context_left": "| Canada | English, French | Consistent targeting | |", "context_right": "| English | Consistent targeting | | Japan | Japanese | Consistent targeting |", "_context_left": "| ", "_context_right": " | English | Consistent targeting |", "sentence_left": "| Canada | English, French | Consistent targeting |", "sentence_right": "| Japan | Japanese | Consistent targeting |", "label": "The United Arab Emirates (UAE; ') literally \"'State' of the United Arab Emirates\", sometimes simply called the Emirates ( '), is a country in Western Asia at the southeast end of the Arabian Peninsula on the Persian Gulf, bordering Oman to the east and Saudi Arabia to the south and west, as well as sharing maritime borders with Qatar to the west and Iran to the north. The sovereign constitutional monarchy is a federation of seven emirates consisting of Abu Dhabi (which serves as the capital), Ajman, Dubai, Fujairah, Ras Al Khaimah, Sharjah and Umm Al Quwain. Their boundaries are complex, with numerous enclaves within the various emirates. Each emirate is governed by a ruler; together, they jointly form the Federal Supreme Council. One of the rulers serves as the President of the United Arab Emirates. In 2013, the UAE's population was 9.2 million, of which 1.4 million are Emirati citizens and 7.8 million are expatriates.  Human occupation of the present UAE has been traced back to the emergence of anatomically modern humans from Africa some 125,000 BCE through finds at the Faya-1 site in Mleiha, Sharjah. Burial sites dating back to the Neolithic Age and the Bronze Age include the oldest known such inland site at Jebel Buhais. Known as Magan to the Sumerians, the area was home to a prosperous Bronze Age trading culture during the Umm Al Nar period, which traded between the Indus Valley, Bahrain and Mesopotamia as well as Iran, Bactria and the Levant. The ensuing Wadi Suq period", "label_id": 34300, "label_title": "United Arab Emirates", "label_link": "https://en.wikipedia.org/wiki?curid=69328", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japan", "context_left": "| United Arab Emirates | English | Consistent targeting | |", "context_right": "| Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "_context_left": "| ", "_context_right": " | Japanese | Consistent targeting |", "sentence_left": "| United Arab Emirates | English | Consistent targeting |", "sentence_right": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japanese", "context_left": "| United Arab Emirates | English | Consistent targeting | | Japan |", "context_right": "| Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "_context_left": "| Japan | ", "_context_right": " | Consistent targeting |", "sentence_left": "| United Arab Emirates | English | Consistent targeting |", "sentence_right": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Latin America", "context_left": "| Japan | Japanese | Consistent targeting | |", "context_right": "| Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| ", "_context_right": " | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Latin America is a group of countries and dependencies in the Western Hemisphere where Romance languages such as Spanish, Portuguese, and French are predominantly spoken; it is broader than the terms Ibero-America or Hispanic America. The term \"Latin America\" was first used in an 1856 conference with the title \"Initiative of the Americas. Idea for a Federal Congress of the Republics\" (Iniciativa de la America. Idea de un Congreso Federal de las Republicas), by the Chilean politician Francisco Bilbao. The term was used also by Napoleon III's French government in the 1860s as \"Amerique latine\" to consider French-speaking territories in the Americas (French Canadians, French Louisiana, French Guiana, Haiti, Guadeloupe, Martinique, Saint Martin, Saint Barthelemy), along with the larger group of countries where Spanish and Portuguese languages prevailed, including the Spanish-speaking portions of the United States (Southwestern United States and Florida) Today, areas of Canada and the United States (with the exception of Puerto Rico) where Spanish, Portuguese and French are predominant are typically not included in definitions of Latin America.  Latin America consists of 13 dependencies and 20 countries which cover an area that stretches from the northern border of Mexico to the southern tip of South America, including the Caribbean. It has an area of approximately 19,197,000 km (7,412,000 sq mi), almost 13% of the Earth's land surface area. As of , its population was estimated at more than floor(/1e6) million and in 2014, Latin America had a combined nominal GDP of US$5,573,397 million and a GDP PPP of 7,531,585 million USD.", "label_id": 9017, "label_title": "Latin America", "label_link": "https://en.wikipedia.org/wiki?curid=18524", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spanish", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America |", "context_right": "and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | ", "_context_right": " and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Portuguese", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and", "context_right": "| Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and ", "_context_right": " | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Portugal (), officially the Portuguese Republic ( ), is a country located mostly on the Iberian Peninsula in southwestern Europe. It is the westernmost sovereign state of mainland Europe, being bordered to the west and south by the Atlantic Ocean and to the north and east by Spain. Its territory also includes the Atlantic archipelagos of the Azores and Madeira, both autonomous regions with their own regional governments.  Portugal is the oldest nation state on the Iberian Peninsula and one of the oldest in Europe, its territory having been continuously settled, invaded and fought over since prehistoric times. The pre-Celtic people, Celts, Carthaginians and Romans were followed by the invasions of the Visigoths and Suebi Germanic peoples. Portugal as a country was established during the Christian \"Reconquista\" against the Moors who had invaded the Iberian Peninsula in 711 AD. Founded in 868, the County of Portugal gained prominence after the Battle of Sao Mamede in 1128. The Kingdom of Portugal was later proclaimed following the Battle of Ourique in 1139, and independence from Leon was recognised by the Treaty of Zamora in 1143.  In the 15th and 16th centuries, Portugal established the first global empire, becoming one of the world's major economic, political and military powers. During this period, today referred to as the Age of Discovery, Portuguese explorers pioneered maritime exploration, notably under royal patronage of Prince Henry the Navigator and King John II, with such notable voyages as Bartolomeu Dias' sailing beyond the Cape of Good Hope (1488), Vasco da Gama's", "label_id": 11270, "label_title": "Portugal", "label_link": "https://en.wikipedia.org/wiki?curid=23033", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Brazil", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as", "context_right": ", Chile, Mexico, Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as ", "_context_right": ", Chile, Mexico, Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Brazil (; ), officially the Federative Republic of Brazil (, ), is the largest country in both South America and Latin America. At 8.5 million square kilometers (3.2 million square miles) and with over 208 million people, Brazil is the world's fifth-largest country by area and the fifth most populous. Its capital is Brasilia, and its most populated city is Sao Paulo. The federation is composed of the union of the 26 states, the Federal District, and the 5,570 municipalities. It is the largest country to have Portuguese as an official language and the only one in the Americas; it is also one of the most multicultural and ethnically diverse nations, due to over a century of mass immigration from around the world.  Bounded by the Atlantic Ocean on the east, Brazil has a coastline of . It borders all other South American countries except Ecuador and Chile and covers 47.3% of the continent's land area. Its Amazon River basin includes a vast tropical forest, home to diverse wildlife, a variety of ecological systems, and extensive natural resources spanning numerous protected habitats. This unique environmental heritage makes Brazil one of 17 megadiverse countries, and is the subject of significant global interest and debate regarding deforestation and environmental protection.  Brazil was inhabited by numerous tribal nations prior to the landing in 1500 of explorer Pedro Alvares Cabral, who claimed the area for the Portuguese Empire. Brazil remained a Portuguese colony until 1808, when the capital of the empire was transferred from Lisbon to Rio de Janeiro.", "label_id": 1439, "label_title": "Brazil", "label_link": "https://en.wikipedia.org/wiki?curid=3383", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Chile", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil,", "context_right": ", Mexico, Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, ", "_context_right": ", Mexico, Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Mexico", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile,", "context_right": ", Colombia, Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, ", "_context_right": ", Colombia, Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Mexico ( ; ), officially the United Mexican States ( ), is a country in the southern portion of North America. It is bordered to the north by the United States; to the south and west by the Pacific Ocean; to the southeast by Guatemala, Belize, and the Caribbean Sea; and to the east by the Gulf of Mexico. Covering almost , the nation is the fourth largest country in the Americas by total area and the 13th largest independent state in the world. With an estimated population of over 129 million people, Mexico is the tenth most populous country and the most populous Spanish-speaking country in the world, while being the second most populous nation in Latin America after Brazil. Mexico is a federation comprising 31 states plus Mexico City (CDMX), which is the capital city and its most populous city. Other metropolises in the country include Guadalajara, Monterrey, Puebla, Toluca, Tijuana, and Leon. Pre-Columbian Mexico dates to about 8000 BC and is identified as one of six cradles of civilization and was home to many advanced Mesoamerican civilizations such as the Olmec, Toltec, Teotihuacan, Zapotec, Maya, and Aztec before first contact with Europeans. In 1521, the Spanish Empire conquered and colonized the territory from its politically powerful base in Mexico-Tenochtitlan (part of Mexico City), which was administered as the viceroyalty of New Spain. The Roman Catholic Church played a powerful role in governing the country as millions were converted to the faith, although King Charles III expelled the Jesuits in the 1770s. The", "label_id": 861669, "label_title": "Mexico", "label_link": "https://en.wikipedia.org/wiki?curid=3966054", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Colombia", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico,", "context_right": ", Ecuador | | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, ", "_context_right": ", Ecuador |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Colombia ( , ; ), officially the Republic of Colombia (), is a sovereign state largely situated in the northwest of South America, with land, and territories in North America. Colombia shares a border to the west with Panama, to the east with Brazil and Venezuela, and to the south with Ecuador and Peru. It shares its maritime limits with Costa Rica, Nicaragua, Honduras, Jamaica, Haiti, and the Dominican Republic. Colombia is a unitary, constitutional republic comprising thirty-two departments, with the capital in Bogota.  Colombia has been inhabited by various American Indian peoples since at least 12,000 BCE, including the Muisca, Quimbaya, and the Tairona, along with the Inca Empire that expanded to the southwest of the country. Spaniards arrived in 1499 and by the mid-16th century annexed part of the region, establishing the New Kingdom of Granada, with Santafe de Bogota as its capital. Independence from Spain was achieved in 1819, but by 1830 the Gran Colombia Federation was dissolved, with what is now Colombia and Panama emerging as the Republic of New Granada. The new nation experimented with federalism as the Granadine Confederation (1858), and then the United States of Colombia (1863), before the Republic of Colombia was finally declared in 1886. Panama seceded in 1903, leading to Colombia's present borders. Beginning in the 1960s, the country suffered from an asymmetric low-intensity armed conflict and political violence, both of which escalated in the 1990s. Since 2005, there has been significant improvement in security, stability, and rule of law.  Colombia is the", "label_id": 2308, "label_title": "Colombia", "label_link": "https://en.wikipedia.org/wiki?curid=5222", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Ecuador", "context_left": "| Japan | Japanese | Consistent targeting | | Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia,", "context_right": "| | India | Hindi | Occasional |", "_context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, ", "_context_right": " |", "sentence_left": "| Japan | Japanese | Consistent targeting |", "sentence_right": "| India | Hindi | Occasional |", "label": "Ecuador ( ; ; ; Shuar: \"Ecuador\" or \"Ekuatur\"), officially the Republic of Ecuador (, which literally translates as \"Republic of the Equator\"; ; Shuar: \"Ekuatur Nunka\"), is a country in northwestern South America, bordered by Colombia on the north, Peru on the east and south, and the Pacific Ocean on the west. Ecuador also includes the Galapagos Islands in the Pacific, about west of the mainland. The capital city is Quito, which is also the largest city.  What is now Ecuador was home to a variety of Amerindian groups that were gradually incorporated into the Inca Empire during the 15th century. The territory was colonized by Spain during the 16th century, achieving independence in 1820 as part of Gran Colombia, from which it emerged as its own sovereign state in 1830. The legacy of both empires is reflected in Ecuador's ethnically diverse population, with most of its /1e6 round 1 million people being mestizos, followed by large minorities of European, Amerindian, and African descendants. Spanish is the official language and is spoken by a majority of the population, though 13 Amerindian languages are also recognized, including Quichua and Shuar.  The sovereign state of Ecuador is a middle-income representative democratic republic with a developing economy that is highly dependent on commodities, namely petroleum and agricultural products. It is governed as a democratic presidential republic. One of 18 megadiverse countries in the world, Ecuador hosts many endemic plants and animals, such as those of the Galapagos Islands. In recognition of its unique ecological heritage,", "label_id": 4331, "label_title": "Ecuador", "label_link": "https://en.wikipedia.org/wiki?curid=9334", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "India", "context_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador | |", "context_right": "| Hindi | Occasional | | Indonesia | Indonesian | Occasional |", "_context_left": "| ", "_context_right": " | Hindi | Occasional |", "sentence_left": "| Latin America | Spanish and Portuguese | Consistent targeting of countries such as Brazil, Chile, Mexico, Colombia, Ecuador |", "sentence_right": "| Indonesia | Indonesian | Occasional |", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesia", "context_left": "| India | Hindi | Occasional | |", "context_right": "| Indonesian | Occasional | | Philippines | Filipino | Occasional |", "_context_left": "| ", "_context_right": " | Indonesian | Occasional |", "sentence_left": "| India | Hindi | Occasional |", "sentence_right": "| Philippines | Filipino | Occasional |", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesian", "context_left": "| India | Hindi | Occasional | | Indonesia |", "context_right": "| Occasional | | Philippines | Filipino | Occasional |", "_context_left": "| Indonesia | ", "_context_right": " | Occasional |", "sentence_left": "| India | Hindi | Occasional |", "sentence_right": "| Philippines | Filipino | Occasional |", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Philippines", "context_left": "| Indonesia | Indonesian | Occasional | |", "context_right": "| Filipino | Occasional | | Sweden | Swedish | Occasional |", "_context_left": "| ", "_context_right": " | Filipino | Occasional |", "sentence_left": "| Indonesia | Indonesian | Occasional |", "sentence_right": "| Sweden | Swedish | Occasional |", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Filipino", "context_left": "| Indonesia | Indonesian | Occasional | | Philippines |", "context_right": "| Occasional | | Sweden | Swedish | Occasional |", "_context_left": "| Philippines | ", "_context_right": " | Occasional |", "sentence_left": "| Indonesia | Indonesian | Occasional |", "sentence_right": "| Sweden | Swedish | Occasional |", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Sweden", "context_left": "| Philippines | Filipino | Occasional | |", "context_right": "| Swedish | Occasional | | Italy | Italian | Occasional |", "_context_left": "| ", "_context_right": " | Swedish | Occasional |", "sentence_left": "| Philippines | Filipino | Occasional |", "sentence_right": "| Italy | Italian | Occasional |", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Swedish", "context_left": "| Philippines | Filipino | Occasional | | Sweden |", "context_right": "| Occasional | | Italy | Italian | Occasional |", "_context_left": "| Sweden | ", "_context_right": " | Occasional |", "sentence_left": "| Philippines | Filipino | Occasional |", "sentence_right": "| Italy | Italian | Occasional |", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Italy", "context_left": "| Sweden | Swedish | Occasional | |", "context_right": "| Italian | Occasional | | Spain | Spanish | Occasional |", "_context_left": "| ", "_context_right": " | Italian | Occasional |", "sentence_left": "| Sweden | Swedish | Occasional |", "sentence_right": "| Spain | Spanish | Occasional |", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Italian", "context_left": "| Sweden | Swedish | Occasional | | Italy |", "context_right": "| Occasional | | Spain | Spanish | Occasional |", "_context_left": "| Italy | ", "_context_right": " | Occasional |", "sentence_left": "| Sweden | Swedish | Occasional |", "sentence_right": "| Spain | Spanish | Occasional |", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spain", "context_left": "| Italy | Italian | Occasional | |", "context_right": "| Spanish | Occasional | | Norway | Norwegian | Occasional |", "_context_left": "| ", "_context_right": " | Spanish | Occasional |", "sentence_left": "| Italy | Italian | Occasional |", "sentence_right": "| Norway | Norwegian | Occasional |", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spanish", "context_left": "| Italy | Italian | Occasional | | Spain |", "context_right": "| Occasional | | Norway | Norwegian | Occasional |", "_context_left": "| Spain | ", "_context_right": " | Occasional |", "sentence_left": "| Italy | Italian | Occasional |", "sentence_right": "| Norway | Norwegian | Occasional |", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Norway", "context_left": "| Spain | Spanish | Occasional | |", "context_right": "| Norwegian | Occasional | | Netherlands | Dutch | Occasional |", "_context_left": "| ", "_context_right": " | Norwegian | Occasional |", "sentence_left": "| Spain | Spanish | Occasional |", "sentence_right": "| Netherlands | Dutch | Occasional |", "label": "Norway (Norwegian: (Bokmal) or (Nynorsk); ; ; ), officially the Kingdom of Norway, is a Nordic country in Northern Europe whose territory comprises the western and northernmost portion of the Scandinavian Peninsula; the remote island of Jan Mayen and the archipelago of Svalbard are also part of the Kingdom of Norway. The Antarctic Peter I Island and the sub-Antarctic Bouvet Island are dependent territories and thus not considered part of the kingdom. Norway also lays claim to a section of Antarctica known as Queen Maud Land.  Norway has a total area of and a population of 5,312,300 (as of August 2018). The country shares a long eastern border with Sweden (1,619 km or 1,006 mi long). Norway is bordered by Finland and Russia to the north-east, and the Skagerrak strait to the south, with Denmark on the other side. Norway has an extensive coastline, facing the North Atlantic Ocean and the Barents Sea. The maritime influence also dominates Norway's climate with mild lowland temperatures on the sea coasts, whereas the interior, while colder, also is a lot milder than areas elsewhere in the world on such northerly latitudes. Even during polar night in the north, temperatures above freezing are commonplace on the coastline. The maritime influence brings high rainfall and snowfall to some areas of the country.  Harald V of the House of Glucksburg is the current King of Norway. Erna Solberg has been prime minister since 2013 when she replaced Jens Stoltenberg. A unitary sovereign state with a constitutional monarchy, Norway divides state", "label_id": 10394, "label_title": "Norway", "label_link": "https://en.wikipedia.org/wiki?curid=21241", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Norwegian", "context_left": "| Spain | Spanish | Occasional | | Norway |", "context_right": "| Occasional | | Netherlands | Dutch | Occasional |", "_context_left": "| Norway | ", "_context_right": " | Occasional |", "sentence_left": "| Spain | Spanish | Occasional |", "sentence_right": "| Netherlands | Dutch | Occasional |", "label": "Norway (Norwegian: (Bokmal) or (Nynorsk); ; ; ), officially the Kingdom of Norway, is a Nordic country in Northern Europe whose territory comprises the western and northernmost portion of the Scandinavian Peninsula; the remote island of Jan Mayen and the archipelago of Svalbard are also part of the Kingdom of Norway. The Antarctic Peter I Island and the sub-Antarctic Bouvet Island are dependent territories and thus not considered part of the kingdom. Norway also lays claim to a section of Antarctica known as Queen Maud Land.  Norway has a total area of and a population of 5,312,300 (as of August 2018). The country shares a long eastern border with Sweden (1,619 km or 1,006 mi long). Norway is bordered by Finland and Russia to the north-east, and the Skagerrak strait to the south, with Denmark on the other side. Norway has an extensive coastline, facing the North Atlantic Ocean and the Barents Sea. The maritime influence also dominates Norway's climate with mild lowland temperatures on the sea coasts, whereas the interior, while colder, also is a lot milder than areas elsewhere in the world on such northerly latitudes. Even during polar night in the north, temperatures above freezing are commonplace on the coastline. The maritime influence brings high rainfall and snowfall to some areas of the country.  Harald V of the House of Glucksburg is the current King of Norway. Erna Solberg has been prime minister since 2013 when she replaced Jens Stoltenberg. A unitary sovereign state with a constitutional monarchy, Norway divides state", "label_id": 10394, "label_title": "Norway", "label_link": "https://en.wikipedia.org/wiki?curid=21241", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Netherlands", "context_left": "| Norway | Norwegian | Occasional | |", "context_right": "| Dutch | Occasional | | Vietnam | Vietnamese | Occasional |", "_context_left": "| ", "_context_right": " | Dutch | Occasional |", "sentence_left": "| Norway | Norwegian | Occasional |", "sentence_right": "| Vietnam | Vietnamese | Occasional |", "label": "The Netherlands (, ) is a country located mainly in Northwestern Europe. The European portion of the Netherlands consists of twelve provinces that border Germany to the east, Belgium to the south, and the North Sea to the northwest, with maritime borders in the North Sea with Belgium, Germany and the United Kingdom. Together with three island territories in the Caribbean Sea—Bonaire, Sint Eustatius and Saba—it forms a constituent country of the Kingdom of the Netherlands. The official language is Dutch, but a secondary official language in the province of Friesland is West Frisian.  The six largest cities in the Netherlands are Amsterdam, Rotterdam, The Hague, Utrecht, Eindhoven and Tilburg. Amsterdam is the country's capital, while The Hague holds the seat of the States General, Cabinet and Supreme Court. The Port of Rotterdam is the largest port in Europe, and the largest in any country outside Asia. The country is a founding member of the EU, Eurozone, G10, NATO, OECD and WTO, as well as a part of the Schengen Area and the trilateral Benelux Union. It hosts several intergovernmental organisations and international courts, many of which are centered in The Hague, which is consequently dubbed 'the world's legal capital'.  \"Netherlands\" literally means 'lower countries' in reference to its low elevation and flat topography, with only about 50% of its land exceeding above sea level, and nearly 17% falling below sea level. Most of the areas below sea level, known as \"polders\", are the result of land reclamation that began in the 16th", "label_id": 10347, "label_title": "Netherlands", "label_link": "https://en.wikipedia.org/wiki?curid=21148", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Dutch", "context_left": "| Norway | Norwegian | Occasional | | Netherlands |", "context_right": "| Occasional | | Vietnam | Vietnamese | Occasional |", "_context_left": "| Netherlands | ", "_context_right": " | Occasional |", "sentence_left": "| Norway | Norwegian | Occasional |", "sentence_right": "| Vietnam | Vietnamese | Occasional |", "label": "Dutch people (Dutch: ) or the Dutch are a Germanic ethnic group native to the Netherlands. They share a common culture and speak the Dutch language. Dutch people and their descendants are found in migrant communities worldwide, notably in Aruba, Suriname, Guyana, Curacao, Argentina, Brazil, Canada, Australia, South Africa, New Zealand, and the United States. The Low Countries were situated around the border of France and the Holy Roman Empire, forming a part of their respective peripheries, and the various territories of which they consisted had become virtually autonomous by the 13th century. Under the Habsburgs, the Netherlands were organised into a single administrative unit, and in the 16th and 17th centuries the Northern Netherlands gained independence from Spain as the Dutch Republic. The high degree of urbanization characteristic of Dutch society was attained at a relatively early date. During the Republic the first series of large-scale Dutch migrations outside of Europe took place.  The Dutch have left behind a substantial legacy despite the limited size of their country. The Dutch people are generally seen as the pioneers of capitalism, and their emphasis on a modern economy, secularism, and a free market ultimately had a huge influence on the great powers of the West, especially the British Empire, its Thirteen Colonies, and ultimately the United States.  The traditional arts and culture of the Dutch encompasses various forms of traditional music, dances, architectural styles and clothing, some of which are globally recognizable. Internationally, Dutch painters such as Rembrandt, Vermeer and Van Gogh are held", "label_id": 468192, "label_title": "Dutch people", "label_link": "https://en.wikipedia.org/wiki?curid=1656551", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Vietnam", "context_left": "| Netherlands | Dutch | Occasional | |", "context_right": "| Vietnamese | Occasional | *Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "_context_left": "| ", "_context_right": " | Vietnamese | Occasional |", "sentence_left": "| Netherlands | Dutch | Occasional |", "sentence_right": "*Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "label": "Vietnam ( ), officially the Socialist Republic of Vietnam (), is the easternmost country on the Indochina Peninsula. With an estimated /1e6 round 1 million inhabitants , it is the 15th most populous country in the world. Vietnam shares its land borders with China to the north, and Laos and Cambodia to the west. It shares its maritime borders with Thailand through the Gulf of Thailand, and the Philippines, Indonesia and Malaysia through the South China Sea. Its capital city is Hanoi, while its most populous city is Ho Chi Minh City.  Archaeological excavations indicate that Vietnam was inhabited as early as the Paleolithic age. Ancient Vietnamese nation was annexed by China in the 2nd century BC, which subsequently made Vietnam a division of China for over a millennium. The first independent monarchy emerged in the 10th century AD, paving the way for successive imperial dynasties as the nation expanded geographically southward until the Indochina Peninsula was colonised by the French in the mid-19th century. Modern Vietnam's age was marked upon the declaration of independence from France in 1945. Following Vietnamese victory against the French in the First Indochina War, which ended in 1954, the nation was divided into two rival states: communist North and anti-communist South. Conflicts intensified in the Vietnam War, which saw extensive US intervention in support of South Vietnam and ended with North Vietnamese victory in 1975.  After North and South Vietnam were reunified under a unitary socialist government in 1976, the country became economically and politically isolated until", "label_id": 107947, "label_title": "Vietnam", "label_link": "https://en.wikipedia.org/wiki?curid=202354", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Vietnamese", "context_left": "| Netherlands | Dutch | Occasional | | Vietnam |", "context_right": "| Occasional | *Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "_context_left": "| Vietnam | ", "_context_right": " | Occasional |", "sentence_left": "| Netherlands | Dutch | Occasional |", "sentence_right": "*Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "label": "Vietnam ( ), officially the Socialist Republic of Vietnam (), is the easternmost country on the Indochina Peninsula. With an estimated /1e6 round 1 million inhabitants , it is the 15th most populous country in the world. Vietnam shares its land borders with China to the north, and Laos and Cambodia to the west. It shares its maritime borders with Thailand through the Gulf of Thailand, and the Philippines, Indonesia and Malaysia through the South China Sea. Its capital city is Hanoi, while its most populous city is Ho Chi Minh City.  Archaeological excavations indicate that Vietnam was inhabited as early as the Paleolithic age. Ancient Vietnamese nation was annexed by China in the 2nd century BC, which subsequently made Vietnam a division of China for over a millennium. The first independent monarchy emerged in the 10th century AD, paving the way for successive imperial dynasties as the nation expanded geographically southward until the Indochina Peninsula was colonised by the French in the mid-19th century. Modern Vietnam's age was marked upon the declaration of independence from France in 1945. Following Vietnamese victory against the French in the First Indochina War, which ended in 1954, the nation was divided into two rival states: communist North and anti-communist South. Conflicts intensified in the Vietnam War, which saw extensive US intervention in support of South Vietnam and ended with North Vietnamese victory in 1975.  After North and South Vietnam were reunified under a unitary socialist government in 1976, the country became economically and politically isolated until", "label_id": 107947, "label_title": "Vietnam", "label_link": "https://en.wikipedia.org/wiki?curid=202354", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spanish", "context_left": "There are also placeholders in the email body such as those shown below. A", "context_right": "language email screenshot in Figure 3 illustrates this. * {FROM.NAME}", "_context_left": "A ", "_context_right": " language email screenshot in Figure 3 illustrates this.", "sentence_left": "There are also placeholders in the email body such as those shown below.", "sentence_right": "* {FROM.NAME}", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesian", "context_left": "The figure below shows the following emails: *", "context_right": "language email targeting Indonesia. The subject “faktur dari” translates to “invoice from”.", "_context_left": "* ", "_context_right": " language email targeting Indonesia.", "sentence_left": "The figure below shows the following emails:", "sentence_right": "The subject “faktur dari” translates to “invoice from”.", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesia", "context_left": "The figure below shows the following emails: * Indonesian language email targeting", "context_right": ". The subject “faktur dari” translates to “invoice from”.", "_context_left": "* Indonesian language email targeting ", "_context_right": ".", "sentence_left": "The figure below shows the following emails:", "sentence_right": "The subject “faktur dari” translates to “invoice from”.", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "India", "context_left": "(top left) * Hindi language email targeting", "context_right": "and utilizing thread hijacking. The “कृपया संलग्न फॉर्म देखें।” text in the body of the email translates to “Please see the attached form.", "_context_left": "* Hindi language email targeting ", "_context_right": " and utilizing thread hijacking.", "sentence_left": "(top left)", "sentence_right": "The “कृपया संलग्न फॉर्म देखें।” text in the body of the email translates to “Please see the attached form.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Philippines", "context_left": "(top right) * Filipino language email targeting", "context_right": ". The attachment name “impormasyon ng contact.doc” translates to “contact information.doc”.", "_context_left": "* Filipino language email targeting ", "_context_right": ".", "sentence_left": "(top right)", "sentence_right": "The attachment name “impormasyon ng contact.doc” translates to “contact information.doc”.", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Swedish", "context_left": "Note that this email contains both a Word attachment and a URL linking to a malicious Word file (bottom right) *", "context_right": "language email targeting Sweden. The subject “Dagordning för det kommande mötet på fredagen” translates to “Agenda for the upcoming meeting on Friday” (bottom left)", "_context_left": "* ", "_context_right": " language email targeting Sweden.", "sentence_left": "Note that this email contains both a Word attachment and a URL linking to a malicious Word file (bottom right)", "sentence_right": "The subject “Dagordning för det kommande mötet på fredagen” translates to “Agenda for the upcoming meeting on Friday” (bottom left)", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Sweden", "context_left": "Note that this email contains both a Word attachment and a URL linking to a malicious Word file (bottom right) * Swedish language email targeting", "context_right": ". The subject “Dagordning för det kommande mötet på fredagen” translates to “Agenda for the upcoming meeting on Friday” (bottom left)", "_context_left": "* Swedish language email targeting ", "_context_right": ".", "sentence_left": "Note that this email contains both a Word attachment and a URL linking to a malicious Word file (bottom right)", "sentence_right": "The subject “Dagordning för det kommande mötet på fredagen” translates to “Agenda for the upcoming meeting on Friday” (bottom left)", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Indonesian", "context_left": "![emotet_2](/sites/default/files/inline-images/Emotet_2.png) *Figure 2: Clockwise, starting from top left corner,", "context_right": ", Hindi, Filipino, Swedish language emails.* The figure below shows the following emails:", "_context_left": "*Figure 2: Clockwise, starting from top left corner, ", "_context_right": ", Hindi, Filipino, Swedish language emails.*", "sentence_left": "![emotet_2](/sites/default/files/inline-images/Emotet_2.png)", "sentence_right": "The figure below shows the following emails:", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Swedish", "context_left": "![emotet_2](/sites/default/files/inline-images/Emotet_2.png) *Figure 2: Clockwise, starting from top left corner, Indonesian, Hindi, Filipino,", "context_right": "language emails.* The figure below shows the following emails:", "_context_left": "*Figure 2: Clockwise, starting from top left corner, Indonesian, Hindi, Filipino, ", "_context_right": " language emails.*", "sentence_left": "![emotet_2](/sites/default/files/inline-images/Emotet_2.png)", "sentence_right": "The figure below shows the following emails:", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "German", "context_left": "The figure below shows the following emails: *", "context_right": "language email targeting Germany.(top left) * Spanish language email targeting Spain.", "_context_left": "* ", "_context_right": " language email targeting Germany.(top left)", "sentence_left": "The figure below shows the following emails:", "sentence_right": "* Spanish language email targeting Spain.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Germany", "context_left": "The figure below shows the following emails: * German language email targeting", "context_right": ".(top left) * Spanish language email targeting Spain.", "_context_left": "* German language email targeting ", "_context_right": ".(top left)", "sentence_left": "The figure below shows the following emails:", "sentence_right": "* Spanish language email targeting Spain.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spanish", "context_left": "* German language email targeting Germany.(top left) *", "context_right": "language email targeting Spain. Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "_context_left": "* ", "_context_right": " language email targeting Spain.", "sentence_left": "* German language email targeting Germany.(top left)", "sentence_right": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spain", "context_left": "* German language email targeting Germany.(top left) * Spanish language email targeting", "context_right": ". Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "_context_left": "* Spanish language email targeting ", "_context_right": ".", "sentence_left": "* German language email targeting Germany.(top left)", "sentence_right": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Italian", "context_left": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right) *", "context_right": "language email targeting Italy.(bottom right) * French language email targeting Canada.(bottom left)", "_context_left": "* ", "_context_right": " language email targeting Italy.(bottom right)", "sentence_left": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "sentence_right": "* French language email targeting Canada.(bottom left)", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Italy", "context_left": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right) * Italian language email targeting", "context_right": ".(bottom right) * French language email targeting Canada.(bottom left)", "_context_left": "* Italian language email targeting ", "_context_right": ".(bottom right)", "sentence_left": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "sentence_right": "* French language email targeting Canada.(bottom left)", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "French", "context_left": "* Italian language email targeting Italy.(bottom right) *", "context_right": "language email targeting Canada.(bottom left) ![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "_context_left": "* ", "_context_right": " language email targeting Canada.(bottom left)", "sentence_left": "* Italian language email targeting Italy.(bottom right)", "sentence_right": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Canada", "context_left": "* Italian language email targeting Italy.(bottom right) * French language email targeting", "context_right": ".(bottom left) ![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "_context_left": "* French language email targeting ", "_context_right": ".(bottom left)", "sentence_left": "* Italian language email targeting Italy.(bottom right)", "sentence_right": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "German", "context_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png) *Figure 3: Clockwise, starting from top left corner,", "context_right": ", Spanish, Italian, French language emails.* The figure below shows the following emails:", "_context_left": "*Figure 3: Clockwise, starting from top left corner, ", "_context_right": ", Spanish, Italian, French language emails.*", "sentence_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "sentence_right": "The figure below shows the following emails:", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Spanish", "context_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png) *Figure 3: Clockwise, starting from top left corner, German,", "context_right": ", Italian, French language emails.* The figure below shows the following emails:", "_context_left": "*Figure 3: Clockwise, starting from top left corner, German, ", "_context_right": ", Italian, French language emails.*", "sentence_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "sentence_right": "The figure below shows the following emails:", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Italian", "context_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png) *Figure 3: Clockwise, starting from top left corner, German, Spanish,", "context_right": ", French language emails.* The figure below shows the following emails:", "_context_left": "*Figure 3: Clockwise, starting from top left corner, German, Spanish, ", "_context_right": ", French language emails.*", "sentence_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "sentence_right": "The figure below shows the following emails:", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "French", "context_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png) *Figure 3: Clockwise, starting from top left corner, German, Spanish, Italian,", "context_right": "language emails.* The figure below shows the following emails:", "_context_left": "*Figure 3: Clockwise, starting from top left corner, German, Spanish, Italian, ", "_context_right": " language emails.*", "sentence_left": "![Emotet_3](/sites/default/files/inline-images/Emotet_3.png)", "sentence_right": "The figure below shows the following emails:", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japanese", "context_left": "* COVID-19 lure: On August 7, 2020 we began to see emails with attachment filenames that included “COVID-19” strings, such as “cd-8423 medical report covid-19.doc” and “covid-19 report 08 11 2020.doc”. *", "context_right": "Bitcoin extortion: Extortion emails in Japan are back. We saw them before Emotet took a break with an almost identical message.", "_context_left": "* ", "_context_right": " Bitcoin extortion: Extortion emails in Japan are back.", "sentence_left": "* COVID-19 lure: On August 7, 2020 we began to see emails with attachment filenames that included “COVID-19” strings, such as “cd-8423 medical report covid-19.doc” and “covid-19 report 08 11 2020.doc”.", "sentence_right": "We saw them before Emotet took a break with an almost identical message.", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japan", "context_left": "* COVID-19 lure: On August 7, 2020 we began to see emails with attachment filenames that included “COVID-19” strings, such as “cd-8423 medical report covid-19.doc” and “covid-19 report 08 11 2020.doc”. * Japanese Bitcoin extortion: Extortion emails in", "context_right": "are back. We saw them before Emotet took a break with an almost identical message.", "_context_left": "* Japanese Bitcoin extortion: Extortion emails in ", "_context_right": " are back.", "sentence_left": "* COVID-19 lure: On August 7, 2020 we began to see emails with attachment filenames that included “COVID-19” strings, such as “cd-8423 medical report covid-19.doc” and “covid-19 report 08 11 2020.doc”.", "sentence_right": "We saw them before Emotet took a break with an almost identical message.", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Japanese", "context_left": "![Emotet_4](/sites/default/files/inline-images/Emotet_4.png) *Figure 4: COVID-19 email example,", "context_right": "Bitcoin extortion email.* We confirmed open source reports that there are examples of Emotet emails that include benign attachments along with malicious ones.", "_context_left": "*Figure 4: COVID-19 email example, ", "_context_right": " Bitcoin extortion email.*", "sentence_left": "![Emotet_4](/sites/default/files/inline-images/Emotet_4.png)", "sentence_right": "We confirmed open source reports that there are examples of Emotet emails that include benign attachments along with malicious ones.", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Microsoft", "context_left": "![Emotet_6](/sites/default/files/inline-images/Emotet_6.png) *Figure 6: TA542 most commonly uses", "context_right": "Word documents with macros. The actor periodically updates the visual lure used in the document.", "_context_left": "*Figure 6: TA542 most commonly uses ", "_context_right": " Word documents with macros.", "sentence_left": "![Emotet_6](/sites/default/files/inline-images/Emotet_6.png)", "sentence_right": "The actor periodically updates the visual lure used in the document.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Proofpoint", "context_left": "*Table 4: Examples of Word document file names* File names that stood out: On August 7,", "context_right": "saw attachment filenames that included “COVID-19” strings, such as “**cd-8423 medical report covid-19.doc**” and “**covid-19 report 08 11 2020.doc**”. These names are still in use at the time of writing.", "_context_left": "File names that stood out: On August 7, ", "_context_right": " saw attachment filenames that included “COVID-19” strings, such as “**cd-8423 medical report covid-19.doc**” and “**covid-19 report 08 11 2020.doc**”.", "sentence_left": "*Table 4: Examples of Word document file names*", "sentence_right": "These names are still in use at the time of writing.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Microsoft", "context_left": "This may be accidental or a deliberate attempt to evade detection. We did not do thorough testing, but we know that", "context_right": "Word can open some of these attachments without errors despite the mismatch. For example, Word 2010 can open the files with .rtf extension.", "_context_left": "We did not do thorough testing, but we know that ", "_context_right": " Word can open some of these attachments without errors despite the mismatch.", "sentence_left": "This may be accidental or a deliberate attempt to evade detection.", "sentence_right": "For example, Word 2010 can open the files with .rtf extension.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Microsoft", "context_left": "The actor typically adds a nested structure of one or more folders on the compromised site and hosts a malicious PHP script that initiates the download of the payload. Currently we only observe URLs leading to", "context_right": "Word documents with macros. **Malware: Emotet**", "_context_left": "Currently we only observe URLs leading to ", "_context_right": " Word documents with macros.", "sentence_left": "The actor typically adds a nested structure of one or more folders on the compromised site and hosts a malicious PHP script that initiates the download of the payload.", "sentence_right": "**Malware: Emotet**", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "A new set of five payload URLs is seen periodically, as frequently as every 1 to 2 hours.", "context_left": "The Word attachments are first-stage downloaders that attempt to download the Emotet payload using macros from one of several (typically 5) hardcoded payload URLs.", "context_right": "Different documents may use the same set of 5 URLs. On any given day we observe up to 100 total payload URLs.", "_context_left": "", "_context_right": "", "sentence_left": "The Word attachments are first-stage downloaders that attempt to download the Emotet payload using macros from one of several (typically 5) hardcoded payload URLs.", "sentence_right": "Different documents may use the same set of 5 URLs. On any given day we observe up to 100 total payload URLs.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "There are often mistakes in the way that Emotet malicious emails are created, where placeholders or macros are not filled in.", "context_left": "**Mistakes**", "context_right": "These may be due to bugs in the code of the Emotet mail sending capability that generates these emails.", "_context_left": "", "_context_right": "", "sentence_left": "**Mistakes**", "sentence_right": "These may be due to bugs in the code of the Emotet mail sending capability that generates these emails.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "*Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "context_left": "| Vietnam | Vietnamese | Occasional |", "context_right": "Note that this list is not considered exhaustive.*", "_context_left": "", "_context_right": "", "sentence_left": "| Vietnam | Vietnamese | Occasional |", "sentence_right": "Note that this list is not considered exhaustive.*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 200[.]75[.]136[.]78:443", "context_left": "C&C: 47[.]153[.]115[.]154:465", "context_right": "C&C: 100[.]37[.]36[.]240:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 47[.]153[.]115[.]154:465", "sentence_right": "C&C: 100[.]37[.]36[.]240:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| **Format** | **Example** |", "context_left": "Word attachment names are not always English–they may be in a language appropriate to the targeted geography.", "context_right": "| #[5 digits].doc | #04216.doc |", "_context_left": "", "_context_right": "", "sentence_left": "Word attachment names are not always English–they may be in a language appropriate to the targeted geography.", "sentence_right": "| #[5 digits].doc | #04216.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 71[.]126[.]139[.]251:443", "context_left": "C&C: 72[.]214[.]55[.]195:995", "context_right": "C&C: 73[.]136[.]242[.]114:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 72[.]214[.]55[.]195:995", "sentence_right": "C&C: 73[.]136[.]242[.]114:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Extension mismatches: Some emails have attachment file names with a .docm, .rtf, or .zip extension, where they should be .doc extensions.", "context_left": "These names are still in use at the time of writing.", "context_right": "This may be accidental or a deliberate attempt to evade detection.", "_context_left": "", "_context_right": "", "sentence_left": "These names are still in use at the time of writing.", "sentence_right": "This may be accidental or a deliberate attempt to evade detection.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 68[.]33[.]206[.]204:443", "context_left": "C&C: 189[.]183[.]72[.]138:995", "context_right": "C&C: 49[.]191[.]3[.]234:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 189[.]183[.]72[.]138:995", "sentence_right": "C&C: 49[.]191[.]3[.]234:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Note that this list is not considered exhaustive.*", "context_left": "*Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "context_right": "**Mistakes**", "_context_left": "", "_context_right": "", "sentence_left": "*Table 2: Description of the countries with observed Emotet email campaigns since July 17, 2020.", "sentence_right": "**Mistakes**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 134[.]0[.]196[.]46:995", "context_left": "C&C: 96[.]227[.]127[.]13:443", "context_right": "C&C: 72[.]190[.]101[.]70:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 96[.]227[.]127[.]13:443", "sentence_right": "C&C: 72[.]190[.]101[.]70:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 72[.]209[.]191[.]27:443", "context_left": "C&C: 172[.]78[.]30[.]215:443", "context_right": "C&C: 76[.]170[.]77[.]99:995", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 172[.]78[.]30[.]215:443", "sentence_right": "C&C: 76[.]170[.]77[.]99:995", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "**Malware: Emotet**", "context_left": "Currently we only observe URLs leading to Microsoft Word documents with macros.", "context_right": "We have not done extensive comparative reverse engineering and review of Emotet and its modules, but components that we analyzed had very little change.", "_context_left": "", "_context_right": "", "sentence_left": "Currently we only observe URLs leading to Microsoft Word documents with macros.", "sentence_right": "We have not done extensive comparative reverse engineering and review of Emotet and its modules, but components that we analyzed had very little change.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 209[.]182[.]122[.]217:443", "context_left": "C&C: 99[.]231[.]221[.]117:443", "context_right": "C&C: 98[.]190[.]24[.]81:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 99[.]231[.]221[.]117:443", "sentence_right": "C&C: 98[.]190[.]24[.]81:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Note that this email still contains the {FROM.NAME} placeholder that should have been filled in with a name before the actor sent it.(top right)", "context_left": "* Spanish language email targeting Spain.", "context_right": "* Italian language email targeting Italy.(bottom right)", "_context_left": "", "_context_right": "", "sentence_left": "* Spanish language email targeting Spain.", "sentence_right": "* Italian language email targeting Italy.(bottom right)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "border: 1px solid #000 !important;", "context_left": ".node-blog-full .blog-content img {", "context_right": "}", "_context_left": "", "_context_right": "", "sentence_left": ".node-blog-full .blog-content img {", "sentence_right": "}", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 2[.]90[.]92[.]255:443", "context_left": "C&C: 207[.]255[.]161[.]8:465", "context_right": "C&C: 90[.]68[.]84[.]121:2222", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 207[.]255[.]161[.]8:465", "sentence_right": "C&C: 90[.]68[.]84[.]121:2222", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| zahlungsschreiben\\_[date]\\_[10 digits].doc | zahlungsschreiben\\_2020\\_08\\_1147364050.doc |", "context_left": "| form - [date].doc | form - aug 11, 2020.doc |", "context_right": "| swift\\_[date]\\_[10 digits].doc | swift\\_11\\_08\\_2020\\_6296415287.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| form - [date].doc | form - aug 11, 2020.doc |", "sentence_right": "| swift\\_[date]\\_[10 digits].doc | swift\\_11\\_08\\_2020\\_6296415287.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "It's also possible to watch for unusual (old) Emotet email in inboxes.", "context_left": "Those watching active Emotet infections took notice that new email sending modules were received.", "context_right": "On July 14, 2020 Proofpoint researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020.", "_context_left": "", "_context_right": "", "sentence_left": "Those watching active Emotet infections took notice that new email sending modules were received.", "sentence_right": "On July 14, 2020 Proofpoint researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "0b2d1270ce2c5950f73ef209a08ad8e32c583e83d076509be956353bf828f03b", "context_left": "576029dbd4166e9d6548f877bea422da5d7a07adfc5ca60c93dabbecfab3d6c7", "context_right": "e999fcc1edd2cc05f82a63d4c32cc7a6fbc0fbd12de2ee82dfdd857a8a15c403", "_context_left": "", "_context_right": "", "sentence_left": "576029dbd4166e9d6548f877bea422da5d7a07adfc5ca60c93dabbecfab3d6c7", "sentence_right": "e999fcc1edd2cc05f82a63d4c32cc7a6fbc0fbd12de2ee82dfdd857a8a15c403", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| swift\\_[date]\\_[10 digits].doc | swift\\_11\\_08\\_2020\\_6296415287.doc |", "context_left": "| zahlungsschreiben\\_[date]\\_[10 digits].doc | zahlungsschreiben\\_2020\\_08\\_1147364050.doc |", "context_right": "| sepa\\_[date].doc | sepa\\_2020\\_08.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| zahlungsschreiben\\_[date]\\_[10 digits].doc | zahlungsschreiben\\_2020\\_08\\_1147364050.doc |", "sentence_right": "| sepa\\_[date].doc | sepa\\_2020\\_08.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| po#[6 digits] [date].doc | po#046325 110820.doc |", "context_left": "| report [7 digits].doc | report 5557308.doc |", "context_right": "| payment summary - ref id- d[5 digits].doc | payment summary - ref id- d28114.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| report [7 digits].doc | report 5557308.doc |", "sentence_right": "| payment summary - ref id- d[5 digits].doc | payment summary - ref id- d28114.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| #[5 digits].doc | #04216.doc |", "context_left": "| **Format** | **Example** |", "context_right": "| [5 digits] logistics rate con.doc | 00089 logistics rate con.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| **Format** | **Example** |", "sentence_right": "| [5 digits] logistics rate con.doc | 00089 logistics rate con.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 68[.]116[.]193[.]239:443", "context_left": "C&C: 217[.]165[.]115[.]0:990", "context_right": "C&C: 71[.]197[.]126[.]250:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 217[.]165[.]115[.]0:990", "sentence_right": "C&C: 71[.]197[.]126[.]250:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "b2d115a104c08eab952fc2bf342369307b89007fe24496c20378a422facb6341", "context_left": "a85780b23d01cb41db6f387e8351606361669bca4f669c869dee61a81333909a", "context_right": "cfb7d981b4782a468013b79d888ddb120b3166d4e0f2f1c4badb257ae0d233d4", "_context_left": "", "_context_right": "", "sentence_left": "a85780b23d01cb41db6f387e8351606361669bca4f669c869dee61a81333909a", "sentence_right": "cfb7d981b4782a468013b79d888ddb120b3166d4e0f2f1c4badb257ae0d233d4", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 197[.]210[.]96[.]222:995", "context_left": "C&C: 72[.]28[.]255[.]159:995", "context_right": "C&C: 71[.]192[.]44[.]92:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 72[.]28[.]255[.]159:995", "sentence_right": "C&C: 71[.]192[.]44[.]92:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 45[.]32[.]155[.]12:443", "context_left": "C&C: 2[.]89[.]74[.]34:995", "context_right": "C&C: 74[.]129[.]24[.]163:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 2[.]89[.]74[.]34:995", "sentence_right": "C&C: 74[.]129[.]24[.]163:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 98[.]219[.]77[.]197:443", "context_left": "C&C: 68[.]134[.]181[.]98:443", "context_right": "C&C: 65[.]131[.]20[.]49:995", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 68[.]134[.]181[.]98:443", "sentence_right": "C&C: 65[.]131[.]20[.]49:995", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 199[.]116[.]241[.]147:443", "context_left": "C&C: 72[.]185[.]47[.]86:995", "context_right": "C&C: 109[.]154[.]214[.]242:2222", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 72[.]185[.]47[.]86:995", "sentence_right": "C&C: 109[.]154[.]214[.]242:2222", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 47[.]153[.]115[.]154:465", "context_left": "C&C: 76[.]170[.]77[.]99:995", "context_right": "C&C: 200[.]75[.]136[.]78:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 76[.]170[.]77[.]99:995", "sentence_right": "C&C: 200[.]75[.]136[.]78:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 68[.]204[.]164[.]222:443", "context_left": "C&C: 24[.]28[.]183[.]107:995", "context_right": "**Conclusion**", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 24[.]28[.]183[.]107:995", "sentence_right": "**Conclusion**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* Outstanding Invoices", "context_left": "* Our stay at the Weekend", "context_right": "* PO 54203", "_context_left": "", "_context_right": "", "sentence_left": "* Our stay at the Weekend", "sentence_right": "* PO 54203", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "They have introduced code changes to their malware, such as updates to the email sending module, and picked up a new affiliate payload to distribute (Qbot).", "context_left": "Since returning from an extended vacation, TA542 email campaigns are once again the most prevalent by message volume by a large margin, with only a few other actors coming close.", "context_right": "They continue to experiment with delivery to new countries.", "_context_left": "", "_context_right": "", "sentence_left": "Since returning from an extended vacation, TA542 email campaigns are once again the most prevalent by message volume by a large margin, with only a few other actors coming close.", "sentence_right": "They continue to experiment with delivery to new countries.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 188[.]15[.]173[.]34:995", "context_left": "C&C: 182[.]185[.]98[.]215:995", "context_right": "C&C: 68[.]190[.]152[.]98:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 182[.]185[.]98[.]215:995", "sentence_right": "C&C: 68[.]190[.]152[.]98:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "They use simple “call to action” emails.", "context_left": "They compose emails in the appropriate language for the targeted country.", "context_right": "**Emails**", "_context_left": "", "_context_right": "", "sentence_left": "They compose emails in the appropriate language for the targeted country.", "sentence_right": "**Emails**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 82[.]78[.]132[.]227:443", "context_left": "C&C: 102[.]44[.]192[.]196:995", "context_right": "C&C: 75[.]135[.]184[.]133:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 102[.]44[.]192[.]196:995", "sentence_right": "C&C: 75[.]135[.]184[.]133:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "02638706a6e9bdc4d62fe6d0aed441c95b19f66b4647b5e9a0aded18c17c1a64", "context_left": "cfb7d981b4782a468013b79d888ddb120b3166d4e0f2f1c4badb257ae0d233d4", "context_right": "7ca48480ca645ee2b83bf707893e84115f87ea6e327f369e40c4ab0afc8abe7a", "_context_left": "", "_context_right": "", "sentence_left": "cfb7d981b4782a468013b79d888ddb120b3166d4e0f2f1c4badb257ae0d233d4", "sentence_right": "7ca48480ca645ee2b83bf707893e84115f87ea6e327f369e40c4ab0afc8abe7a", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "**Attachments/URLs**", "context_left": "*Figure 5: benign PDF attachments in the same email with malicious Word attachments.*", "context_right": "The malicious content included in the emails sent by this threat actor is either a URL or an attachment, and sometimes but rarely both a URL and an attachment in the same email.", "_context_left": "", "_context_right": "", "sentence_left": "*Figure 5: benign PDF attachments in the same email with malicious Word attachments.*", "sentence_right": "The malicious content included in the emails sent by this threat actor is either a URL or an attachment, and sometimes but rarely both a URL and an attachment in the same email.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| [4 digits]-[5 digits]\\_county\\_report.doc | 1660-63745\\_county\\_report.doc |", "context_left": "| [11 digits]\\_jul2020.doc | 10068100718\\_jul2020.doc |", "context_right": "| [4 digits]-[5 digits]\\_city\\_report.doc | 1850-91171\\_city\\_report.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| [11 digits]\\_jul2020.doc | 10068100718\\_jul2020.doc |", "sentence_right": "| [4 digits]-[5 digits]\\_city\\_report.doc | 1850-91171\\_city\\_report.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 78[.]102[.]138[.]103:995", "context_left": "C&C: 207[.]255[.]18[.]67:443", "context_right": "C&C: 149[.]71[.]49[.]39:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 207[.]255[.]18[.]67:443", "sentence_right": "C&C: 149[.]71[.]49[.]39:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "They continue to experiment with delivery to new countries.", "context_left": "They have introduced code changes to their malware, such as updates to the email sending module, and picked up a new affiliate payload to distribute (Qbot).", "context_right": "Despite these changes we also noted that many of their other methods and tooling have remained relatively unchanged from previous activity since their return.", "_context_left": "", "_context_right": "", "sentence_left": "They have introduced code changes to their malware, such as updates to the email sending module, and picked up a new affiliate payload to distribute (Qbot).", "sentence_right": "Despite these changes we also noted that many of their other methods and tooling have remained relatively unchanged from previous activity since their return.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 174[.]104[.]21[.]157:443", "context_left": "C&C: 98[.]26[.]50[.]62:995", "context_right": "C&C: 72[.]214[.]55[.]195:995", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 98[.]26[.]50[.]62:995", "sentence_right": "C&C: 72[.]214[.]55[.]195:995", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 200[.]124[.]231[.]21:443", "context_left": "C&C: 175[.]111[.]128[.]234:443", "context_right": "C&C: 47[.]206[.]174[.]82:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 175[.]111[.]128[.]234:443", "sentence_right": "C&C: 47[.]206[.]174[.]82:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 74[.]129[.]24[.]163:443", "context_left": "C&C: 45[.]32[.]155[.]12:443", "context_right": "C&C: 67[.]209[.]195[.]198:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 45[.]32[.]155[.]12:443", "sentence_right": "C&C: 67[.]209[.]195[.]198:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "2020-07-17: Word attachments, URLs", "context_left": "Demonstrated for the period of July 17, 2020 to August 18, 2020:", "context_right": "2020-07-20: Word attachments, PDF attachments, URLs", "_context_left": "", "_context_right": "", "sentence_left": "Demonstrated for the period of July 17, 2020 to August 18, 2020:", "sentence_right": "2020-07-20: Word attachments, PDF attachments, URLs", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 199[.]247[.]22[.]145:443", "context_left": "C&C: 86[.]99[.]75[.]165:2222", "context_right": "C&C: 69[.]123[.]179[.]70:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 86[.]99[.]75[.]165:2222", "sentence_right": "C&C: 69[.]123[.]179[.]70:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| [Firstname Lastname] | John Doe |", "context_left": "| **Format** | **Example** |", "context_right": "| [Firstname, Lastname] | John, Doe |", "_context_left": "", "_context_right": "", "sentence_left": "| **Format** | **Example** |", "sentence_right": "| [Firstname, Lastname] | John, Doe |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "*Table 3: PDF file names and format*", "context_left": "| [date]- balance & payment report.pdf | 2020\\_07- balance & payment report.pdf |", "context_right": "Conversely, they have a large and varying library of file name templates that they use for the Word documents, below examples represent a small fraction of possibilities.", "_context_left": "", "_context_right": "", "sentence_left": "| [date]- balance & payment report.pdf | 2020\\_07- balance & payment report.pdf |", "sentence_right": "Conversely, they have a large and varying library of file name templates that they use for the Word documents, below examples represent a small fraction of possibilities.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 201[.]216[.]216[.]245:443", "context_left": "C&C: 189[.]140[.]55[.]226:443", "context_right": "C&C: 50[.]244[.]112[.]10:995", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 189[.]140[.]55[.]226:443", "sentence_right": "C&C: 50[.]244[.]112[.]10:995", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 71[.]56[.]53[.]127:443", "context_left": "C&C: 49[.]191[.]3[.]234:443", "context_right": "C&C: 80[.]14[.]209[.]42:2222", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 49[.]191[.]3[.]234:443", "sentence_right": "C&C: 80[.]14[.]209[.]42:2222", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* Estimate [Digits]", "context_left": "Below are a few examples of other subjects, though this list is not exhaustive:", "context_right": "* Fatura [Date]", "_context_left": "", "_context_right": "", "sentence_left": "Below are a few examples of other subjects, though this list is not exhaustive:", "sentence_right": "* Fatura [Date]", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Those watching active Emotet infections took notice that new email sending modules were received.", "context_left": "Before diving into the analysis, it’s important to mention that Proofpoint and other researchers were able to see warnings that Emotet was about to return.", "context_right": "It's also possible to watch for unusual (old) Emotet email in inboxes.", "_context_left": "", "_context_right": "", "sentence_left": "Before diving into the analysis, it’s important to mention that Proofpoint and other researchers were able to see warnings that Emotet was about to return.", "sentence_right": "It's also possible to watch for unusual (old) Emotet email in inboxes.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* Payroll 80606", "context_left": "* Past Due Invoice", "context_right": "* Question", "_context_left": "", "_context_right": "", "sentence_left": "* Past Due Invoice", "sentence_right": "* Question", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| संपर्क जानकारी.doc |", "context_left": "|", "context_right": "*Table 4: Examples of Word document file names*", "_context_left": "", "_context_right": "", "sentence_left": "|", "sentence_right": "*Table 4: Examples of Word document file names*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Since returning from an extended vacation, TA542 email campaigns are once again the most prevalent by message volume by a large margin, with only a few other actors coming close.", "context_left": "**Conclusion**", "context_right": "They have introduced code changes to their malware, such as updates to the email sending module, and picked up a new affiliate payload to distribute (Qbot).", "_context_left": "", "_context_right": "", "sentence_left": "**Conclusion**", "sentence_right": "They have introduced code changes to their malware, such as updates to the email sending module, and picked up a new affiliate payload to distribute (Qbot).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "We confirmed open source reports that there are examples of Emotet emails that include benign attachments along with malicious ones.", "context_left": "*Figure 4: COVID-19 email example, Japanese Bitcoin extortion email.*", "context_right": "These make up a minor portion of Emotet email.", "_context_left": "", "_context_right": "", "sentence_left": "*Figure 4: COVID-19 email example, Japanese Bitcoin extortion email.*", "sentence_right": "These make up a minor portion of Emotet email.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "2020-08-14: Word attachments, URLs", "context_left": "2020-08-13: Word attachments, URLs", "context_right": "2020-08-17: Word attachments, URLs", "_context_left": "", "_context_right": "", "sentence_left": "2020-08-13: Word attachments, URLs", "sentence_right": "2020-08-17: Word attachments, URLs", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "A Comprehensive Look at Emotet’s Summer 2020 Return", "context_left": "", "context_right": "August 28, 2020", "_context_left": "", "_context_right": "", "sentence_left": "", "sentence_right": "August 28, 2020", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 193[.]248[.]44[.]2:2222", "context_left": "C&C: 109[.]100[.]125[.]127:2222", "context_right": "C&C: 66[.]222[.]88[.]126:995", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 109[.]100[.]125[.]127:2222", "sentence_right": "C&C: 66[.]222[.]88[.]126:995", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* INVOICE [Digits]", "context_left": "* Find attached invoice INV-Y-35852", "context_right": "* Nota fiscal", "_context_left": "", "_context_right": "", "sentence_left": "* Find attached invoice INV-Y-35852", "sentence_right": "* Nota fiscal", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 216[.]201[.]162[.]158:443", "context_left": "C&C: 89[.]137[.]211[.]239:443", "context_right": "C&C: 151[.]73[.]112[.]220:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 89[.]137[.]211[.]239:443", "sentence_right": "C&C: 151[.]73[.]112[.]220:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* RE: [subject from stolen email]", "context_left": "* Re: [subject from stolen email]", "context_right": "Another noticeable trend is using the recipient’s name, job function, company name, or company domain in the subject.", "_context_left": "", "_context_right": "", "sentence_left": "* Re: [subject from stolen email]", "sentence_right": "Another noticeable trend is using the recipient’s name, job function, company name, or company domain in the subject.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "![Emotet_4](/sites/default/files/inline-images/Emotet_4.png)", "context_left": "We saw them before Emotet took a break with an almost identical message.", "context_right": "*Figure 4: COVID-19 email example, Japanese Bitcoin extortion email.*", "_context_left": "", "_context_right": "", "sentence_left": "We saw them before Emotet took a break with an almost identical message.", "sentence_right": "*Figure 4: COVID-19 email example, Japanese Bitcoin extortion email.*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "2020-08-13: Word attachments, URLs", "context_left": "2020-08-12: Word attachments, URLs", "context_right": "2020-08-14: Word attachments, URLs", "_context_left": "", "_context_right": "", "sentence_left": "2020-08-12: Word attachments, URLs", "sentence_right": "2020-08-14: Word attachments, URLs", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "These emails came from many sender IPs, as if multiple emotet bots reactivated.", "context_left": "On July 14, 2020 Proofpoint researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020.", "context_right": "**Delivery**", "_context_left": "", "_context_right": "", "sentence_left": "On July 14, 2020 Proofpoint researchers spotted emails with old Emotet URLs, specifically those that were previously seen in the last known Emotet campaign on February 7, 2020.", "sentence_right": "**Delivery**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "However, Emotet has previously delivered Qbot affiliate “hhhXX” on a few occasions such as in March 2019, January 2019, May 2017, and April 2017.", "context_left": "Qbot affiliate id “partner01” is the primary payload dropped by Emotet seen almost daily.", "context_right": "Before Emotet disappeared from the landscape, it primarily delivered The Trick affiliate “morXX” in January and February 2020.", "_context_left": "", "_context_right": "", "sentence_left": "Qbot affiliate id “partner01” is the primary payload dropped by Emotet seen almost daily.", "sentence_right": "Before Emotet disappeared from the landscape, it primarily delivered The Trick affiliate “morXX” in January and February 2020.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 12[.]5[.]37[.]3:995", "context_left": "C&C: 47[.]206[.]174[.]82:443", "context_right": "C&C: 96[.]227[.]127[.]13:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 47[.]206[.]174[.]82:443", "sentence_right": "C&C: 96[.]227[.]127[.]13:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 86[.]182[.]234[.]245:2222", "context_left": "C&C: 47[.]28[.]131[.]209:443", "context_right": "C&C: 186[.]82[.]157[.]66:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 47[.]28[.]131[.]209:443", "sentence_right": "C&C: 186[.]82[.]157[.]66:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| [Firstname, Lastname] | John, Doe |", "context_left": "| [Firstname Lastname] | John Doe |", "context_right": "| [Companyname] | Widgetsmaker |", "_context_left": "", "_context_right": "", "sentence_left": "| [Firstname Lastname] | John Doe |", "sentence_right": "| [Companyname] | Widgetsmaker |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 108[.]28[.]179[.]42:995", "context_left": "C&C: 50[.]244[.]112[.]10:995", "context_right": "C&C: 108[.]27[.]217[.]44:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 50[.]244[.]112[.]10:995", "sentence_right": "C&C: 108[.]27[.]217[.]44:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 74[.]222[.]204[.]82:443", "context_left": "C&C: 66[.]30[.]92[.]147:443", "context_right": "C&C: 67[.]6[.]3[.]51:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 66[.]30[.]92[.]147:443", "sentence_right": "C&C: 67[.]6[.]3[.]51:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "![Emotet_5](/sites/default/files/inline-images/Emotet_5.png)", "context_left": "Examples below show benign PDF attachments along with malicious Word attachments.", "context_right": "*Figure 5: benign PDF attachments in the same email with malicious Word attachments.*", "_context_left": "", "_context_right": "", "sentence_left": "Examples below show benign PDF attachments along with malicious Word attachments.", "sentence_right": "*Figure 5: benign PDF attachments in the same email with malicious Word attachments.*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 109[.]154[.]214[.]242:2222", "context_left": "C&C: 199[.]116[.]241[.]147:443", "context_right": "C&C: 81[.]133[.]234[.]36:2222", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 199[.]116[.]241[.]147:443", "sentence_right": "C&C: 81[.]133[.]234[.]36:2222", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "|", "context_left": "| biz\\_[11 digits].doc | biz\\_10039266887.doc |", "context_right": "| august invoice.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| biz\\_[11 digits].doc | biz\\_10039266887.doc |", "sentence_right": "| august invoice.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Examples below show benign PDF attachments along with malicious Word attachments.", "context_left": "These make up a minor portion of Emotet email.", "context_right": "![Emotet_5](/sites/default/files/inline-images/Emotet_5.png)", "_context_left": "", "_context_right": "", "sentence_left": "These make up a minor portion of Emotet email.", "sentence_right": "![Emotet_5](/sites/default/files/inline-images/Emotet_5.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 99[.]240[.]226[.]2:443", "context_left": "C&C: 69[.]47[.]26[.]41:443", "context_right": "C&C: 188[.]210[.]228[.]156:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 69[.]47[.]26[.]41:443", "sentence_right": "C&C: 188[.]210[.]228[.]156:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "This collage shows two of the observed lures.*", "context_left": "The actor periodically updates the visual lure used in the document.", "context_right": "![Emotet_7](/sites/default/files/inline-images/Emotet_7.png)", "_context_left": "", "_context_right": "", "sentence_left": "The actor periodically updates the visual lure used in the document.", "sentence_right": "![Emotet_7](/sites/default/files/inline-images/Emotet_7.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 67[.]246[.]16[.]250:995", "context_left": "C&C: 67[.]209[.]195[.]198:443", "context_right": "C&C: 76[.]179[.]54[.]116:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 67[.]209[.]195[.]198:443", "sentence_right": "C&C: 76[.]179[.]54[.]116:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* Quote RFQ-00012679", "context_left": "* Quote 862639", "context_right": "* Quote Request", "_context_left": "", "_context_right": "", "sentence_left": "* Quote 862639", "sentence_right": "* Quote Request", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "* estimate ui00071 from {rcpt.domain-1-up}.doc", "context_left": "Placeholders like “{rcpt.domain}” are meant to be completed in the domain.", "context_right": "* invoice-e00889 from {rcpt.domain}.rtf.doc", "_context_left": "", "_context_right": "", "sentence_left": "Placeholders like “{rcpt.domain}” are meant to be completed in the domain.", "sentence_right": "* invoice-e00889 from {rcpt.domain}.rtf.doc", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 188[.]173[.]70[.]18:443", "context_left": "C&C: 2[.]7[.]65[.]32:2222", "context_right": "C&C: 188[.]26[.]11[.]29:2222", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 2[.]7[.]65[.]32:2222", "sentence_right": "C&C: 188[.]26[.]11[.]29:2222", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| [2 letters]-[4 digits] report p[1 number].pdf | qx-6971 report p2.pdf |", "context_left": "| report.pdf | report.pdf |", "context_right": "| soc report [date].pdf | soc report 07 21 2020.pdf |", "_context_left": "", "_context_right": "", "sentence_left": "| report.pdf | report.pdf |", "sentence_right": "| soc report [date].pdf | soc report 07 21 2020.pdf |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 24[.]201[.]79[.]208:2078", "context_left": "C&C: 81[.]133[.]234[.]36:2222", "context_right": "C&C: 2[.]89[.]74[.]34:21", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 81[.]133[.]234[.]36:2222", "sentence_right": "C&C: 2[.]89[.]74[.]34:21", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 65[.]24[.]76[.]114:443", "context_left": "C&C: 209[.]137[.]209[.]163:995", "context_right": "C&C: 95[.]76[.]185[.]240:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 209[.]137[.]209[.]163:995", "sentence_right": "C&C: 95[.]76[.]185[.]240:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "![Emotet_8](/sites/default/files/inline-images/Emotet_8.png)", "context_left": "For example, Word 2010 can open the files with .rtf extension.", "context_right": "*Figure 8: Example emails showing the extension mismatch*", "_context_left": "", "_context_right": "", "sentence_left": "For example, Word 2010 can open the files with .rtf extension.", "sentence_right": "*Figure 8: Example emails showing the extension mismatch*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "The figure below shows the following emails:", "context_left": "*Figure 2: Clockwise, starting from top left corner, Indonesian, Hindi, Filipino, Swedish language emails.*", "context_right": "* German language email targeting Germany.(top left)", "_context_left": "", "_context_right": "", "sentence_left": "*Figure 2: Clockwise, starting from top left corner, Indonesian, Hindi, Filipino, Swedish language emails.*", "sentence_right": "* German language email targeting Germany.(top left)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 207[.]255[.]161[.]8:465", "context_left": "C&C: 77[.]27[.]173[.]8:995", "context_right": "C&C: 2[.]90[.]92[.]255:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 77[.]27[.]173[.]8:995", "sentence_right": "C&C: 2[.]90[.]92[.]255:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "|", "context_left": "| anexo.doc |", "context_right": "| arquivo.doc |", "_context_left": "", "_context_right": "", "sentence_left": "| anexo.doc |", "sentence_right": "| arquivo.doc |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "Qbot affiliate id “partner01” is the primary payload dropped by Emotet seen almost daily.", "context_left": "**Emotet Payload: Qbot**", "context_right": "However, Emotet has previously delivered Qbot affiliate “hhhXX” on a few occasions such as in March 2019, January 2019, May 2017, and April 2017.", "_context_left": "", "_context_right": "", "sentence_left": "**Emotet Payload: Qbot**", "sentence_right": "However, Emotet has previously delivered Qbot affiliate “hhhXX” on a few occasions such as in March 2019, January 2019, May 2017, and April 2017.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "| INVOICE 1067935 from [Personname] | INVOICE 1067935 from John Doe |", "context_left": "| Files for [Companyname] | Files for John Doe |", "context_right": "*Table 1: Example subjects that use specific information related to recipient or their company*", "_context_left": "", "_context_right": "", "sentence_left": "| Files for [Companyname] | Files for John Doe |", "sentence_right": "*Table 1: Example subjects that use specific information related to recipient or their company*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 80[.]195[.]103[.]146:2222", "context_left": "C&C: 41[.]228[.]35[.]102:443", "context_right": "C&C: 65[.]48[.]219[.]244:22", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 41[.]228[.]35[.]102:443", "sentence_right": "C&C: 65[.]48[.]219[.]244:22", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}
{"mention": "C&C: 2[.]89[.]74[.]34:995", "context_left": "C&C: 188[.]26[.]11[.]29:2222", "context_right": "C&C: 45[.]32[.]155[.]12:443", "_context_left": "", "_context_right": "", "sentence_left": "C&C: 188[.]26[.]11[.]29:2222", "sentence_right": "C&C: 45[.]32[.]155[.]12:443", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2020-08-28_comprehensive-look-emotets-summer-2020"}