{"mention": "Proofpoint", "context_left": "Second, and just as critical, we want to show how organizations can use this insight better protect their greatest asset and today’s biggest risk: their people. The report is a small slice of the insight we offer customers through the", "context_right": "Nexus Threat Graph. Every day, we analyze billions of email messages, billions of URLs and attachments, tens of millions of cloud accounts and more—trillions of data points across all the digital channels that matter.", "_context_left": "The report is a small slice of the insight we offer customers through the ", "_context_right": " Nexus Threat Graph.", "sentence_left": "Second, and just as critical, we want to show how organizations can use this insight better protect their greatest asset and today’s biggest risk: their people.", "sentence_right": "Every day, we analyze billions of email messages, billions of URLs and attachments, tens of millions of cloud accounts and more—trillions of data points across all the digital channels that matter.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Microsoft", "context_left": "*Figure 1* Here’s a summary of how these techniques work: * **Office macros:** Exploits flaws in a mini-programming language designed to help automate and extend", "context_right": "Office features. Attackers use it to create embed malicious macros that infect users’ device when opened.", "_context_left": "* **Office macros:** Exploits flaws in a mini-programming language designed to help automate and extend ", "_context_right": " Office features.", "sentence_left": "*Figure 1* Here’s a summary of how these techniques work:", "sentence_right": "Attackers use it to create embed malicious macros that infect users’ device when opened.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "North America", "context_left": "### The takedown Authorities said in late January that they had shut down Emotet’s infrastructure as part of a coordinated effort across nine countries in", "context_right": "and Europe.[3](#footnote.section) Law enforcement appears to have taken over all three of Emotet’s known botnet networks. Authorities plan to retool the botnets to remove its own malware from infected systems.[4](#footnote.section)", "_context_left": "Authorities said in late January that they had shut down Emotet’s infrastructure as part of a coordinated effort across nine countries in ", "_context_right": " and Europe.[3](#footnote.section) Law enforcement appears to have taken over all three of Emotet’s known botnet networks.", "sentence_left": "### The takedown", "sentence_right": "Authorities plan to retool the botnets to remove its own malware from infected systems.[4](#footnote.section)", "label": "North America is a continent entirely within the Northern Hemisphere and almost all within the Western Hemisphere. It is also considered by some to be a northern subcontinent of the Americas. It is bordered to the north by the Arctic Ocean, to the east by the Atlantic Ocean, to the west and south by the Pacific Ocean, and to the southeast by South America and the Caribbean Sea.  North America covers an area of about 24,709,000 square kilometers (9,540,000 square miles), about 16.5% of the earth's land area and about 4.8% of its total surface. North America is the third largest continent by area, following Asia and Africa, and the fourth by population after Asia, Africa, and Europe. In 2013, its population was estimated at nearly 579 million people in 23 independent states, or about 7.5% of the world's population, if nearby islands (most notably the Caribbean) are included.  North America was reached by its first human populations during the last glacial period, via crossing the Bering land bridge approximately 40,000 to 17,000 years ago. The so-called Paleo-Indian period is taken to have lasted until about 10,000 years ago (the beginning of the Archaic or Meso-Indian period). The Classic stage spans roughly the 6th to 13th centuries. The Pre-Columbian era ended in 1492, with the beginning of the transatlantic migrations—the arrival of European settlers during the Age of Discovery and the Early Modern period. Present-day cultural and ethnic patterns reflect interactions between European colonists, indigenous peoples, African slaves and their descendants.  Owing", "label_id": 10343, "label_title": "North America", "label_link": "https://en.wikipedia.org/wiki?curid=21139", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Europe", "context_left": "### The takedown Authorities said in late January that they had shut down Emotet’s infrastructure as part of a coordinated effort across nine countries in North America and", "context_right": ".[3](#footnote.section) Law enforcement appears to have taken over all three of Emotet’s known botnet networks. Authorities plan to retool the botnets to remove its own malware from infected systems.[4](#footnote.section)", "_context_left": "Authorities said in late January that they had shut down Emotet’s infrastructure as part of a coordinated effort across nine countries in North America and ", "_context_right": ".[3](#footnote.section) Law enforcement appears to have taken over all three of Emotet’s known botnet networks.", "sentence_left": "### The takedown", "sentence_right": "Authorities plan to retool the botnets to remove its own malware from infected systems.[4](#footnote.section)", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Ukraine", "context_left": "TA542 had remained active in the days leading up to the shutdown, and efforts to disrupt large botnets in the past have had mixed results. We don’t know how large the team was operating the Emotet botnet and whether all of its members were in the", "context_right": ", where at least two of Emotet’s operators were arrested.[5](#footnote.section) If segments of the botnet and associated operators survive, Emotet’s source code may be retooled under a new infrastructure and new moniker.", "_context_left": "We don’t know how large the team was operating the Emotet botnet and whether all of its members were in the ", "_context_right": ", where at least two of Emotet’s operators were arrested.[5](#footnote.section)", "sentence_left": "TA542 had remained active in the days leading up to the shutdown, and efforts to disrupt large botnets in the past have had mixed results.", "sentence_right": "If segments of the botnet and associated operators survive, Emotet’s source code may be retooled under a new infrastructure and new moniker.", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Japan", "context_left": "------------------------------------------- First documented in 2017, TA544 is part of a financial crime ring that has targeted a range of industries", "context_right": "and several European countries, with a heavy focus on manufacturing and tech firms. It is an affiliate that distributes several strains of malware, including Panda Banker and others.", "_context_left": "First documented in 2017, TA544 is part of a financial crime ring that has targeted a range of industries ", "_context_right": " and several European countries, with a heavy focus on manufacturing and tech firms.", "sentence_left": "-------------------------------------------", "sentence_right": "It is an affiliate that distributes several strains of malware, including Panda Banker and others.", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "European", "context_left": "------------------------------------------- First documented in 2017, TA544 is part of a financial crime ring that has targeted a range of industries Japan and several", "context_right": "countries, with a heavy focus on manufacturing and tech firms. It is an affiliate that distributes several strains of malware, including Panda Banker and others.", "_context_left": "First documented in 2017, TA544 is part of a financial crime ring that has targeted a range of industries Japan and several ", "_context_right": " countries, with a heavy focus on manufacturing and tech firms.", "sentence_left": "-------------------------------------------", "sentence_right": "It is an affiliate that distributes several strains of malware, including Panda Banker and others.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Russian", "context_left": "TA573 is an affiliate distributor of Dridex, a malware strain that resurged in 2020 after a lying low through most of 2019. The malware itself is a creation of a", "context_right": "cyber crime group that calls itself Evil Corp,[6](#footnote.section) a longtime menace that recently turned to ransomware.[7](#footnote.section)  In June, U.S. authorities offered $5 million for information leading to the arrest of Evil Corp’s operators, the largest reward ever for a cyber criminal.", "_context_left": "The malware itself is a creation of a ", "_context_right": " cyber crime group that calls itself Evil Corp,[6](#footnote.section) a longtime menace that recently turned to ransomware.[7](#footnote.section) ", "sentence_left": "TA573 is an affiliate distributor of Dridex, a malware strain that resurged in 2020 after a lying low through most of 2019.", "sentence_right": "In June, U.S. authorities offered $5 million for information leading to the arrest of Evil Corp’s operators, the largest reward ever for a cyber criminal.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "U.S", "context_left": "The malware itself is a creation of a Russian cyber crime group that calls itself Evil Corp,[6](#footnote.section) a longtime menace that recently turned to ransomware.[7](#footnote.section) In June,", "context_right": ". authorities offered $5 million for information leading to the arrest of Evil Corp’s operators, the largest reward ever for a cyber criminal. TA800 holds healthcare data hostage", "_context_left": "In June, ", "_context_right": ". authorities offered $5 million for information leading to the arrest of Evil Corp’s operators, the largest reward ever for a cyber criminal.", "sentence_left": "The malware itself is a creation of a Russian cyber crime group that calls itself Evil Corp,[6](#footnote.section) a longtime menace that recently turned to ransomware.[7](#footnote.section)", "sentence_right": "TA800 holds healthcare data hostage", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "North America", "context_left": "(For more on how affiliates work, see the description of TA573). TA800 has targeted a wide range of industries in", "context_right": ", infecting victims with banking Trojans and malware loaders (malware designed to download other malware onto a compromised device). Malicious emails have often included recipients’ names, titles and employers along with phishing pages designed to look like the targeted company.", "_context_left": "TA800 has targeted a wide range of industries in ", "_context_right": ", infecting victims with banking Trojans and malware loaders (malware designed to download other malware onto a compromised device).", "sentence_left": "(For more on how affiliates work, see the description of TA573).", "sentence_right": "Malicious emails have often included recipients’ names, titles and employers along with phishing pages designed to look like the targeted company.", "label": "North America is a continent entirely within the Northern Hemisphere and almost all within the Western Hemisphere. It is also considered by some to be a northern subcontinent of the Americas. It is bordered to the north by the Arctic Ocean, to the east by the Atlantic Ocean, to the west and south by the Pacific Ocean, and to the southeast by South America and the Caribbean Sea.  North America covers an area of about 24,709,000 square kilometers (9,540,000 square miles), about 16.5% of the earth's land area and about 4.8% of its total surface. North America is the third largest continent by area, following Asia and Africa, and the fourth by population after Asia, Africa, and Europe. In 2013, its population was estimated at nearly 579 million people in 23 independent states, or about 7.5% of the world's population, if nearby islands (most notably the Caribbean) are included.  North America was reached by its first human populations during the last glacial period, via crossing the Bering land bridge approximately 40,000 to 17,000 years ago. The so-called Paleo-Indian period is taken to have lasted until about 10,000 years ago (the beginning of the Archaic or Meso-Indian period). The Classic stage spans roughly the 6th to 13th centuries. The Pre-Columbian era ended in 1492, with the beginning of the transatlantic migrations—the arrival of European settlers during the Age of Discovery and the Early Modern period. Present-day cultural and ethnic patterns reflect interactions between European colonists, indigenous peoples, African slaves and their descendants.  Owing", "label_id": 10343, "label_title": "North America", "label_link": "https://en.wikipedia.org/wiki?curid=21139", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "U.S. government", "context_left": "They are often not as well protected as other sectors and the life-and-death nature of the business means they can afford little downtime. Three", "context_right": "agencies warned hospitals in October of an “increased and imminent” cyber crime threat that included ransomware attacks.[8](#footnote.section) TA574: a new entrant draws on legacy malware", "_context_left": "Three ", "_context_right": " agencies warned hospitals in October of an “increased and imminent” cyber crime threat that included ransomware attacks.[8](#footnote.section)", "sentence_left": "They are often not as well protected as other sectors and the life-and-death nature of the business means they can afford little downtime.", "sentence_right": "TA574: a new entrant draws on legacy malware", "label": "The federal government of the United States (U.S. federal government) is the national government of the United States, a federal republic in North America, composed of 50 states, a federal district, five major self-governing territories and several island possessions. The federal government is composed of three distinct branches: legislative, executive and judicial, whose powers are vested by the U.S. Constitution in the Congress, the president and the federal courts, respectively. The powers and duties of these branches are further defined by acts of Congress, including the creation of executive departments and courts inferior to the Supreme Court.", "label_id": 105363, "label_title": "Federal government of the United States", "label_link": "https://en.wikipedia.org/wiki?curid=195149", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Europol", "context_left": "Leverage a solution that combines static and dynamic techniques at scale to detect new attack tools, tactics, and targets—and then learns from them. 1", "context_right": ". “World’s Most Dangerous Malware Emotet Disrupted Through Global Action.", "_context_left": "1", "_context_right": ".", "sentence_left": "Leverage a solution that combines static and dynamic techniques at scale to detect new attack tools, tactics, and targets—and then learns from them.", "sentence_right": "“World’s Most Dangerous Malware Emotet Disrupted Through Global Action.", "label": "The European Union Agency for Law Enforcement Cooperation, better known under the name Europol, formerly the European Police Office and Europol Drugs Unit, is the law enforcement agency of the European Union (EU) formed in 1998 to handle criminal intelligence and combat serious international organised crime and terrorism through cooperation between competent authorities of EU member states. The Agency has no executive powers, and its officials are not entitled to arrest suspects or act without prior approval from competent authorities in the member states. Seated in The Hague, South Holland, it comprised 1,065 staff in 2016.", "label_id": 210436, "label_title": "Europol", "label_link": "https://en.wikipedia.org/wiki?curid=525329", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "U.S. Department of Justice", "context_left": "January 2021. 2", "context_right": ". “Emotet Botnet Disrupted in International Cyber Operation.", "_context_left": "2", "_context_right": ".", "sentence_left": "January 2021.", "sentence_right": "“Emotet Botnet Disrupted in International Cyber Operation.", "label": "The United States Department of Justice (DOJ), also known as the Justice Department, is a federal executive department of the U.S. government, responsible for the enforcement of the law and administration of justice in the United States, equivalent to the justice or interior ministries of other countries. The department was formed in 1870 during the Ulysses S. Grant administration.  The Department of Justice administers several federal law enforcement agencies including the Federal Bureau of Investigation (FBI), the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), and the Drug Enforcement Administration (DEA). The department is responsible for investigating instances of financial fraud, representing the United States government in legal matters (such as in cases before the Supreme Court), and running the federal prison system. The department is also responsible for reviewing the conduct of local law enforcement as directed by the Violent Crime Control and Law Enforcement Act of 1994.  The department is headed by the United States Attorney General, who is nominated by the President and confirmed by the Senate and is a member of the Cabinet. The current Attorney General is William Barr.", "label_id": 26676, "label_title": "United States Department of Justice", "label_link": "https://en.wikipedia.org/wiki?curid=52563", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "ZDNet", "context_left": "January 2021. 3Danny Palmer (", "context_right": "). “Emotet: The world's most dangerous malware botnet was just disrupted by a major police operation.", "_context_left": "3Danny Palmer (", "_context_right": ").", "sentence_left": "January 2021.", "sentence_right": "“Emotet: The world's most dangerous malware botnet was just disrupted by a major police operation.", "label": "ZDNet is a business technology news website published by CBS Interactive, along with TechRepublic. The brand was founded on April 1, 1991, as a general interest technology portal from Ziff Davis and evolved into an enterprise IT-focused online publication owned by CNET Networks.", "label_id": 182823, "label_title": "ZDNet", "label_link": "https://en.wikipedia.org/wiki?curid=435858", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "ZDNet", "context_left": "January 2021. 4Catalin Cimpanu (", "context_right": "). “Authorities plan to mass-uninstall Emotet from infected hosts on April 25, 2021.", "_context_left": "4Catalin Cimpanu (", "_context_right": ").", "sentence_left": "January 2021.", "sentence_right": "“Authorities plan to mass-uninstall Emotet from infected hosts on April 25, 2021.", "label": "ZDNet is a business technology news website published by CBS Interactive, along with TechRepublic. The brand was founded on April 1, 1991, as a general interest technology portal from Ziff Davis and evolved into an enterprise IT-focused online publication owned by CNET Networks.", "label_id": 182823, "label_title": "ZDNet", "label_link": "https://en.wikipedia.org/wiki?curid=435858", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Wired", "context_left": "January 2021. 5Andy Greenberg (", "context_right": "). “Cops Disrupt Emotet, the Internet's ‘Most Dangerous Malware.", "_context_left": "5Andy Greenberg (", "_context_right": ").", "sentence_left": "January 2021.", "sentence_right": "“Cops Disrupt Emotet, the Internet's ‘Most Dangerous Malware.", "label": "Wired is a monthly American magazine, published in print and online editions, that focuses on how emerging technologies affect culture, the economy, and politics. Owned by Conde Nast, it is headquartered in San Francisco, California, and has been in publication since March/April 1993. Several spin-offs have been launched, including \"Wired UK\", \"Wired Italia\", \"Wired Japan\", and \"Wired Germany\". Conde Nast's parent company Advance Publications is also the major shareholder of Reddit, an internet information conglomeration website.  In its earliest colophons, \"Wired\" credited Canadian media theorist Marshall McLuhan as its \"patron saint.\" From its beginning, the strongest influence on the magazine's editorial outlook came from techno-utopian cofounder Stewart Brand and his associate Kevin Kelly.  From 1998 to 2006, \"Wired\" magazine and \"Wired News\", which publishes at Wired.com, had separate owners. However, \"Wired News\" remained responsible for republishing \"Wired\" magazine's content online due to an agreement when Conde Nast purchased the magazine. In 2006, Conde Nast bought \"Wired News\" for $25 million, reuniting the magazine with its website.  \"Wired\" contributor Chris Anderson is known for popularizing the term \"the Long Tail\", as a phrase relating to a \"power law\"-type graph that helps to visualize the 2000s emergent new media business model. Anderson's article for \"Wired\" on this paradigm related to research on power law distribution models carried out by Clay Shirky, specifically in relation to bloggers. Anderson widened the definition of the term in capitals to describe a specific point of view relating to what he sees as an overlooked aspect of the traditional market", "label_id": 32644, "label_title": "Wired (magazine)", "label_link": "https://en.wikipedia.org/wiki?curid=65411", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "BBC", "context_left": "December 2019. 7", "context_right": ". “Russian hacker group Evil Corp targets US workers at home. June 2020.", "_context_left": "7", "_context_right": ". “Russian hacker group Evil Corp targets US workers at home.", "sentence_left": "December 2019.", "sentence_right": "June 2020.", "label": "The British Broadcasting Corporation (BBC) is a British public service broadcaster. Its headquarters are at Broadcasting House in Westminster, London, and it is the world's oldest national broadcasting organisation and the largest broadcaster in the world by number of employees. It employs over 20,950 staff in total, 16,672 of whom are in public sector broadcasting. The total number of staff is 35,402 when part-time, flexible, and fixed-contract staff are included.  The BBC is established under a Royal Charter and operates under its Agreement with the Secretary of State for Digital, Culture, Media and Sport. Its work is funded principally by an annual television licence fee which is charged to all British households, companies, and organisations using any type of equipment to receive or record live television broadcasts and iPlayer catch-up. The fee is set by the British Government, agreed by Parliament, and used to fund the BBC's radio, TV, and online services covering the nations and regions of the UK. Since 1 April 2014, it has also funded the BBC World Service (launched in 1932 as the BBC Empire Service), which broadcasts in 28 languages and provides comprehensive TV, radio, and online services in Arabic and Persian.  Around a quarter of BBC's revenue comes from its commercial subsidiary BBC Studios Ltd (formerly BBC Worldwide), which sells BBC programmes and services internationally and also distributes the BBC's international 24-hour English-language news services BBC World News, and from BBC.com, provided by BBC Global News Ltd. In 2009, the company was awarded the Queen's Award for", "label_id": 2386234, "label_title": "BBC", "label_link": "https://en.wikipedia.org/wiki?curid=19344654", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Russian", "context_left": "December 2019. 7BBC. “", "context_right": "hacker group Evil Corp targets US workers at home. June 2020.", "_context_left": "7BBC. “", "_context_right": " hacker group Evil Corp targets US workers at home.", "sentence_left": "December 2019.", "sentence_right": "June 2020.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "US", "context_left": "December 2019. 7BBC. “Russian hacker group Evil Corp targets", "context_right": "workers at home. June 2020.", "_context_left": "7BBC. “Russian hacker group Evil Corp targets ", "_context_right": " workers at home.", "sentence_left": "December 2019.", "sentence_right": "June 2020.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "January 2021.", "context_left": "“Emotet Botnet Disrupted in International Cyber Operation.", "context_right": "3Danny Palmer (ZDNet).", "_context_left": "", "_context_right": "", "sentence_left": "“Emotet Botnet Disrupted in International Cyber Operation.", "sentence_right": "3Danny Palmer (ZDNet).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Some threats—including [business email compromise (BEC)](https://www.proofpoint.com/us/threat-reference/business-email-compromise) and other forms of [email fraud](https://www.proofpoint.com/us/blog/cybersecurity-essentials/cybersecurity-education-series-what-email-fraud)—can be hard to detect with conventional security tools.", "context_left": "Invest in a solution can manage the entire spectrum of email threats, not just malware-based threats.", "context_right": "Your solution should analyze both external and internal email—attackers may use compromised accounts to trick users within the same organization.", "_context_left": "", "_context_right": "", "sentence_left": "Invest in a solution can manage the entire spectrum of email threats, not just malware-based threats.", "sentence_right": "Your solution should analyze both external and internal email—attackers may use compromised accounts to trick users within the same organization.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "These attacks usually start with a phishing email that includes a URL that links to a page with embedded code that uses the PowerShell feature to take over the victim’s machine.", "context_left": "* **PowerShell:** Exploits Windows’ built-in administration tool to infect victim’s PCs.", "context_right": "These attacks are hard to detect because they use a legitimate Windows feature and don’t start with a full malware file.", "_context_left": "", "_context_right": "", "sentence_left": "* **PowerShell:** Exploits Windows’ built-in administration tool to infect victim’s PCs.", "sentence_right": "These attacks are hard to detect because they use a legitimate Windows feature and don’t start with a full malware file.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "The group has targeted multiple industries around the world, sending hundreds of thousands—or even millions—of messages per day.", "context_left": "TA542  has become one of the most prolific in recent years due to massive campaigns that use a malware strain called Emotet.", "context_right": "Dubbed “the world’s most dangerous malware,\"[1](#footnote.section)Emotet is versatile and highly adaptable.", "_context_left": "", "_context_right": "", "sentence_left": "TA542  has become one of the most prolific in recent years due to massive campaigns that use a malware strain called Emotet.", "sentence_right": "Dubbed “the world’s most dangerous malware,\"[1](#footnote.section)Emotet is versatile and highly adaptable.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Most attacks that use this technique trick the victim into clicking an unsafe URL, but attackers can also send HTML pages directly through email.", "context_left": "These include legitimate but compromised websites and web-based ads.", "context_right": "* **Thread hijacking:** After taking over someone’s email account, the attacker contacts people the compromised user knows, replying to past and ongoing email threads with a malicious email.", "_context_left": "", "_context_right": "", "sentence_left": "These include legitimate but compromised websites and web-based ads.", "sentence_right": "* **Thread hijacking:** After taking over someone’s email account, the attacker contacts people the compromised user knows, replying to past and ongoing email threads with a malicious email.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "The feature can also be used to download and run other malicious files from the internet.", "context_left": "These attacks are hard to detect because they use a legitimate Windows feature and don’t start with a full malware file.", "context_right": "* **HTML:** Web pages can include all kinds of code that exploits flaws in popular browsers and, on rare occasions, operating systems.", "_context_left": "", "_context_right": "", "sentence_left": "These attacks are hard to detect because they use a legitimate Windows feature and don’t start with a full malware file.", "sentence_right": "* **HTML:** Web pages can include all kinds of code that exploits flaws in popular browsers and, on rare occasions, operating systems.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Like other illicit markets, cyber crime is a loose, multilayered ecosystem that includes suppliers, distributors, money launderers and other specialties.", "context_left": "----------------------------------------------------", "context_right": "TA573 operates as a malware “affiliate,” which sends malware someone else has created.", "_context_left": "", "_context_right": "", "sentence_left": "----------------------------------------------------", "sentence_right": "TA573 operates as a malware “affiliate,” which sends malware someone else has created.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "They are often not as well protected as other sectors and the life-and-death nature of the business means they can afford little downtime.", "context_left": "Healthcare organizations have become an especially enticing target for ransomware attacks.", "context_right": "Three U.S. government agencies warned hospitals in October of an “increased and imminent” cyber crime threat that included ransomware attacks.[8](#footnote.section)", "_context_left": "", "_context_right": "", "sentence_left": "Healthcare organizations have become an especially enticing target for ransomware attacks.", "sentence_right": "Three U.S. government agencies warned hospitals in October of an “increased and imminent” cyber crime threat that included ransomware attacks.[8](#footnote.section)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "*Figure 3*", "context_left": "![Attacks](/sites/default/files/inline-images/Screen%20Shot%202021-02-12%20at%202.15.19%20PM.png)", "context_right": "It’s easy to see why.", "_context_left": "", "_context_right": "", "sentence_left": "![Attacks](/sites/default/files/inline-images/Screen%20Shot%202021-02-12%20at%202.15.19%20PM.png)", "sentence_right": "It’s easy to see why.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "January 2021.", "context_left": "“Cops Disrupt Emotet, the Internet's ‘Most Dangerous Malware.", "context_right": "6Krebs on Security.", "_context_left": "", "_context_right": "", "sentence_left": "“Cops Disrupt Emotet, the Internet's ‘Most Dangerous Malware.", "sentence_right": "6Krebs on Security.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "That includes user-level visibility into vulnerability, attacks and privilege and tailored controls that account for individual user risk.", "context_left": "That’s why you must take a people-centric approach to cybersecurity.", "context_right": "Here’s what we recommend as a starting point.", "_context_left": "", "_context_right": "", "sentence_left": "That’s why you must take a people-centric approach to cybersecurity.", "sentence_right": "Here’s what we recommend as a starting point.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "TA573 operates as a malware “affiliate,” which sends malware someone else has created.", "context_left": "Like other illicit markets, cyber crime is a loose, multilayered ecosystem that includes suppliers, distributors, money launderers and other specialties.", "context_right": "Think of affiliates as the last mile of the malware supply chain.", "_context_left": "", "_context_right": "", "sentence_left": "Like other illicit markets, cyber crime is a loose, multilayered ecosystem that includes suppliers, distributors, money launderers and other specialties.", "sentence_right": "Think of affiliates as the last mile of the malware supply chain.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "In many cases, social engineering is used to trick users into doing something directly—no malware needed.", "context_left": "Figure 1 shows attacks that used social engineering in tandem with a technical exploit or technique.", "context_right": "If listed as a separate technique, social engineering would easily dominate the chart as a component in 99% of all attacks.", "_context_left": "", "_context_right": "", "sentence_left": "Figure 1 shows attacks that used social engineering in tandem with a technical exploit or technique.", "sentence_right": "If listed as a separate technique, social engineering would easily dominate the chart as a component in 99% of all attacks.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Some researchers consider the most advanced cyber criminal groups to be APTs.", "context_left": "In other cases, they act as distributors, sending out emails with the malware and earning a commission on each successful infection.", "context_right": "* **Hacktivists**.", "_context_left": "", "_context_right": "", "sentence_left": "In other cases, they act as distributors, sending out emails with the malware and earning a commission on each successful infection.", "sentence_right": "* **Hacktivists**.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "---------------------", "context_left": "Top attack techniques", "context_right": "Email is by far the biggest channel for cyber attacks.", "_context_left": "", "_context_right": "", "sentence_left": "Top attack techniques", "sentence_right": "Email is by far the biggest channel for cyber attacks.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "*Figure 2*", "context_left": "![Message Volume ](/sites/default/files/inline-images/Screen%20Shot%202021-02-12%20at%202.13.02%20PM.png)", "context_right": "What are ‘threat actors.", "_context_left": "", "_context_right": "", "sentence_left": "![Message Volume ](/sites/default/files/inline-images/Screen%20Shot%202021-02-12%20at%202.13.02%20PM.png)", "sentence_right": "What are ‘threat actors.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "Since then, it has evolved into a highly versatile malware strain used for everything from stealing data to harvesting email to ransomware.", "context_left": "It was first discovered in 2014 as a simple banking Trojan aimed at stealing account credentials.", "context_right": "Emotet has been used to target critical industries around the world, including banking, e‑commerce, healthcare, academia, government and technology.[2](#footnote.section)", "_context_left": "", "_context_right": "", "sentence_left": "It was first discovered in 2014 as a simple banking Trojan aimed at stealing account credentials.", "sentence_right": "Emotet has been used to target critical industries around the world, including banking, e‑commerce, healthcare, academia, government and technology.[2](#footnote.section)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "They don’t write malware or run the infrastructure used to support attacks.", "context_left": "Think of affiliates as the last mile of the malware supply chain.", "context_right": "Instead, they’re the malware distributor, selecting targets and crafting emails designed to trick recipients into engaging with them.", "_context_left": "", "_context_right": "", "sentence_left": "Think of affiliates as the last mile of the malware supply chain.", "sentence_right": "Instead, they’re the malware distributor, selecting targets and crafting emails designed to trick recipients into engaging with them.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}
{"mention": "These attacks, though rare, typically expose secret information, disrupt perceived wrongdoing or embarrass foes.", "context_left": "This portmanteau of “hacking” and “activism” refers to attacks meant to make a political statement or effect policy change.", "context_right": "While their goals are different, they use many of the same tools and techniques as other types of attackers and can cause just as much harm.", "_context_left": "", "_context_right": "", "sentence_left": "This portmanteau of “hacking” and “activism” refers to attacks meant to make a political statement or effect policy change.", "sentence_right": "While their goals are different, they use many of the same tools and techniques as other types of attackers and can cause just as much harm.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-02-16_q4-2020-threat-report-quarterly"}