{"mention": "Proofpoint", "context_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file. *", "context_right": "has observed three APT actors from India, Russia, and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states. * RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "_context_left": "* ", "_context_right": " has observed three APT actors from India, Russia, and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states.", "sentence_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file.", "sentence_right": "* RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "India", "context_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file. * Proofpoint has observed three APT actors from", "context_right": ", Russia, and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states. * RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "_context_left": "* Proofpoint has observed three APT actors from ", "_context_right": ", Russia, and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states.", "sentence_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file.", "sentence_right": "* RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Russia", "context_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file. * Proofpoint has observed three APT actors from India,", "context_right": ", and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states. * RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "_context_left": "* Proofpoint has observed three APT actors from India, ", "_context_right": ", and China using this technique in 2021, targeting a variety of entities likely of interest to their respective states.", "sentence_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file.", "sentence_right": "* RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "China", "context_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file. * Proofpoint has observed three APT actors from India, Russia, and", "context_right": "using this technique in 2021, targeting a variety of entities likely of interest to their respective states. * RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "_context_left": "* Proofpoint has observed three APT actors from India, Russia, and ", "_context_right": " using this technique in 2021, targeting a variety of entities likely of interest to their respective states.", "sentence_left": "* RTF template injection is a novel technique that is ideal for [malicious phishing](/us/threat-reference/phishing \"Phishing\") attachments because it is simple and allows threat actors to retrieve malicious content from a remote URL using an RTF file.", "sentence_right": "* RTF template injection is poised for wider adoption in the threat landscape including among cybercriminals based on its ease of use and relative effectiveness when compared with other phishing attachment template injection-based techniques.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "### Overview", "context_right": "threat researchers have observed the adoption of a novel and easily implemented phishing attachment technique by APT threat actors in Q2 and Q3 of 2021. This technique, referred to as RTF template injection, leverages the legitimate RTF template functionality.", "_context_left": "", "_context_right": " threat researchers have observed the adoption of a novel and easily implemented phishing attachment technique by APT threat actors in Q2 and Q3 of 2021.", "sentence_left": "### Overview", "sentence_right": "This technique, referred to as RTF template injection, leverages the legitimate RTF template functionality.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "The sample RTF template injection files analyzed for this publication currently have a lower detection rate by public antivirus engines when compared to the well-known Office-based template injection technique.", "context_right": "has identified distinct phishing campaigns utilizing the technique which have been attributed to a diverse set of APT threat actors in the wild. While this technique appears to be making the rounds among APT actors in several nations, Proofpoint assesses with moderate confidence, based on the recent rise in its usage and the triviality of its implementation, that it could soon be adopted by cybercriminals as well.", "_context_left": "", "_context_right": " has identified distinct phishing campaigns utilizing the technique which have been attributed to a diverse set of APT threat actors in the wild.", "sentence_left": "The sample RTF template injection files analyzed for this publication currently have a lower detection rate by public antivirus engines when compared to the well-known Office-based template injection technique.", "sentence_right": "While this technique appears to be making the rounds among APT actors in several nations, Proofpoint assesses with moderate confidence, based on the recent rise in its usage and the triviality of its implementation, that it could soon be adopted by cybercriminals as well.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "Proofpoint has identified distinct phishing campaigns utilizing the technique which have been attributed to a diverse set of APT threat actors in the wild. While this technique appears to be making the rounds among APT actors in several nations,", "context_right": "assesses with moderate confidence, based on the recent rise in its usage and the triviality of its implementation, that it could soon be adopted by cybercriminals as well. ### RTF Template Injection", "_context_left": "While this technique appears to be making the rounds among APT actors in several nations, ", "_context_right": " assesses with moderate confidence, based on the recent rise in its usage and the triviality of its implementation, that it could soon be adopted by cybercriminals as well.", "sentence_left": "Proofpoint has identified distinct phishing campaigns utilizing the technique which have been attributed to a diverse set of APT threat actors in the wild.", "sentence_right": "### RTF Template Injection", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "This method is viable in both .rtf and .doc.rtf files, allowing for the successful retrieval of remote payloads hosted at an external URL. ### RTF Template Injection in", "context_right": "Word In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing Microsoft Word.", "_context_left": "### RTF Template Injection in ", "_context_right": " Word", "sentence_left": "This method is viable in both .rtf and .doc.rtf files, allowing for the successful retrieval of remote payloads hosted at an external URL.", "sentence_right": "In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing Microsoft Word.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "### RTF Template Injection in Microsoft Word In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing", "context_right": "Word. As a result, when an RTF Remote Template Injection file is opened using Microsoft Word, the application will retrieve the resource from the specified URL before proceeding to display the lure content of the file.", "_context_left": "In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing ", "_context_right": " Word.", "sentence_left": "### RTF Template Injection in Microsoft Word", "sentence_right": "As a result, when an RTF Remote Template Injection file is opened using Microsoft Word, the application will retrieve the resource from the specified URL before proceeding to display the lure content of the file.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing Microsoft Word. As a result, when an RTF Remote Template Injection file is opened using", "context_right": "Word, the application will retrieve the resource from the specified URL before proceeding to display the lure content of the file. This technique is successful despite the inserted URL not being a valid document template file.", "_context_left": "As a result, when an RTF Remote Template Injection file is opened using ", "_context_right": " Word, the application will retrieve the resource from the specified URL before proceeding to display the lure content of the file.", "sentence_left": "In the case of .doc.rtf files the extension specifies that the RTF file will be opened utilizing Microsoft Word.", "sentence_right": "This technique is successful despite the inserted URL not being a valid document template file.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "*Figure 4. Sample RTF template injection Template Control Word.* The success of this technique was tested in a limited capacity by researchers at", "context_right": "and is likely more malleable than what has been demonstrated in this publication. The malleability of this method paired with an RTF file’s capability to render encoding for Unicode characters further increases the viability of this technique.", "_context_left": "The success of this technique was tested in a limited capacity by researchers at ", "_context_right": " and is likely more malleable than what has been demonstrated in this publication.", "sentence_left": "*Figure 4. Sample RTF template injection Template Control Word.*", "sentence_right": "The malleability of this method paired with an RTF file’s capability to render encoding for Unicode characters further increases the viability of this technique.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "### A Timeline of APT Actors Adopting RTF Template Injection", "context_right": "has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors. While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of India and China adopted RTF template injection during this time.", "_context_left": "", "_context_right": " has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors.", "sentence_left": "### A Timeline of APT Actors Adopting RTF Template Injection", "sentence_right": "While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of India and China adopted RTF template injection during this time.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "India", "context_left": "Proofpoint has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors. While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of", "context_right": "and China adopted RTF template injection during this time. Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May.", "_context_left": "While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of ", "_context_right": " and China adopted RTF template injection during this time.", "sentence_left": "Proofpoint has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors.", "sentence_right": "Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "China", "context_left": "Proofpoint has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors. While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of India and", "context_right": "adopted RTF template injection during this time. Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May.", "_context_left": "While the technique appears to pre-date this adoption with researchers [mentioning](https://fareedfauzi.github.io/posts/Maldoc-Cheatsheet/) the technique as early as January 2021, two distinct APT groups believed to be associated with the state interests of India and ", "_context_right": " adopted RTF template injection during this time.", "sentence_left": "Proofpoint has observed an increasing adoption of RTF template injection from February through April of 2021 by APT threat actors.", "sentence_right": "Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Indian", "context_left": "Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May. Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with", "context_right": "-state interests, were identified through July 8, 2021. RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "_context_left": "Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with ", "_context_right": "-state interests, were identified through July 8, 2021.", "sentence_left": "Signs of weaponization including the registration of delivery infrastructure were observed beginning on March 15, 2021 and April 8, 2021, respectively, with multiple distinct campaigns following throughout the months of April and May.", "sentence_right": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Chinese", "context_left": "Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with Indian-state interests, were identified through July 8, 2021. RTF files likely attributable to a", "context_right": "-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration. Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "_context_left": "RTF files likely attributable to a ", "_context_right": "-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "sentence_left": "Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with Indian-state interests, were identified through July 8, 2021.", "sentence_right": "Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Malaysian", "context_left": "Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with Indian-state interests, were identified through July 8, 2021. RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to", "context_right": "deep water energy exploration. Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "_context_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to ", "_context_right": " deep water energy exploration.", "sentence_left": "Template injection RTF files attributable to the APT group DoNot Team, that has [historically](https://www.first.org/resources/papers/tallinn2019/Linking_South_Asian_cyber_espionnage_groups-to-publish.pdf) been suspected of being aligned with Indian-state interests, were identified through July 8, 2021.", "sentence_right": "Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Russian Federal Security Service", "context_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration. Following this initial adoption period, the APT actor Gamaredon, which has been linked to the", "context_right": "(FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021. ![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "_context_left": "Following this initial adoption period, the APT actor Gamaredon, which has been linked to the ", "_context_right": " (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "sentence_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "sentence_right": "![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "label": "The Federal Security Service of the Russian Federation (FSB; ) is the principal security agency of Russia and the main successor agency to the USSR's Committee for State Security (KGB). Its main responsibilities are within the country and include counter-intelligence, internal and border security, counter-terrorism, and surveillance as well as investigating some other types of grave crimes and federal law violations. It is headquartered in Lubyanka Square, Moscow's centre, in the main building of the former KGB. According to the 1995 Federal Law \"On the Federal Security Service\", direction of the FSB is executed by the president of Russia, who appoints the Director of FSB.  The immediate predecessor of the FSB was the Federal Counterintelligence Service (FSK) of Russia, itself a successor to the KGB: on 12 April 1995, Russian president Boris Yeltsin signed a law mandating a reorganization of the FSK, which resulted in the creation of the FSB. In 2003, the FSB's responsibilities were widened by incorporating the previously independent Border Guard Service and a major part of the abolished Federal Agency of Government Communication and Information (FAPSI). The three major structural successor components of the former KGB that remain administratively independent of the FSB are the Foreign Intelligence Service (SVR), the State Guards (FSO), and the Main Directorate of Special Programs of the President of the Russian Federation.  Under Russian federal law, the FSB is a military service just like the armed forces, the MVD, the FSO, the SVR, the FSKN, Main Directorate for Drugs Control and EMERCOM's civil defence,", "label_id": 166274, "label_title": "Federal Security Service", "label_link": "https://en.wikipedia.org/wiki?curid=385990", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "FSB", "context_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration. Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (", "context_right": "), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021. ![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "_context_left": "Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (", "_context_right": "), was later observed utilizing RTF template injection files in campaigns that leveraged Ukrainian governmental file lures on October 5, 2021.", "sentence_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "sentence_right": "![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "label": "The Federal Security Service of the Russian Federation (FSB; ) is the principal security agency of Russia and the main successor agency to the USSR's Committee for State Security (KGB). Its main responsibilities are within the country and include counter-intelligence, internal and border security, counter-terrorism, and surveillance as well as investigating some other types of grave crimes and federal law violations. It is headquartered in Lubyanka Square, Moscow's centre, in the main building of the former KGB. According to the 1995 Federal Law \"On the Federal Security Service\", direction of the FSB is executed by the president of Russia, who appoints the Director of FSB.  The immediate predecessor of the FSB was the Federal Counterintelligence Service (FSK) of Russia, itself a successor to the KGB: on 12 April 1995, Russian president Boris Yeltsin signed a law mandating a reorganization of the FSK, which resulted in the creation of the FSB. In 2003, the FSB's responsibilities were widened by incorporating the previously independent Border Guard Service and a major part of the abolished Federal Agency of Government Communication and Information (FAPSI). The three major structural successor components of the former KGB that remain administratively independent of the FSB are the Foreign Intelligence Service (SVR), the State Guards (FSO), and the Main Directorate of Special Programs of the President of the Russian Federation.  Under Russian federal law, the FSB is a military service just like the armed forces, the MVD, the FSO, the SVR, the FSKN, Main Directorate for Drugs Control and EMERCOM's civil defence,", "label_id": 166274, "label_title": "Federal Security Service", "label_link": "https://en.wikipedia.org/wiki?curid=385990", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Ukrainian governmental", "context_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration. Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged", "context_right": "file lures on October 5, 2021. ![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "_context_left": "Following this initial adoption period, the APT actor Gamaredon, which has been linked to the Russian Federal Security Service (FSB), was later observed utilizing RTF template injection files in campaigns that leveraged ", "_context_right": " file lures on October 5, 2021.", "sentence_left": "RTF files likely attributable to a Chinese-related APT actor were identified as recently as September 29, 2021, targeting entities with ties to Malaysian deep water energy exploration.", "sentence_right": "![RTF template injection ](/sites/default/files/inline-images/Figure%205.JPG)", "label": "The Groysman government was formed on 14 April 2016, led by Volodymyr Groysman. It is the third Ukrainian cabinet formed since the 2014 Ukrainian revolution, following on from the first and second Yatsenyuk governments.", "label_id": 5051600, "label_title": "Groysman government", "label_link": "https://en.wikipedia.org/wiki?curid=50169857", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "Some RTF template injection files [attributed](https://ti.qianxin.com/blog/articles/Analysis-of-the-Donot-group%27s-attack-campaign-using-RTF-template-injection-against-the-neighbourhood/) by security researchers to DoNot Team had compilation timestamps from 2017, suggesting possible earlier adoption. However,", "context_right": "could not verify this group’s usage of the technique dating back several years and note that manipulation of compilation stamps in RTF files is a technique within threat actors’ capabilities. Files publicly [identified](https://twitter.com/ShadowChasing1/status/1387309759217365000) on April 5, 2021 utilize Unicode-signed 16-bit character notation within the RTF file that, when rendered, are revealed to be the remote template injection URL within the RTF template property field.", "_context_left": "However, ", "_context_right": " could not verify this group’s usage of the technique dating back several years and note that manipulation of compilation stamps in RTF files is a technique within threat actors’ capabilities.", "sentence_left": "Some RTF template injection files [attributed](https://ti.qianxin.com/blog/articles/Analysis-of-the-Donot-group%27s-attack-campaign-using-RTF-template-injection-against-the-neighbourhood/) by security researchers to DoNot Team had compilation timestamps from 2017, suggesting possible earlier adoption.", "sentence_right": "Files publicly [identified](https://twitter.com/ShadowChasing1/status/1387309759217365000) on April 5, 2021 utilize Unicode-signed 16-bit character notation within the RTF file that, when rendered, are revealed to be the remote template injection URL within the RTF template property field.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Pakistan", "context_left": "This group used this same technique throughout subsequent campaigns spanning from April through July 2021. Samples from the campaign utilized “defense proposal” lures and appeared to target entities in", "context_right": "and Sri Lanka. The use of Unicode signed character notation provides an obfuscation for the URL value included in the RTF file and is likely used by actors as an effort to evade static detection signatures in anti-virus engines.", "_context_left": "Samples from the campaign utilized “defense proposal” lures and appeared to target entities in ", "_context_right": " and Sri Lanka.", "sentence_left": "This group used this same technique throughout subsequent campaigns spanning from April through July 2021.", "sentence_right": "The use of Unicode signed character notation provides an obfuscation for the URL value included in the RTF file and is likely used by actors as an effort to evade static detection signatures in anti-virus engines.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Sri Lanka", "context_left": "This group used this same technique throughout subsequent campaigns spanning from April through July 2021. Samples from the campaign utilized “defense proposal” lures and appeared to target entities in Pakistan and", "context_right": ". The use of Unicode signed character notation provides an obfuscation for the URL value included in the RTF file and is likely used by actors as an effort to evade static detection signatures in anti-virus engines.", "_context_left": "Samples from the campaign utilized “defense proposal” lures and appeared to target entities in Pakistan and ", "_context_right": ".", "sentence_left": "This group used this same technique throughout subsequent campaigns spanning from April through July 2021.", "sentence_right": "The use of Unicode signed character notation provides an obfuscation for the URL value included in the RTF file and is likely used by actors as an effort to evade static detection signatures in anti-virus engines.", "label": "Sri Lanka (, ; '; \"Ilankai\"), officially the Democratic Socialist Republic of Sri Lanka, is an island country in South Asia, located in the Indian Ocean to the southwest of the Bay of Bengal and to the southeast of the Arabian Sea. The island is geographically separated from the Indian subcontinent by the Gulf of Mannar and the Palk Strait. The legislative capital, Sri Jayawardenepura Kotte, is a suburb of the commercial capital and largest city, Colombo.  Sri Lanka's documented history spans 3,000 years, with evidence of pre-historic human settlements dating back to at least 125,000 years. It has a rich cultural heritage and the first known Buddhist writings of Sri Lanka, the Pali Canon, date back to the Fourth Buddhist council in 29 BC. Its geographic location and deep harbours made it of great strategic importance from the time of the ancient Silk Road through to the modern Maritime Silk Road.  Sri Lanka was known from the beginning of British colonial rule as Ceylon (, ). A nationalist political movement arose in the country in the early 20th century to obtain political independence, which was granted in 1948; the country became a republic and adopted its current name in 1972. Sri Lanka's recent history has been marred by a 26-year civil war, which ended decisively when the Sri Lanka Armed Forces defeated the Liberation Tigers of Tamil Eelam (LTTE) in 2009.  The current constitution stipulates the political system as a republic and a unitary state governed by a semi-presidential system. It", "label_id": 13218, "label_title": "Sri Lanka", "label_link": "https://en.wikipedia.org/wiki?curid=26750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "In the case of the DoNot Team attachment files, the malicious template control word is embedded within the “\\*\\wgrffmtfilter” control word enclosing group. This feature is intended to apply a set of filters that will limit the displayed document style options in", "context_right": "Word when an RTF file is opened. The “wgrffmtfilters” are normally specified by four-digit hexadecimal values.", "_context_left": "This feature is intended to apply a set of filters that will limit the displayed document style options in ", "_context_right": " Word when an RTF file is opened.", "sentence_left": "In the case of the DoNot Team attachment files, the malicious template control word is embedded within the “\\*\\wgrffmtfilter” control word enclosing group.", "sentence_right": "The “wgrffmtfilters” are normally specified by four-digit hexadecimal values.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "This preexisting hexadecimal value may have informed the threat actor’s decision to include the template field in this section, since they [used](https://manuals.swissmains.com/download/attachments/1376332/Word2007RTFSpec9.pdf?version=1&modificationDate=1587628367473&api=v2) Unicode-signed 16-bit format to replace an existing hexadecimal value. Despite the perceived sophistication in using Unicode encoding within the RTF injection template, DoNot Team appears to have struggled to seamlessly integrate the template control word into the RTF file for initialization in", "context_right": "Word. When opening the files in Microsoft Word, a downloading message is displayed which reveals the intended malicious URL along with the invalid document template error message described above.", "_context_left": "Despite the perceived sophistication in using Unicode encoding within the RTF injection template, DoNot Team appears to have struggled to seamlessly integrate the template control word into the RTF file for initialization in ", "_context_right": " Word.", "sentence_left": "This preexisting hexadecimal value may have informed the threat actor’s decision to include the template field in this section, since they [used](https://manuals.swissmains.com/download/attachments/1376332/Word2007RTFSpec9.pdf?version=1&modificationDate=1587628367473&api=v2) Unicode-signed 16-bit format to replace an existing hexadecimal value.", "sentence_right": "When opening the files in Microsoft Word, a downloading message is displayed which reveals the intended malicious URL along with the invalid document template error message described above.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "Despite the perceived sophistication in using Unicode encoding within the RTF injection template, DoNot Team appears to have struggled to seamlessly integrate the template control word into the RTF file for initialization in Microsoft Word. When opening the files in", "context_right": "Word, a downloading message is displayed which reveals the intended malicious URL along with the invalid document template error message described above. These messages are visible in Figures 7 and 8.", "_context_left": "When opening the files in ", "_context_right": " Word, a downloading message is displayed which reveals the intended malicious URL along with the invalid document template error message described above.", "sentence_left": "Despite the perceived sophistication in using Unicode encoding within the RTF injection template, DoNot Team appears to have struggled to seamlessly integrate the template control word into the RTF file for initialization in Microsoft Word.", "sentence_right": "These messages are visible in Figures 7 and 8.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Malaysia", "context_left": "*Figure 8. DoNot Team RTF template injection File Document Template Error Message.* ### TA423 Adopts RTF Template Injection to Target", "context_right": "Between April and late September 2021, security researchers identified RTF template injection files in campaigns targeting entities in Malaysia as well as international companies operating in the energy exploration sector.", "_context_left": "### TA423 Adopts RTF Template Injection to Target ", "_context_right": "", "sentence_left": "*Figure 8. DoNot Team RTF template injection File Document Template Error Message.*", "sentence_right": "Between April and late September 2021, security researchers identified RTF template injection files in campaigns targeting entities in Malaysia as well as international companies operating in the energy exploration sector.", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Malaysia", "context_left": "### TA423 Adopts RTF Template Injection to Target Malaysia Between April and late September 2021, security researchers identified RTF template injection files in campaigns targeting entities in", "context_right": "as well as international companies operating in the energy exploration sector. These files demonstrate a persistent targeting of entities operating in the region utilizing RTF template injection files as phishing attachments.", "_context_left": "Between April and late September 2021, security researchers identified RTF template injection files in campaigns targeting entities in ", "_context_right": " as well as international companies operating in the energy exploration sector.", "sentence_left": "### TA423 Adopts RTF Template Injection to Target Malaysia", "sentence_right": "These files demonstrate a persistent targeting of entities operating in the region utilizing RTF template injection files as phishing attachments.", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Malaysian", "context_left": "*Figure 9. TA423 RTF template injection File Template Control Word.* The", "context_right": "-themed RTF template injection file successfully loaded in Microsoft Word without displaying error messages or displaying the URL downloading content message. The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file.", "_context_left": "The ", "_context_right": "-themed RTF template injection file successfully loaded in Microsoft Word without displaying error messages or displaying the URL downloading content message.", "sentence_left": "*Figure 9. TA423 RTF template injection File Template Control Word.*", "sentence_right": "The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file.", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "*Figure 9. TA423 RTF template injection File Template Control Word.* The Malaysian-themed RTF template injection file successfully loaded in", "context_right": "Word without displaying error messages or displaying the URL downloading content message. The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file.", "_context_left": "The Malaysian-themed RTF template injection file successfully loaded in ", "_context_right": " Word without displaying error messages or displaying the URL downloading content message.", "sentence_left": "*Figure 9. TA423 RTF template injection File Template Control Word.*", "sentence_right": "The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Kuala Lumpur", "context_left": "The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file. Additionally, it includes a single line referencing the National Palace in", "context_right": ". ![RTF template injection ](/sites/default/files/inline-images/Figure%2010.JPG)", "_context_left": "Additionally, it includes a single line referencing the National Palace in ", "_context_right": ".", "sentence_left": "The social engineering lure within the document is a simple message impersonating Office 365 that requests users to “Enable Editing” and “Enable Content” for the file.", "sentence_right": "![RTF template injection ](/sites/default/files/inline-images/Figure%2010.JPG)", "label": "Kuala Lumpur (), officially the Federal Territory of Kuala Lumpur () and commonly known as KL, is the national capital and largest city in Malaysia. As the global city of Malaysia, it covers an area of and has an estimated population of 1.73 million . Greater Kuala Lumpur, also known as the Klang Valley, is an urban agglomeration of 7.25 million people . It is among the fastest growing metropolitan regions in Southeast Asia, in both population and economic development.  Kuala Lumpur is the cultural, financial and economic centre of Malaysia. It is also home to the Parliament of Malaysia and the official residence of the Malaysian King (Yang di-Pertuan Agong), the Istana Negara. The city once held the headquarters of the executive and judicial branches of the federal government, but these were relocated to Putrajaya in early 1999. However, some sections of the political bodies still remain in Kuala Lumpur.  Kuala Lumpur is one of the three Federal Territories of Malaysia, enclaved within the state of Selangor, on the central west coast of Peninsular Malaysia. Since the 1990s, the city has played host to many international sporting, political and cultural events including the 1998 Commonwealth Games and the 2017 Southeast Asian Games. Kuala Lumpur has undergone rapid development in recent decades and is home to the tallest twin buildings in the world, the Petronas Towers, which have since become an iconic symbol of Malaysian development.  Kuala Lumpur has a comprehensive road system supported by an extensive range of public transport networks, such as", "label_id": 8152, "label_title": "Kuala Lumpur", "label_link": "https://en.wikipedia.org/wiki?curid=16854", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Malaysian", "context_left": "![RTF template injection ](/sites/default/files/inline-images/Figure%2010.JPG) *Figure 10. TA423", "context_right": "Themed RTF template injection File Lure.* ### Gamaredon Onboards RTF Template Injection Capabilities", "_context_left": "*Figure 10. TA423 ", "_context_right": " Themed RTF template injection File Lure.*", "sentence_left": "![RTF template injection ](/sites/default/files/inline-images/Figure%2010.JPG)", "sentence_right": "### Gamaredon Onboards RTF Template Injection Capabilities", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "### Gamaredon Onboards RTF Template Injection Capabilities At the beginning of October 2021,", "context_right": "researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense. This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "_context_left": "At the beginning of October 2021, ", "_context_right": " researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense.", "sentence_left": "### Gamaredon Onboards RTF Template Injection Capabilities", "sentence_right": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Ukrainian Ministry of Defense", "context_left": "### Gamaredon Onboards RTF Template Injection Capabilities At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the", "context_right": ". This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "_context_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the ", "_context_right": ".", "sentence_left": "### Gamaredon Onboards RTF Template Injection Capabilities", "sentence_right": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "label": "The Ministry of Defence of Ukraine () was established on 24 September 1991, one month after Ukraine's declaration of independence resolution. The ministry was in charge of all Soviet military forces reorganization on the territory of Ukrainian jurisdiction.  President of Ukraine (currently Volodymyr Zelensky) is Supreme Commander-in-Chief of the Armed Forces of Ukraine.  In 1994 Ukraine has voluntarily given up all nuclear weapons. The Ministry spent significant funds eliminating former nuclear powers, military bases and man-power equipment to meet Treaty on Conventional Armed Forces in Europe requirements.", "label_id": 1921766, "label_title": "Ministry of Defence (Ukraine)", "label_link": "https://en.wikipedia.org/wiki?curid=14284651", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Russian", "context_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense. This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the", "context_right": "FSB operating in the Republic of Crimea and the city of Sevastopol. The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "_context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the ", "_context_right": " FSB operating in the Republic of Crimea and the city of Sevastopol.", "sentence_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense.", "sentence_right": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "FSB", "context_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense. This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian", "context_right": "operating in the Republic of Crimea and the city of Sevastopol. The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "_context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian ", "_context_right": " operating in the Republic of Crimea and the city of Sevastopol.", "sentence_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense.", "sentence_right": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "label": "The Federal Security Service of the Russian Federation (FSB; ) is the principal security agency of Russia and the main successor agency to the USSR's Committee for State Security (KGB). Its main responsibilities are within the country and include counter-intelligence, internal and border security, counter-terrorism, and surveillance as well as investigating some other types of grave crimes and federal law violations. It is headquartered in Lubyanka Square, Moscow's centre, in the main building of the former KGB. According to the 1995 Federal Law \"On the Federal Security Service\", direction of the FSB is executed by the president of Russia, who appoints the Director of FSB.  The immediate predecessor of the FSB was the Federal Counterintelligence Service (FSK) of Russia, itself a successor to the KGB: on 12 April 1995, Russian president Boris Yeltsin signed a law mandating a reorganization of the FSK, which resulted in the creation of the FSB. In 2003, the FSB's responsibilities were widened by incorporating the previously independent Border Guard Service and a major part of the abolished Federal Agency of Government Communication and Information (FAPSI). The three major structural successor components of the former KGB that remain administratively independent of the FSB are the Foreign Intelligence Service (SVR), the State Guards (FSO), and the Main Directorate of Special Programs of the President of the Russian Federation.  Under Russian federal law, the FSB is a military service just like the armed forces, the MVD, the FSO, the SVR, the FSKN, Main Directorate for Drugs Control and EMERCOM's civil defence,", "label_id": 166274, "label_title": "Federal Security Service", "label_link": "https://en.wikipedia.org/wiki?curid=385990", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Republic of Crimea", "context_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense. This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the", "context_right": "and the city of Sevastopol. The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "_context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the ", "_context_right": " and the city of Sevastopol.", "sentence_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense.", "sentence_right": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "label": "The Republic of Crimea (; , \"Respublika Krym\" ; , \"Respublika Krym\"; ) is a federal subject of Russia that is located on the Crimean Peninsula. The capital city and largest city within the republic is Simferopol which is also the second largest city of Crimea, behind the federal city of Sevastopol. At the last census the republic had a population of  The Republic of Crimea came into existence as a republic within the Russian Federation following the events of 2014: in March 2014, after the takeover of Crimea by pro-Russian separatists and the Russian Armed Forces, an unconstitutional referendum was held on the issue of reunification with Russia, which official results and opinion polls indicated was supported by a large majority of Crimeans. The official result was that Crimeans overwhelmingly wished to join with Russia. Russia then annexed the Republic of Crimea and Sevastopol as federal subjects of Russia.  Russia and 17 UN member states officially recognize Crimea as part of the Russian Federation, while Ukraine and 114 other UN member states support Ukraine's territorial integrity. Ukraine continues to claim Crimea as an integral part of its territory as the Autonomous Republic of Crimea, supported by most foreign governments, and various United Nations General Assembly resolutions (68/262 and certain subsequent resolutions).", "label_id": 4436932, "label_title": "Republic of Crimea", "label_link": "https://en.wikipedia.org/wiki?curid=42237483", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Sevastopol", "context_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense. This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of", "context_right": ". The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "_context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of ", "_context_right": ".", "sentence_left": "At the beginning of October 2021, Proofpoint researchers identified public samples of Gamaredon RTF template injection documents which impersonated the Ukrainian Ministry of Defense.", "sentence_right": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "label": "Sevastopol (; ; ; , \"Aqyar\") is the largest city on the Crimean Peninsula and a major Black Sea port. Since annexing Crimea in 2014, the Russian Federation has administered Sevastopol as a federal city. Nevertheless, Ukraine and most of the UN member countries continue to regard Sevastopol as a city with special status within Ukraine. The population is made up of mostly Russians with small numbers of Ukrainians and Tatars.  Sevastopol has a population of concentrated mostly near the Sevastopol Bay and surrounding areas. The location and navigability of the city's harbours have made Sevastopol a strategically important port and naval base throughout history. The city has been a home to the Russian Black Sea Fleet, which is why it was considered as a separate city in Crimea of significant military importance and was once operated by the Soviet Union as a closed city.  Although relatively small at , Sevastopol's unique naval and maritime features have been the basis for a robust economy. The city enjoys mild winters and moderate warm summers; characteristics that help make it a popular seaside resort and tourist destination, mainly for visitors from the former Soviet republics. The city is also an important centre for marine biology research. In particular, dolphins have been studied and trained in the city by the military since the end of World War II.", "label_id": 26194, "label_title": "Sevastopol", "label_link": "https://en.wikipedia.org/wiki?curid=51587", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol. The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several", "context_right": "Office Word documents that impersonated Ukrainian government organizations. These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents.", "_context_left": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several ", "_context_right": " Office Word documents that impersonated Ukrainian government organizations.", "sentence_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "sentence_right": "These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Ukrainian", "context_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol. The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated", "context_right": "government organizations. These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents.", "_context_left": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated ", "_context_right": " government organizations.", "sentence_left": "This tactic is consistent with [reporting](https://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy) on this APT group that links Gamaredon to the Russian FSB operating in the Republic of Crimea and the city of Sevastopol.", "sentence_right": "These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents.", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations. These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious", "context_right": "Office phishing documents. Specifically, the Microsoft Office documents used remote template injection to retrieve malicious payload files using URIs with the directory “/ELENAPC/principles/” on several occasions.", "_context_left": "These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious ", "_context_right": " Office phishing documents.", "sentence_left": "The files communicate with the domain pretence77.glorious[.]nonima[.]ru which also was a remote template delivery URL used by several Microsoft Office Word documents that impersonated Ukrainian government organizations.", "sentence_right": "Specifically, the Microsoft Office documents used remote template injection to retrieve malicious payload files using URIs with the directory “/ELENAPC/principles/” on several occasions.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Microsoft", "context_left": "These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents. Specifically, the", "context_right": "Office documents used remote template injection to retrieve malicious payload files using URIs with the directory “/ELENAPC/principles/” on several occasions. Additionally, in several instances the resources retrieved delivered an MP3 file as a delivery resource.", "_context_left": "Specifically, the ", "_context_right": " Office documents used remote template injection to retrieve malicious payload files using URIs with the directory “/ELENAPC/principles/” on several occasions.", "sentence_left": "These Office files communicate with actor infrastructure using a URI pattern previously observed among Gamaredon malicious Microsoft Office phishing documents.", "sentence_right": "Additionally, in several instances the resources retrieved delivered an MP3 file as a delivery resource.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Proofpoint", "context_left": "The actor may be comparing the effectiveness of their efforts that utilize diverse attachment files to gauge the efficacy of their phishing tactics as they stage new campaigns. While", "context_right": "cannot definitively determine where Gamaredon may have encountered this RTF template injection technique, the inclusion of the template control word within the style filter section of the document suggests that they may be replicating capabilities encountered in open-source that were previously used as part of the DoNot Team campaigns earlier in 2021. ![image-20211129144351-3](/sites/default/files/inline-images/image-20211129144351-3.jpeg)", "_context_left": "While ", "_context_right": " cannot definitively determine where Gamaredon may have encountered this RTF template injection technique, the inclusion of the template control word within the style filter section of the document suggests that they may be replicating capabilities encountered in open-source that were previously used as part of the DoNot Team campaigns earlier in 2021.", "sentence_left": "The actor may be comparing the effectiveness of their efforts that utilize diverse attachment files to gauge the efficacy of their phishing tactics as they stage new campaigns.", "sentence_right": "![image-20211129144351-3](/sites/default/files/inline-images/image-20211129144351-3.jpeg)", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Indian", "context_left": "Ultimately this is a technique poised for wider adoption in the threat landscape beyond targeted phishing attacks with likely adopters being crimeware actors. While", "context_right": "and Chinese APT actors have demonstrated an affinity for RTF file types in the past by using RTF weaponizers like the tool [Royal Road](https://www.virusbulletin.com/virusbulletin/2020/03/vb2019-paper-attribution-object-using-rtf-object-dimensions-track-apt-phishing-weaponizers/), defenders eventually saw those tools and techniques become widely used by less sophisticated actors. This well-established trickle-down pattern may be accelerated in this case based on the minimal effort needed to weaponize RTF attachments before deploying in active phishing campaigns", "_context_left": "While ", "_context_right": " and Chinese APT actors have demonstrated an affinity for RTF file types in the past by using RTF weaponizers like the tool [Royal Road](https://www.virusbulletin.com/virusbulletin/2020/03/vb2019-paper-attribution-object-using-rtf-object-dimensions-track-apt-phishing-weaponizers/), defenders eventually saw those tools and techniques become widely used by less sophisticated actors.", "sentence_left": "Ultimately this is a technique poised for wider adoption in the threat landscape beyond targeted phishing attacks with likely adopters being crimeware actors.", "sentence_right": "This well-established trickle-down pattern may be accelerated in this case based on the minimal effort needed to weaponize RTF attachments before deploying in active phishing campaigns", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}
{"mention": "Chinese", "context_left": "Ultimately this is a technique poised for wider adoption in the threat landscape beyond targeted phishing attacks with likely adopters being crimeware actors. While Indian and", "context_right": "APT actors have demonstrated an affinity for RTF file types in the past by using RTF weaponizers like the tool [Royal Road](https://www.virusbulletin.com/virusbulletin/2020/03/vb2019-paper-attribution-object-using-rtf-object-dimensions-track-apt-phishing-weaponizers/), defenders eventually saw those tools and techniques become widely used by less sophisticated actors. This well-established trickle-down pattern may be accelerated in this case based on the minimal effort needed to weaponize RTF attachments before deploying in active phishing campaigns", "_context_left": "While Indian and ", "_context_right": " APT actors have demonstrated an affinity for RTF file types in the past by using RTF weaponizers like the tool [Royal Road](https://www.virusbulletin.com/virusbulletin/2020/03/vb2019-paper-attribution-object-using-rtf-object-dimensions-track-apt-phishing-weaponizers/), defenders eventually saw those tools and techniques become widely used by less sophisticated actors.", "sentence_left": "Ultimately this is a technique poised for wider adoption in the threat landscape beyond targeted phishing attacks with likely adopters being crimeware actors.", "sentence_right": "This well-established trickle-down pattern may be accelerated in this case based on the minimal effort needed to weaponize RTF attachments before deploying in active phishing campaigns", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-12-01_injection-new-black-novel-rtf"}