{"mention": "Proofpoint", "context_left": "", "context_right": "has observed the use of COVID-19 in broad-scale social engineering attacks leading to malware, credential phishing, and BEC since the beginning of the pandemic.", "_context_left": "", "_context_right": " has observed the use of COVID-19 in broad-scale social engineering attacks leading to malware, credential phishing, and BEC since the beginning of the pandemic.", "sentence_left": "January 14, 2021", "sentence_right": "We have observed COVID-19 themes consistent with current events throughout this healthcare crisis.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "As anticipated, over the last two months,", "context_right": "researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "_context_left": "As anticipated, over the last two months, ", "_context_right": " researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_left": "Initially, we saw lures around the virus's existence, which then turned to ancillary lures such as medical supply shortages.", "sentence_right": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "WHO", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as", "context_right": ", DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as ", "_context_right": ", DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "The World Health Organization (WHO) is a specialized agency of the United Nations that is concerned with international public health. It was established on 7 April 1948, and is headquartered in Geneva, Switzerland. The WHO is a member of the United Nations Development Group. Its predecessor, the Health Organization, was an agency of the League of Nations.  The constitution of the World Health Organization had been signed by 61 countries (all 51 member countries and 10 others) on 22 July 1946, with the first meeting of the World Health Assembly finishing on 24 July 1948. It incorporated the and the League of Nations Health Organization. Since its establishment, it has played a leading role in the eradication of smallpox. Its current priorities include communicable diseases, in particular HIV/AIDS, Ebola, malaria and tuberculosis; the mitigation of the effects of non-communicable diseases such as sexual and reproductive health, development, and aging; nutrition, food security and healthy eating; occupational health; substance abuse; and driving the development of reporting, publications, and networking.  The WHO is responsible for the World Health Report, the worldwide World Health Survey, and World Health Day. The current Director-General of the WHO is Tedros Adhanom, who started his five-year term on 1 July 2017.", "label_id": 16506, "label_title": "World Health Organization", "label_link": "https://en.wikipedia.org/wiki?curid=33583", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "DHL", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO,", "context_right": ", and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, ", "_context_right": ", and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "DHL (Dalsey, Hillblom and Lynn) International GmbH is an American-founded German company which is now the international courier, parcel, and express mail division of the German logistics company Deutsche Post DHL. Deutsche Post DHL is the world's largest logistics company, particularly in sea and air mail. The company delivers over 1.3 billion parcels per year.  The company was founded in the United States in 1969 and expanded its service throughout the world by the late 1970s. The company was primarily interested in offshore and intercontinental deliveries, but the success of FedEx prompted their own intra-US expansion starting in 1983.  In 1998, Deutsche Post began to acquire shares in DHL. It reached controlling interest in 2001, and acquired all outstanding shares by December 2002. The company then absorbed DHL into its Express division, while expanding the use of the DHL brand to other Deutsche Post divisions, business units, and subsidiaries. Today, DHL Express shares its DHL brand with business units such as DHL Global Forwarding and DHL Supply Chain. It gained a foothold in the United States when it acquired Airborne Express.  The DHL Express financial results are published in the Deutsche Post AG annual report. In 2016, this division's revenue increased by 2.7 per cent to €14 billion. The earnings before interest and taxes (EBIT) increased by 11.3% over 2015 to €1.5 billion.", "label_id": 163147, "label_title": "DHL", "label_link": "https://en.wikipedia.org/wiki?curid=375954", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the", "context_right": ", Canada, Austria, and Germany.", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the ", "_context_right": ", Canada, Austria, and Germany.", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Canada", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States,", "context_right": ", Austria, and Germany.", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, ", "_context_right": ", Austria, and Germany.", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Austria", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada,", "context_right": ", and Germany.", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, ", "_context_right": ", and Germany.", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "Austria (, ; ), officially the Republic of Austria (, ), is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of , a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below , and its highest point is . The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene.  Austria played a central role in European History from the late 18th to the early 20th century. It initially emerged as a margraviate around 976 and developed into a duchy and later archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal houses in history. As archduchy, it was a major component and administrative centre of the Holy Roman Empire. Following the Holy Roman Empire's dissolution, Austria founded its own empire in the 19th century, which became a great power and the leading force of the German Confederation. Subsequent to the Austro-Prussian War", "label_id": 3101003, "label_title": "Austria", "label_link": "https://en.wikipedia.org/wiki?curid=26964606", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Germany", "context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and", "context_right": ".", "_context_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and ", "_context_right": ".", "sentence_left": "As anticipated, over the last two months, Proofpoint researchers observed more attacks that leverage the COVID-19 vaccine news, such as approvals of the vaccine by world governments, logistics of vaccine deployment, and distribution of the vaccine to frontline responders and other individuals.", "sentence_right": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "From December 1 to December 15, 2020,", "context_right": "observed a large BEC campaign (thousands of emails) spoofing executives and attempting to elicit the recipient's support in a bogus merger and/or acquisition.", "_context_left": "From December 1 to December 15, 2020, ", "_context_right": " observed a large BEC campaign (thousands of emails) spoofing executives and attempting to elicit the recipient's support in a bogus merger and/or acquisition.", "sentence_left": "*Figure 1: A malicious email purporting to be from an executive and asking the recipient for their cooperation in a confidential acquisition.*", "sentence_right": "These emails targeted various personnel in roles such as Vice President, General Manager, and Managing Director.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "The emails were primarily sent to companies in the", "context_right": ".", "_context_left": "The emails were primarily sent to companies in the ", "_context_right": ".", "sentence_left": "These emails targeted various personnel in roles such as Vice President, General Manager, and Managing Director.", "sentence_right": "These emails projected that COVID-19 vaccines would fuel the world's economic recovery.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "In this medium-sized campaign (hundreds of messages), threat actors began delivering messages on January 1, 2021, over four days, targeting dozens of different industries in", "context_right": "and Canada.", "_context_left": "In this medium-sized campaign (hundreds of messages), threat actors began delivering messages on January 1, 2021, over four days, targeting dozens of different industries in ", "_context_right": " and Canada.", "sentence_left": "*Figure 3: Phishing landing page with a red button asking users to “Login with office 365”*", "sentence_right": "The emails urged the potential victims to click a link to \"confirm their email to receive the vaccine\".", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Canada", "context_left": "In this medium-sized campaign (hundreds of messages), threat actors began delivering messages on January 1, 2021, over four days, targeting dozens of different industries in United States and", "context_right": ".", "_context_left": "In this medium-sized campaign (hundreds of messages), threat actors began delivering messages on January 1, 2021, over four days, targeting dozens of different industries in United States and ", "_context_right": ".", "sentence_left": "*Figure 3: Phishing landing page with a red button asking users to “Login with office 365”*", "sentence_right": "The emails urged the potential victims to click a link to \"confirm their email to receive the vaccine\".", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "At the time of this campaign, the vaccine in the", "context_right": "was still available to first responders and doctors on the front lines.", "_context_left": "At the time of this campaign, the vaccine in the ", "_context_right": " was still available to first responders and doctors on the front lines.", "sentence_left": "Specifically, the email talks about \"Government approval of the COVID-19 vaccine\" and provides a link where one can supposedly register to receive it.", "sentence_right": "The campaign also abused the brands of COVID-19 vaccine manufacturers as the lure in some of the emails.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "On January 11,", "context_right": "researchers observed another small (under 100 emails) BEC email campaign.", "_context_left": "On January 11, ", "_context_right": " researchers observed another small (under 100 emails) BEC email campaign.", "sentence_left": "*Figure 4: Email screenshot of the malicious email asking the recipient for their personal information*", "sentence_right": "The emails targeted various industries in the United States.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "The emails targeted various industries in the", "context_right": ".", "_context_left": "The emails targeted various industries in the ", "_context_right": ".", "sentence_left": "On January 11, Proofpoint researchers observed another small (under 100 emails) BEC email campaign.", "sentence_right": "This campaign is another excellent example of BEC actors picking vaccine lures in an attempt to exploit their targets.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "World Health Organization", "context_left": "*Figure 5: Agent Tesla abuses", "context_right": "Brand*", "_context_left": "*Figure 5: Agent Tesla abuses ", "_context_right": " Brand*", "sentence_left": "![image-20210127001354-6](/sites/default/files/inline-images/image-20210127001354-6.png)", "sentence_right": "On January 12, 2020, Proofpoint observed a medium-sized (several hundred messages) email campaign targeting many industries in the United States.", "label": "The World Health Organization (WHO) is a specialized agency of the United Nations that is concerned with international public health. It was established on 7 April 1948, and is headquartered in Geneva, Switzerland. The WHO is a member of the United Nations Development Group. Its predecessor, the Health Organization, was an agency of the League of Nations.  The constitution of the World Health Organization had been signed by 61 countries (all 51 member countries and 10 others) on 22 July 1946, with the first meeting of the World Health Assembly finishing on 24 July 1948. It incorporated the and the League of Nations Health Organization. Since its establishment, it has played a leading role in the eradication of smallpox. Its current priorities include communicable diseases, in particular HIV/AIDS, Ebola, malaria and tuberculosis; the mitigation of the effects of non-communicable diseases such as sexual and reproductive health, development, and aging; nutrition, food security and healthy eating; occupational health; substance abuse; and driving the development of reporting, publications, and networking.  The WHO is responsible for the World Health Report, the worldwide World Health Survey, and World Health Day. The current Director-General of the WHO is Tedros Adhanom, who started his five-year term on 1 July 2017.", "label_id": 16506, "label_title": "World Health Organization", "label_link": "https://en.wikipedia.org/wiki?curid=33583", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "On January 12, 2020,", "context_right": "observed a medium-sized (several hundred messages) email campaign targeting many industries in the United States.", "_context_left": "On January 12, 2020, ", "_context_right": " observed a medium-sized (several hundred messages) email campaign targeting many industries in the United States.", "sentence_left": "*Figure 5: Agent Tesla abuses World Health Organization Brand*", "sentence_right": "The email contained an attachment, \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.iso\" which included an embedded executable file named \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.exe\".", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "On January 12, 2020, Proofpoint observed a medium-sized (several hundred messages) email campaign targeting many industries in the", "context_right": ".", "_context_left": "On January 12, 2020, Proofpoint observed a medium-sized (several hundred messages) email campaign targeting many industries in the ", "_context_right": ".", "sentence_left": "*Figure 5: Agent Tesla abuses World Health Organization Brand*", "sentence_right": "The email contained an attachment, \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.iso\" which included an embedded executable file named \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.exe\".", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "World Health Organization", "context_left": "This campaign is notable due to the subject, \"COVID-19 APPROVED NEW VACCINES\", in the email lure and abuse of the", "context_right": "logo and name.", "_context_left": "This campaign is notable due to the subject, \"COVID-19 APPROVED NEW VACCINES\", in the email lure and abuse of the ", "_context_right": " logo and name.", "sentence_left": "This executable, if run by the user, drops and runs the AgentTesla keylogger.", "sentence_right": "Additionally, Proofpoint has observed this specific actor spreading RATs, stealers, keyloggers, and downloaders since at least 2019.", "label": "The World Health Organization (WHO) is a specialized agency of the United Nations that is concerned with international public health. It was established on 7 April 1948, and is headquartered in Geneva, Switzerland. The WHO is a member of the United Nations Development Group. Its predecessor, the Health Organization, was an agency of the League of Nations.  The constitution of the World Health Organization had been signed by 61 countries (all 51 member countries and 10 others) on 22 July 1946, with the first meeting of the World Health Assembly finishing on 24 July 1948. It incorporated the and the League of Nations Health Organization. Since its establishment, it has played a leading role in the eradication of smallpox. Its current priorities include communicable diseases, in particular HIV/AIDS, Ebola, malaria and tuberculosis; the mitigation of the effects of non-communicable diseases such as sexual and reproductive health, development, and aging; nutrition, food security and healthy eating; occupational health; substance abuse; and driving the development of reporting, publications, and networking.  The WHO is responsible for the World Health Report, the worldwide World Health Survey, and World Health Day. The current Director-General of the WHO is Tedros Adhanom, who started his five-year term on 1 July 2017.", "label_id": 16506, "label_title": "World Health Organization", "label_link": "https://en.wikipedia.org/wiki?curid=33583", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "Additionally,", "context_right": "has observed this specific actor spreading RATs, stealers, keyloggers, and downloaders since at least 2019.", "_context_left": "Additionally, ", "_context_right": " has observed this specific actor spreading RATs, stealers, keyloggers, and downloaders since at least 2019.", "sentence_left": "This campaign is notable due to the subject, \"COVID-19 APPROVED NEW VACCINES\", in the email lure and abuse of the World Health Organization logo and name.", "sentence_right": "In March 2020, they used their first COVID-19 email lures, and since then, we have watched them adapt their COVID-19 lures to the current news cycles, to include mentions of the vaccine.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "DHL", "context_left": "###", "context_right": "Themed Phishing", "_context_left": "### ", "_context_right": " Themed Phishing", "sentence_left": "In March 2020, they used their first COVID-19 email lures, and since then, we have watched them adapt their COVID-19 lures to the current news cycles, to include mentions of the vaccine.", "sentence_right": "![image-20210127001410-7](/sites/default/files/inline-images/image-20210127001410-7.png)", "label": "DHL (Dalsey, Hillblom and Lynn) International GmbH is an American-founded German company which is now the international courier, parcel, and express mail division of the German logistics company Deutsche Post DHL. Deutsche Post DHL is the world's largest logistics company, particularly in sea and air mail. The company delivers over 1.3 billion parcels per year.  The company was founded in the United States in 1969 and expanded its service throughout the world by the late 1970s. The company was primarily interested in offshore and intercontinental deliveries, but the success of FedEx prompted their own intra-US expansion starting in 1983.  In 1998, Deutsche Post began to acquire shares in DHL. It reached controlling interest in 2001, and acquired all outstanding shares by December 2002. The company then absorbed DHL into its Express division, while expanding the use of the DHL brand to other Deutsche Post divisions, business units, and subsidiaries. Today, DHL Express shares its DHL brand with business units such as DHL Global Forwarding and DHL Supply Chain. It gained a foothold in the United States when it acquired Airborne Express.  The DHL Express financial results are published in the Deutsche Post AG annual report. In 2016, this division's revenue increased by 2.7 per cent to €14 billion. The earnings before interest and taxes (EBIT) increased by 11.3% over 2015 to €1.5 billion.", "label_id": 163147, "label_title": "DHL", "label_link": "https://en.wikipedia.org/wiki?curid=375954", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "DHL", "context_left": "*Figure 6: A screenshot of an email purporting to inform the recipient about an undelivered", "context_right": "vaccine package*", "_context_left": "*Figure 6: A screenshot of an email purporting to inform the recipient about an undelivered ", "_context_right": " vaccine package*", "sentence_left": "![image-20210127001410-7](/sites/default/files/inline-images/image-20210127001410-7.png)", "sentence_right": "![image-20210127001425-8](/sites/default/files/inline-images/image-20210127001425-8.png)", "label": "DHL (Dalsey, Hillblom and Lynn) International GmbH is an American-founded German company which is now the international courier, parcel, and express mail division of the German logistics company Deutsche Post DHL. Deutsche Post DHL is the world's largest logistics company, particularly in sea and air mail. The company delivers over 1.3 billion parcels per year.  The company was founded in the United States in 1969 and expanded its service throughout the world by the late 1970s. The company was primarily interested in offshore and intercontinental deliveries, but the success of FedEx prompted their own intra-US expansion starting in 1983.  In 1998, Deutsche Post began to acquire shares in DHL. It reached controlling interest in 2001, and acquired all outstanding shares by December 2002. The company then absorbed DHL into its Express division, while expanding the use of the DHL brand to other Deutsche Post divisions, business units, and subsidiaries. Today, DHL Express shares its DHL brand with business units such as DHL Global Forwarding and DHL Supply Chain. It gained a foothold in the United States when it acquired Airborne Express.  The DHL Express financial results are published in the Deutsche Post AG annual report. In 2016, this division's revenue increased by 2.7 per cent to €14 billion. The earnings before interest and taxes (EBIT) increased by 11.3% over 2015 to €1.5 billion.", "label_id": 163147, "label_title": "DHL", "label_link": "https://en.wikipedia.org/wiki?curid=375954", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "DHL", "context_left": "*Figure 7: Phishing landing page with", "context_right": "branding asking for user’s username or Email address and password*", "_context_left": "*Figure 7: Phishing landing page with ", "_context_right": " branding asking for user’s username or Email address and password*", "sentence_left": "![image-20210127001425-8](/sites/default/files/inline-images/image-20210127001425-8.png)", "sentence_right": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and Austria.", "label": "DHL (Dalsey, Hillblom and Lynn) International GmbH is an American-founded German company which is now the international courier, parcel, and express mail division of the German logistics company Deutsche Post DHL. Deutsche Post DHL is the world's largest logistics company, particularly in sea and air mail. The company delivers over 1.3 billion parcels per year.  The company was founded in the United States in 1969 and expanded its service throughout the world by the late 1970s. The company was primarily interested in offshore and intercontinental deliveries, but the success of FedEx prompted their own intra-US expansion starting in 1983.  In 1998, Deutsche Post began to acquire shares in DHL. It reached controlling interest in 2001, and acquired all outstanding shares by December 2002. The company then absorbed DHL into its Express division, while expanding the use of the DHL brand to other Deutsche Post divisions, business units, and subsidiaries. Today, DHL Express shares its DHL brand with business units such as DHL Global Forwarding and DHL Supply Chain. It gained a foothold in the United States when it acquired Airborne Express.  The DHL Express financial results are published in the Deutsche Post AG annual report. In 2016, this division's revenue increased by 2.7 per cent to €14 billion. The earnings before interest and taxes (EBIT) increased by 11.3% over 2015 to €1.5 billion.", "label_id": 163147, "label_title": "DHL", "label_link": "https://en.wikipedia.org/wiki?curid=375954", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Proofpoint", "context_left": "On January 14, 2021,", "context_right": "researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and Austria.", "_context_left": "On January 14, 2021, ", "_context_right": " researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and Austria.", "sentence_left": "*Figure 7: Phishing landing page with DHL branding asking for user’s username or Email address and password*", "sentence_right": "The emails urged the potential victims to click a link to \"go online to submit your correct address so we can deliver your package today\".", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "United States", "context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the", "context_right": ", Germany, and Austria.", "_context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the ", "_context_right": ", Germany, and Austria.", "sentence_left": "*Figure 7: Phishing landing page with DHL branding asking for user’s username or Email address and password*", "sentence_right": "The emails urged the potential victims to click a link to \"go online to submit your correct address so we can deliver your package today\".", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Germany", "context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States,", "context_right": ", and Austria.", "_context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, ", "_context_right": ", and Austria.", "sentence_left": "*Figure 7: Phishing landing page with DHL branding asking for user’s username or Email address and password*", "sentence_right": "The emails urged the potential victims to click a link to \"go online to submit your correct address so we can deliver your package today\".", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Austria", "context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and", "context_right": ".", "_context_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and ", "_context_right": ".", "sentence_left": "*Figure 7: Phishing landing page with DHL branding asking for user’s username or Email address and password*", "sentence_right": "The emails urged the potential victims to click a link to \"go online to submit your correct address so we can deliver your package today\".", "label": "Austria (, ; ), officially the Republic of Austria (, ), is a country in Central Europe comprising nine federated states. Its capital, largest city and one of nine states is Vienna. Austria has an area of , a population of nearly nine million people and a nominal GDP of $477 billion. It is bordered by the Czech Republic and Germany to the north, Hungary and Slovakia to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The terrain is landlocked and highly mountainous, lying within the Alps; only 32% of the country is below , and its highest point is . The majority of the population speaks local Bavarian dialects as their native language, and German in its standard form is the country's official language. Other regional languages are Hungarian, Burgenland Croatian, and Slovene.  Austria played a central role in European History from the late 18th to the early 20th century. It initially emerged as a margraviate around 976 and developed into a duchy and later archduchy. In the 16th century, Austria started serving as the heart of the Habsburg Monarchy and the junior branch of the House of Habsburg – one of the most influential royal houses in history. As archduchy, it was a major component and administrative centre of the Holy Roman Empire. Following the Holy Roman Empire's dissolution, Austria founded its own empire in the 19th century, which became a great power and the leading force of the German Confederation. Subsequent to the Austro-Prussian War", "label_id": 3101003, "label_title": "Austria", "label_link": "https://en.wikipedia.org/wiki?curid=26964606", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "DHL", "context_left": "| hxxp[:]//putrajayagemilang[.]com/covid\\_19\\_vaccine\\_delivery/dh?lo=[base64 of recipient email]  | URL  | January 14, 2021", "context_right": "themed phishing link  |", "_context_left": "| hxxp[:]//putrajayagemilang[.]com/covid\\_19\\_vaccine\\_delivery/dh?lo=[base64 of recipient email]  | URL  | January 14, 2021 ", "_context_right": " themed phishing link  |", "sentence_left": "| 2a0b7eba6ec8d395dcc4485e2369c2ec289819c378e0f1f81a87a7622e0da17c  | SHA256  | DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.exe  |", "sentence_right": "", "label": "DHL (Dalsey, Hillblom and Lynn) International GmbH is an American-founded German company which is now the international courier, parcel, and express mail division of the German logistics company Deutsche Post DHL. Deutsche Post DHL is the world's largest logistics company, particularly in sea and air mail. The company delivers over 1.3 billion parcels per year.  The company was founded in the United States in 1969 and expanded its service throughout the world by the late 1970s. The company was primarily interested in offshore and intercontinental deliveries, but the success of FedEx prompted their own intra-US expansion starting in 1983.  In 1998, Deutsche Post began to acquire shares in DHL. It reached controlling interest in 2001, and acquired all outstanding shares by December 2002. The company then absorbed DHL into its Express division, while expanding the use of the DHL brand to other Deutsche Post divisions, business units, and subsidiaries. Today, DHL Express shares its DHL brand with business units such as DHL Global Forwarding and DHL Supply Chain. It gained a foothold in the United States when it acquired Airborne Express.  The DHL Express financial results are published in the Deutsche Post AG annual report. In 2016, this division's revenue increased by 2.7 per cent to €14 billion. The earnings before interest and taxes (EBIT) increased by 11.3% over 2015 to €1.5 billion.", "label_id": 163147, "label_title": "DHL", "label_link": "https://en.wikipedia.org/wiki?curid=375954", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "In March 2020, they used their first COVID-19 email lures, and since then, we have watched them adapt their COVID-19 lures to the current news cycles, to include mentions of the vaccine.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Additionally, Proofpoint has observed this specific actor spreading RATs, stealers, keyloggers, and downloaders since at least 2019.", "sentence_right": "### DHL Themed Phishing", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "The lure themes leveraged a range of topics, including fear that a person had encountered an infected individual; government vaccine approvals and economic recovery fueled by the vaccine; as well as sign up forms to receive the vaccine, information updates, and vaccine shipment delivery.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "In this blog, we provide examples of email-borne attacks spreading malware, phishing, and BEC. These examples exemplify abuse of popular brands such as WHO, DHL, and vaccine manufacturers delivered to users in organizations located in the United States, Canada, Austria, and Germany.", "sentence_right": "### “COVID Vaccine Anticipation Merger and Acquisition” BEC", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "January 14, 2021", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Attackers Use COVID-19 Vaccine Lures to Spread Malware, Phishing and BEC", "sentence_right": "Proofpoint has observed the use of COVID-19 in broad-scale social engineering attacks leading to malware, credential phishing, and BEC since the beginning of the pandemic.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "This campaign is another excellent example of BEC actors picking vaccine lures in an attempt to exploit their targets.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The emails targeted various industries in the United States.", "sentence_right": "This specific email only mentions the COVID-19 vaccine meeting in passing; however, it adds urgency—a common BEC technique—to the follow-up request: \"Please give me your personal number?\".", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "These emails targeted various personnel in roles such as Vice President, General Manager, and Managing Director.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "From December 1 to December 15, 2020, Proofpoint observed a large BEC campaign (thousands of emails) spoofing executives and attempting to elicit the recipient's support in a bogus merger and/or acquisition.", "sentence_right": "The emails were primarily sent to companies in the United States.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "![image-20210127001410-7](/sites/default/files/inline-images/image-20210127001410-7.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "### DHL Themed Phishing", "sentence_right": "*Figure 6: A screenshot of an email purporting to inform the recipient about an undelivered DHL vaccine package*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "*Figure 4: Email screenshot of the malicious email asking the recipient for their personal information*", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![image-20210127001337-5](/sites/default/files/inline-images/image-20210127001337-5.png)", "sentence_right": "On January 11, Proofpoint researchers observed another small (under 100 emails) BEC email campaign.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "The emails urged the potential victims to click a link to \"go online to submit your correct address so we can deliver your package today\".", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "On January 14, 2021, Proofpoint researchers observed a medium-sized (hundreds of messages) campaign targeting dozens of different industries in the United States, Germany, and Austria.", "sentence_right": "The goal of this phishing campaign was to steal email login credentials (email address and password).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Specifically, the email talks about \"Government approval of the COVID-19 vaccine\" and provides a link where one can supposedly register to receive it.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "This campaign was notable because it capitalized on the recent government approval of vaccines and the rush to receive it.", "sentence_right": "At the time of this campaign, the vaccine in the United States was still available to first responders and doctors on the front lines.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Attackers Use COVID-19 Vaccine Lures to Spread Malware, Phishing and BEC", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "", "sentence_right": "January 14, 2021", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "### AgentTesla Malware", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "This attempts to increase the stress by giving the recipient less time to think about their response and allowing the attacker to pivot outside of a protected ecosystem.", "sentence_right": "![image-20210127001354-6](/sites/default/files/inline-images/image-20210127001354-6.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "These emails projected that COVID-19 vaccines would fuel the world's economic recovery.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The emails were primarily sent to companies in the United States.", "sentence_right": "The email purported to be from an executive asking the recipient for their cooperation in a confidential acquisition of a foreign company.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "It claimed that this is an opportune moment to make the acquisition as in the \"midst of every crisis lies a great opportunity.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The email purported to be from an executive asking the recipient for their cooperation in a confidential acquisition of a foreign company.", "sentence_right": "### Office 365 Phishing", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "The email purported to be from an executive asking the recipient for their cooperation in a confidential acquisition of a foreign company.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "These emails projected that COVID-19 vaccines would fuel the world's economic recovery.", "sentence_right": "It claimed that this is an opportune moment to make the acquisition as in the \"midst of every crisis lies a great opportunity.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Example subjects included:", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Other emails did not mention specific brands.", "sentence_right": "* [Vaccine manufacturer] COVID\\_19 Vaccine", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "*Figure 3: Phishing landing page with a red button asking users to “Login with office 365”*", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![image-20210127001317-4](/sites/default/files/inline-images/image-20210127001317-4.png)", "sentence_right": "In this medium-sized campaign (hundreds of messages), threat actors began delivering messages on January 1, 2021, over four days, targeting dozens of different industries in United States and Canada.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "This executable, if run by the user, drops and runs the AgentTesla keylogger.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The email contained an attachment, \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.iso\" which included an embedded executable file named \"DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.exe\".", "sentence_right": "This campaign is notable due to the subject, \"COVID-19 APPROVED NEW VACCINES\", in the email lure and abuse of the World Health Organization logo and name.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "| **IOC** | **IOC Type** | **Description** |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "### Indicators of Compromise (IOCs)", "sentence_right": "| bf78ad88ad9124adde7b3fdfb867b5e848d042ae56acbb75bcfd71962c6a5fd8  | SHA256  | DOWNLOAD-NEW VACCINES-COVID-19-REPORT-SAFETY1.xlsx.iso  |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "The goal of this phishing campaign was to steal Office 365 login credentials (email and password).", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The emails urged the potential victims to click a link to \"confirm their email to receive the vaccine\".", "sentence_right": "This campaign was notable because it capitalized on the recent government approval of vaccines and the rush to receive it.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "* 40 Million COVID-19 Vaccine Dose Supply", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* [Vaccine manufacturer] COVID\\_19 Vaccine", "sentence_right": "* COVID-19 Vaccine", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "### Office 365 Phishing", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "It claimed that this is an opportune moment to make the acquisition as in the \"midst of every crisis lies a great opportunity.", "sentence_right": "![image-20210127001257-3](/sites/default/files/inline-images/image-20210127001257-3.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "Other emails did not mention specific brands.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The campaign also abused the brands of COVID-19 vaccine manufacturers as the lure in some of the emails.", "sentence_right": "Example subjects included:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "This specific email only mentions the COVID-19 vaccine meeting in passing; however, it adds urgency—a common BEC technique—to the follow-up request: \"Please give me your personal number?\".", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "This campaign is another excellent example of BEC actors picking vaccine lures in an attempt to exploit their targets.", "sentence_right": "This attempts to increase the stress by giving the recipient less time to think about their response and allowing the attacker to pivot outside of a protected ecosystem.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "![image-20210127001147-1](/sites/default/files/inline-images/image-20210127001147-1.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "### “COVID Vaccine Anticipation Merger and Acquisition” BEC", "sentence_right": "*Figure 1: A malicious email purporting to be from an executive and asking the recipient for their cooperation in a confidential acquisition.*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "*Figure 2: Email screenshot of the malicious email with an Office 365 phishing URL*", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![image-20210127001257-3](/sites/default/files/inline-images/image-20210127001257-3.png)", "sentence_right": "![image-20210127001317-4](/sites/default/files/inline-images/image-20210127001317-4.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "### “Complete a task for me, before I leave for a covid-19 vaccine meeting” BEC", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* COVID-19 Vaccine", "sentence_right": "![image-20210127001337-5](/sites/default/files/inline-images/image-20210127001337-5.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "![image-20210127001317-4](/sites/default/files/inline-images/image-20210127001317-4.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "*Figure 2: Email screenshot of the malicious email with an Office 365 phishing URL*", "sentence_right": "*Figure 3: Phishing landing page with a red button asking users to “Login with office 365”*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}
{"mention": "![image-20210127001354-6](/sites/default/files/inline-images/image-20210127001354-6.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "### AgentTesla Malware", "sentence_right": "*Figure 5: Agent Tesla abuses World Health Organization Brand*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-01-14_attackers-use-covid-19-vaccine"}