{"mention": "Twitter", "context_left": "On Jan 29th, 2021, a", "context_right": "user, \"[TheAnalyst](https://twitter.com/ffforward/status/1355110538410340353)\", shared a sample which caught our attention after [being notified](https://twitter.com/c3rb3ru5d3d53c/status/1355305724704944129) it triggered an Emerging Threats Network Intrusion Detection System (NIDS) rule.", "_context_left": "On Jan 29th, 2021, a ", "_context_right": " user, \"[TheAnalyst](https://twitter.com/ffforward/status/1355110538410340353)\", shared a sample which caught our attention after [being notified](https://twitter.com/c3rb3ru5d3d53c/status/1355305724704944129) it triggered an Emerging Threats Network Intrusion Detection System (NIDS) rule.", "sentence_left": "**Overview**", "sentence_right": "A quick triage of the sample found overlap with [malware](https://www.proofpoint.com/us/threat-reference/malware) tracked internally as CopperStealer.", "label": "Twitter, Inc. is an American communications company based in San Francisco, California. The company operates the microblogging and social networking service Twitter. It previously operated the Vine short video app and Periscope livestreaming service. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006 and launched in July of that year. By 2012, more than 100 million users posted 340 million tweets a day, and the service handled an average of 1.6 billion search queries per day. The company went public in November 2013. By the start of 2019, Twitter had more than 330 million monthly active users.On April 25, 2022, the Twitter board of directors agreed to a $44 billion buyout by Elon Musk, the CEO of SpaceX and Tesla, potentially making it one of the biggest deals to turn a company private. On July 8, 2022, Musk terminated the deal. As a result, Twitter shares experienced a fall and the company hired a US law firm to take legal action against Musk, launching a lawsuit against him in the Chancery Court of Delaware on July 12.", "label_id": 5903530, "label_title": "Twitter, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=41289288", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "This external interest caused", "context_right": "researchers to investigate further, eventually leading to coordinated disruptive actions by Facebook, Cloudflare, and other service providers.", "_context_left": "This external interest caused ", "_context_right": " researchers to investigate further, eventually leading to coordinated disruptive actions by Facebook, Cloudflare, and other service providers.", "sentence_left": "A quick triage of the sample found overlap with [malware](https://www.proofpoint.com/us/threat-reference/malware) tracked internally as CopperStealer.", "sentence_right": "Our investigation uncovered an actively developed password and cookie stealer with a downloader function, capable of delivering additional malware after performing stealer activity.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "This external interest caused Proofpoint researchers to investigate further, eventually leading to coordinated disruptive actions by", "context_right": ", Cloudflare, and other service providers.", "_context_left": "This external interest caused Proofpoint researchers to investigate further, eventually leading to coordinated disruptive actions by ", "_context_right": ", Cloudflare, and other service providers.", "sentence_left": "A quick triage of the sample found overlap with [malware](https://www.proofpoint.com/us/threat-reference/malware) tracked internally as CopperStealer.", "sentence_right": "Our investigation uncovered an actively developed password and cookie stealer with a downloader function, capable of delivering additional malware after performing stealer activity.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Cloudflare", "context_left": "This external interest caused Proofpoint researchers to investigate further, eventually leading to coordinated disruptive actions by Facebook,", "context_right": ", and other service providers.", "_context_left": "This external interest caused Proofpoint researchers to investigate further, eventually leading to coordinated disruptive actions by Facebook, ", "_context_right": ", and other service providers.", "sentence_left": "A quick triage of the sample found overlap with [malware](https://www.proofpoint.com/us/threat-reference/malware) tracked internally as CopperStealer.", "sentence_right": "Our investigation uncovered an actively developed password and cookie stealer with a downloader function, capable of delivering additional malware after performing stealer activity.", "label": "Cloudflare, Inc. is a U.S. company that provides content delivery network services, DDoS mitigation, Internet security and distributed domain name server services. Cloudflare's services sit between the visitor and the Cloudflare user's hosting provider, acting as a reverse proxy for websites. Cloudflare's headquarters are in San Francisco, California, with additional offices in Lisbon, London, Singapore, Munich, San Jose, Champaign, Austin, New York and Washington, D.C.", "label_id": 3587910, "label_title": "Cloudflare", "label_link": "https://en.wikipedia.org/wiki?curid=32760230", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "While we analyzed a sample that targets", "context_right": "and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "_context_left": "While we analyzed a sample that targets ", "_context_right": " and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Instagram", "context_left": "While we analyzed a sample that targets Facebook and", "context_right": "business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "_context_left": "While we analyzed a sample that targets Facebook and ", "_context_right": " business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Instagram (also known as IG or Insta) is a photo and video-sharing social networking service owned by Facebook, Inc. It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 exclusively on iOS. A version for Android devices was released a year and half later, in April 2012, followed by a feature-limited website interface in November 2012, and apps for Windows 10 Mobile and Windows 10 in April 2016 and October 2016 respectively.  The app allows users to upload photos and videos to the service, which can be edited with various filters, and organized with tags and location information. An account's posts can be shared publicly or with pre-approved followers. Users can browse other users' content by tags and locations, and view trending content. Users can \"like\" photos, and follow other users to add their content to a feed.  The service was originally distinguished by only allowing content to be framed in a square (1:1) aspect ratio, but these restrictions were eased in 2015. The service also added messaging features, the ability to include multiple images or videos in a single post, as well as \"Stories\"—similar to its main competitor Snapchat—which allows users to post photos and videos to a sequential feed, with each post accessible by others for 24 hours each. As of January 2019, the Stories feature is being used by 500 million users daily.  After its launch in 2010, Instagram rapidly gained popularity, with one million registered users in two months, 10 million in a year, and", "label_id": 3489589, "label_title": "Instagram", "label_link": "https://en.wikipedia.org/wiki?curid=31591547", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Apple", "context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including", "context_right": ", Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "_context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including ", "_context_right": ", Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services. It is considered one of the Big Four tech companies along with Amazon, Google, and Facebook.  The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, the AirPods wireless earbuds and the HomePod smart speaker. Apple's software includes the macOS, iOS, iPadOS, watchOS, and tvOS operating systems, the iTunes media player, the Safari web browser, and the iLife and iWork creativity and productivity suites, as well as professional applications like Final Cut Pro, Logic Pro, and Xcode. Its online services include the iTunes Store, the iOS App Store, Mac App Store, Apple Music, Apple TV+, iMessage, and iCloud. Other services include Apple Store, Genius Bar, AppleCare, Apple Pay, Apple Pay Cash, and Apple Card.  Apple was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne in April 1976 to develop and sell Wozniak's Apple I personal computer, though Wayne sold his share back within 12 days. It was incorporated as Apple Computer, Inc., in January 1977, and sales of its computers, including the Apple II, grew quickly. Within a few years, Jobs and Wozniak had hired a staff of computer designers and had a production line. Apple went public in 1980 to instant financial success. Over the next few years, Apple shipped new computers featuring innovative graphical user", "label_id": 140, "label_title": "Apple Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=856", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Amazon", "context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple,", "context_right": ", Bing, Google, PayPal, Tumblr and Twitter.", "_context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, ", "_context_right": ", Bing, Google, PayPal, Tumblr and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Google", "context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing,", "context_right": ", PayPal, Tumblr and Twitter.", "_context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, ", "_context_right": ", PayPal, Tumblr and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Tumblr", "context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal,", "context_right": "and Twitter.", "_context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, ", "_context_right": " and Twitter.", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Tumblr (stylized as tumblr and pronounced \"tumbler\") is a microblogging and social networking website founded by David Karp in 2007 and owned by Verizon Media. The service allows users to post multimedia and other content to a short-form blog. Users can follow other users' blogs. Bloggers can also make their blogs private. For bloggers many of the website's features are accessed from a \"dashboard\" interface.  As of May 5, 2019, Tumblr hosts over 465 million blogs. As of January 2016, the website had 555 million monthly visitors.", "label_id": 2315327, "label_title": "Tumblr", "label_link": "https://en.wikipedia.org/wiki?curid=18701436", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Twitter", "context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and", "context_right": ".", "_context_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and ", "_context_right": ".", "sentence_left": "The earliest discovered samples date back to July of 2019.", "sentence_right": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "label": "Twitter, Inc. is an American communications company based in San Francisco, California. The company operates the microblogging and social networking service Twitter. It previously operated the Vine short video app and Periscope livestreaming service. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006 and launched in July of that year. By 2012, more than 100 million users posted 340 million tweets a day, and the service handled an average of 1.6 billion search queries per day. The company went public in November 2013. By the start of 2019, Twitter had more than 330 million monthly active users.On April 25, 2022, the Twitter board of directors agreed to a $44 billion buyout by Elon Musk, the CEO of SpaceX and Tesla, potentially making it one of the biggest deals to turn a company private. On July 8, 2022, Musk terminated the deal. As a result, Twitter shares experienced a fall and the company hired a US law firm to take legal action against Musk, launching a lawsuit against him in the Chancery Court of Delaware on July 12.", "label_id": 5903530, "label_title": "Twitter, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=41289288", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by", "context_right": "in 2019.", "_context_left": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by ", "_context_right": " in 2019.", "sentence_left": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "sentence_right": "Proofpoint believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "", "context_right": "believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "_context_left": "", "_context_right": " believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "sentence_left": "CopperStealer exhibits many of the same targeting and delivery methods as SilentFade, a Chinese-sourced malware family first reported by Facebook in 2019.", "sentence_right": "Facebook [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to Hong Kong-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s Facebook accounts and then using people’s accounts to run deceptive ads”.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "", "context_right": "[attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to Hong Kong-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s Facebook accounts and then using people’s accounts to run deceptive ads”.", "_context_left": "", "_context_right": " [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to Hong Kong-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s Facebook accounts and then using people’s accounts to run deceptive ads”.", "sentence_left": "Proofpoint believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "sentence_right": "**Distribution Methods**", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Hong Kong", "context_left": "Facebook [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to", "context_right": "-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s Facebook accounts and then using people’s accounts to run deceptive ads”.", "_context_left": "Facebook [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to ", "_context_right": "-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s Facebook accounts and then using people’s accounts to run deceptive ads”.", "sentence_left": "Proofpoint believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "sentence_right": "**Distribution Methods**", "label": "Hong Kong (; , ), officially the Hong Kong Special Administrative Region of the People's Republic of China, is a special administrative region on the eastern side of the Pearl River estuary in southern China. With over 7.4 million people of various nationalities in a territory, Hong Kong is one of the most densely populated places in the world.  Hong Kong became a colony of the British Empire at the end of the First Opium War in 1842. Sovereignty over the territory was transferred to China in 1997. As a special administrative region, Hong Kong maintains governing and economic systems that are separate from those of mainland China. Its people tend to identify as Hongkongers rather than Chinese.  Originally a sparsely populated area of farming and fishing villages, the territory has become one of the world's most significant financial centres and commercial ports. It was estimated to be the world's tenth-largest exporter, ninth-largest importer, and seventh-largest trading entity, and its legal tender (the Hong Kong dollar) is the world's 13th-most traded currency. Hong Kong hosts the largest concentration of ultra high-net-worth individuals of any city in the world. Although the city has one of the highest per capita incomes in the world, there is severe income inequality.  Hong Kong is classified as an alpha+ world city, indicating its influence throughout the world. Hong Kong is one of the most significant global financial centres, holding the highest Financial Development Index score and consistently ranking as the most competitive and freest economic area in", "label_id": 6386, "label_title": "Hong Kong", "label_link": "https://en.wikipedia.org/wiki?curid=13404", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Facebook [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to Hong Kong-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s", "context_right": "accounts and then using people’s accounts to run deceptive ads”.", "_context_left": "Facebook [attributed](https://about.fb.com/news/2019/12/taking-action-against-ad-fraud/) the creation of SilentFade to Hong Kong-based  I Like AD Media International Company Ltd and during the [2020 Virus Bulletin conference](https://vblocalhost.com/uploads/VB2020-Karve-Urgilez.pdf) disclosed it was responsible for over $4 million in damages by “compromising people’s ", "_context_right": " accounts and then using people’s accounts to run deceptive ads”.", "sentence_left": "Proofpoint believes Copperstealer to be a previously undocumented family within the same class of malware as SilentFade, [StressPaint](https://www.radware.com/security/malware/stresspaint-malware-targeting-facebook-credentials), FacebookRobot and [Scranos](https://labs.bitdefender.com/2019/04/inside-scranos-a-cross-platform-rootkit-enabled-spyware-operation/).", "sentence_right": "**Distribution Methods**", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "", "context_right": "researchers observed suspicious websites advertised as “KeyGen” or “Crack” sites, including keygenninja[.]com, piratewares[.]com, startcrack[.]com, and crackheap[.]net, hosting samples that have delivered multiple malware families including CopperStealer.", "_context_left": "", "_context_right": " researchers observed suspicious websites advertised as “KeyGen” or “Crack” sites, including keygenninja[.]com, piratewares[.]com, startcrack[.]com, and crackheap[.]net, hosting samples that have delivered multiple malware families including CopperStealer.", "sentence_left": "**Distribution Methods**", "sentence_right": "These sites advertise themselves to offer “cracks”, “keygen” and “serials” to circumvent licensing restrictions of legitimate software.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "During this investigation,", "context_right": "researchers worked closely with researchers at Facebook, Cloudflare, and other service providers to coordinate disruptive action.", "_context_left": "During this investigation, ", "_context_right": " researchers worked closely with researchers at Facebook, Cloudflare, and other service providers to coordinate disruptive action.", "sentence_left": "**Sinkholing Activity**", "sentence_right": "This included Cloudflare placing a warning interstitial page in front of the malicious domains and establishing a sinkhole for two of the malicious domains before they could be registered by the threat actor.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "During this investigation, Proofpoint researchers worked closely with researchers at", "context_right": ", Cloudflare, and other service providers to coordinate disruptive action.", "_context_left": "During this investigation, Proofpoint researchers worked closely with researchers at ", "_context_right": ", Cloudflare, and other service providers to coordinate disruptive action.", "sentence_left": "**Sinkholing Activity**", "sentence_right": "This included Cloudflare placing a warning interstitial page in front of the malicious domains and establishing a sinkhole for two of the malicious domains before they could be registered by the threat actor.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Cloudflare", "context_left": "During this investigation, Proofpoint researchers worked closely with researchers at Facebook,", "context_right": ", and other service providers to coordinate disruptive action.", "_context_left": "During this investigation, Proofpoint researchers worked closely with researchers at Facebook, ", "_context_right": ", and other service providers to coordinate disruptive action.", "sentence_left": "**Sinkholing Activity**", "sentence_right": "This included Cloudflare placing a warning interstitial page in front of the malicious domains and establishing a sinkhole for two of the malicious domains before they could be registered by the threat actor.", "label": "Cloudflare, Inc. is a U.S. company that provides content delivery network services, DDoS mitigation, Internet security and distributed domain name server services. Cloudflare's services sit between the visitor and the Cloudflare user's hosting provider, acting as a reverse proxy for websites. Cloudflare's headquarters are in San Francisco, California, with additional offices in Lisbon, London, Singapore, Munich, San Jose, Champaign, Austin, New York and Washington, D.C.", "label_id": 3587910, "label_title": "Cloudflare", "label_link": "https://en.wikipedia.org/wiki?curid=32760230", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Cloudflare", "context_left": "This included", "context_right": "placing a warning interstitial page in front of the malicious domains and establishing a sinkhole for two of the malicious domains before they could be registered by the threat actor.", "_context_left": "This included ", "_context_right": " placing a warning interstitial page in front of the malicious domains and establishing a sinkhole for two of the malicious domains before they could be registered by the threat actor.", "sentence_left": "During this investigation, Proofpoint researchers worked closely with researchers at Facebook, Cloudflare, and other service providers to coordinate disruptive action.", "sentence_right": "This sinkhole, a method of concurrently limiting the actor’s ability to collect victim data while enabling researchers to gain visibility into victim demographics, provided valuable insight into the malware’s behavior and scope.", "label": "Cloudflare, Inc. is a U.S. company that provides content delivery network services, DDoS mitigation, Internet security and distributed domain name server services. Cloudflare's services sit between the visitor and the Cloudflare user's hosting provider, acting as a reverse proxy for websites. Cloudflare's headquarters are in San Francisco, California, with additional offices in Lisbon, London, Singapore, Munich, San Jose, Champaign, Austin, New York and Washington, D.C.", "label_id": 3587910, "label_title": "Cloudflare", "label_link": "https://en.wikipedia.org/wiki?curid=32760230", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "India", "context_left": "The top five countries based on unique infections were", "context_right": ", Indonesia, Brazil, Pakistan and The Philippines.", "_context_left": "The top five countries based on unique infections were ", "_context_right": ", Indonesia, Brazil, Pakistan and The Philippines.", "sentence_left": "In the first 24 hours of operation, the sinkhole logged 69,992 HTTP Requests from 5,046 unique IP addresses originating from 159 countries representing 4,655 unique infections.", "sentence_right": "After approximately 28 hours of operating the sinkhole, the amount of traffic declined sharply.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Indonesia", "context_left": "The top five countries based on unique infections were India,", "context_right": ", Brazil, Pakistan and The Philippines.", "_context_left": "The top five countries based on unique infections were India, ", "_context_right": ", Brazil, Pakistan and The Philippines.", "sentence_left": "In the first 24 hours of operation, the sinkhole logged 69,992 HTTP Requests from 5,046 unique IP addresses originating from 159 countries representing 4,655 unique infections.", "sentence_right": "After approximately 28 hours of operating the sinkhole, the amount of traffic declined sharply.", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Brazil", "context_left": "The top five countries based on unique infections were India, Indonesia,", "context_right": ", Pakistan and The Philippines.", "_context_left": "The top five countries based on unique infections were India, Indonesia, ", "_context_right": ", Pakistan and The Philippines.", "sentence_left": "In the first 24 hours of operation, the sinkhole logged 69,992 HTTP Requests from 5,046 unique IP addresses originating from 159 countries representing 4,655 unique infections.", "sentence_right": "After approximately 28 hours of operating the sinkhole, the amount of traffic declined sharply.", "label": "Brazil (; ), officially the Federative Republic of Brazil (, ), is the largest country in both South America and Latin America. At 8.5 million square kilometers (3.2 million square miles) and with over 208 million people, Brazil is the world's fifth-largest country by area and the fifth most populous. Its capital is Brasilia, and its most populated city is Sao Paulo. The federation is composed of the union of the 26 states, the Federal District, and the 5,570 municipalities. It is the largest country to have Portuguese as an official language and the only one in the Americas; it is also one of the most multicultural and ethnically diverse nations, due to over a century of mass immigration from around the world.  Bounded by the Atlantic Ocean on the east, Brazil has a coastline of . It borders all other South American countries except Ecuador and Chile and covers 47.3% of the continent's land area. Its Amazon River basin includes a vast tropical forest, home to diverse wildlife, a variety of ecological systems, and extensive natural resources spanning numerous protected habitats. This unique environmental heritage makes Brazil one of 17 megadiverse countries, and is the subject of significant global interest and debate regarding deforestation and environmental protection.  Brazil was inhabited by numerous tribal nations prior to the landing in 1500 of explorer Pedro Alvares Cabral, who claimed the area for the Portuguese Empire. Brazil remained a Portuguese colony until 1808, when the capital of the empire was transferred from Lisbon to Rio de Janeiro.", "label_id": 1439, "label_title": "Brazil", "label_link": "https://en.wikipedia.org/wiki?curid=3383", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Pakistan", "context_left": "The top five countries based on unique infections were India, Indonesia, Brazil,", "context_right": "and The Philippines.", "_context_left": "The top five countries based on unique infections were India, Indonesia, Brazil, ", "_context_right": " and The Philippines.", "sentence_left": "In the first 24 hours of operation, the sinkhole logged 69,992 HTTP Requests from 5,046 unique IP addresses originating from 159 countries representing 4,655 unique infections.", "sentence_right": "After approximately 28 hours of operating the sinkhole, the amount of traffic declined sharply.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Philippines", "context_left": "The top five countries based on unique infections were India, Indonesia, Brazil, Pakistan and The", "context_right": ".", "_context_left": "The top five countries based on unique infections were India, Indonesia, Brazil, Pakistan and The ", "_context_right": ".", "sentence_left": "In the first 24 hours of operation, the sinkhole logged 69,992 HTTP Requests from 5,046 unique IP addresses originating from 159 countries representing 4,655 unique infections.", "sentence_right": "After approximately 28 hours of operating the sinkhole, the amount of traffic declined sharply.", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "Since November 2019,", "context_right": "and Emerging Threats have identified this threat as ‘CopperStealer’ and have tracked it internally since then, as well as in [ETPRO signatures](https://www.proofpoint.com/us/daily-ruleset-update-summary-20191114).", "_context_left": "Since November 2019, ", "_context_right": " and Emerging Threats have identified this threat as ‘CopperStealer’ and have tracked it internally since then, as well as in [ETPRO signatures](https://www.proofpoint.com/us/daily-ruleset-update-summary-20191114).", "sentence_left": "**Naming**", "sentence_right": "This name originates from observed PDB and process memory strings referencing 'DavidCopperfield' (Figure 2).", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "ESET", "context_left": "In January 2021, after [other researchers](https://twitter.com/JAMESWT_MHT/status/1355432089378811904) had shown interest in this malware,", "context_right": "created specific anti-virus detection for this threat under the name [‘Mingloa’](https://www.virustotal.com/gui/search/eset_nod32%253AWin32%252FMingloa/files); however, Proofpoint continues to refer to this as CopperStealer.", "_context_left": "In January 2021, after [other researchers](https://twitter.com/JAMESWT_MHT/status/1355432089378811904) had shown interest in this malware, ", "_context_right": " created specific anti-virus detection for this threat under the name [‘Mingloa’](https://www.virustotal.com/gui/search/eset_nod32%253AWin32%252FMingloa/files); however, Proofpoint continues to refer to this as CopperStealer.", "sentence_left": "This name originates from observed PDB and process memory strings referencing 'DavidCopperfield' (Figure 2).", "sentence_right": "![Cooperstealer_2](/sites/default/files/inline-images/Cooperstealer_2.png)", "label": "ESET is an IT security company that offers anti-virus and firewall products such as ESET NOD32. ESET is headquartered in Bratislava, Slovakia, and was awarded the recognition of the most successful Slovak company in 2008, 2009 and in 2010. It plays a significant role in overall Cybersecurity.", "label_id": 227795, "label_title": "ESET", "label_link": "https://en.wikipedia.org/wiki?curid=590228", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "In January 2021, after [other researchers](https://twitter.com/JAMESWT_MHT/status/1355432089378811904) had shown interest in this malware, ESET created specific anti-virus detection for this threat under the name [‘Mingloa’](https://www.virustotal.com/gui/search/eset_nod32%253AWin32%252FMingloa/files); however,", "context_right": "continues to refer to this as CopperStealer.", "_context_left": "In January 2021, after [other researchers](https://twitter.com/JAMESWT_MHT/status/1355432089378811904) had shown interest in this malware, ESET created specific anti-virus detection for this threat under the name [‘Mingloa’](https://www.virustotal.com/gui/search/eset_nod32%253AWin32%252FMingloa/files); however, ", "_context_right": " continues to refer to this as CopperStealer.", "sentence_left": "This name originates from observed PDB and process memory strings referencing 'DavidCopperfield' (Figure 2).", "sentence_right": "![Cooperstealer_2](/sites/default/files/inline-images/Cooperstealer_2.png)", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "**", "context_right": "and Instagram Data Retrieval**", "_context_left": "**", "_context_right": " and Instagram Data Retrieval**", "sentence_left": "+ vbox", "sentence_right": "The malware contains the ability to find and send saved browser passwords.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "The following Internet browsers are searched specifically for", "context_right": "saved credentials:", "_context_left": "The following Internet browsers are searched specifically for ", "_context_right": " saved credentials:", "sentence_left": "The malware contains the ability to find and send saved browser passwords.", "sentence_right": "* Chrome", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Yandex", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Edge", "sentence_right": "* Opera", "label": "Yandex N.V. (; ) is a Russian multinational corporation specializing in Internet-related products and services, including search and information services, eCommerce, transportation, navigation, mobile applications, and online advertising. Yandex provides over 70 services in total. Incorporated in the Netherlands, Yandex primarily serves audiences in Russia and the Commonwealth of Independent States. The company founders and most of the team members are located in Russia. The company has 18 commercial offices worldwide.  It is the largest technology company in Russia and the largest search engine on the internet in Russian, with a market share of over 52%. The Yandex.ru home page is the 4th most popular website in Russia. It also has the largest market share of any search engine in the Commonwealth of Independent States and is the 5th largest search engine worldwide after Google, Baidu, Bing, and Yahoo!.  Yandex's main competitors on the Russian market are Google, Mail.ru, and Rambler.  According to the company, one of its biggest advantages for Russian-language users is the ability to recognize Russian inflection in search queries.  Yandex has invested in companies including Vizi Labs, Face.com, Blekko, Seismotech, Multiship, SalesPredict, and Doc+.", "label_id": 732786, "label_title": "Yandex", "label_link": "https://en.wikipedia.org/wiki?curid=3099107", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Opera", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Yandex", "sentence_right": "* Firefox", "label": "Opera Software AS is a Norwegian software company, primarily known for its desktop Opera web browser, and mobile web browser Opera Mini. It was demerged from its parent company Otello Corporation as part of the latter's divestiture of its web browser business. Opera browsers have more than 350 million users worldwide across multiple platforms.  Opera is also involved in promoting Web standards through participation in the W3C. The company has its headquarters in Oslo, Norway and also has offices in Sweden, Poland, China, Japan, South Korea, Australia, Russia, Ukraine, Iceland, Singapore, Taiwan and the United States.  The company changed ownership when Otello (at the time \"Opera Software ASA\") sold its web browser and consumer businesses along with the \"Opera\" brand to a Chinese group of investors in 2016 with the deal completing in November of that year.  On July 27, 2018, Opera Software went public on the NASDAQ stock exchange, raising $115 million in its initial public offering.", "label_id": 214151, "label_title": "Opera Software", "label_link": "https://en.wikipedia.org/wiki?curid=538484", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "In addition to the saved browser passwords, the malware uses stored cookies to retrieve a User Access Token from", "context_right": ".", "_context_left": "In addition to the saved browser passwords, the malware uses stored cookies to retrieve a User Access Token from ", "_context_right": ".", "sentence_left": "* Firefox", "sentence_right": "Once the User Access Token is gathered, the malware requests several API endpoints for Facebook and Instagram to gather additional context, including a list of friends, any advertisement accounts configured for the user and a list of pages the user has been granted access (Figure 3).", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Once the User Access Token is gathered, the malware requests several API endpoints for", "context_right": "and Instagram to gather additional context, including a list of friends, any advertisement accounts configured for the user and a list of pages the user has been granted access (Figure 3).", "_context_left": "Once the User Access Token is gathered, the malware requests several API endpoints for ", "_context_right": " and Instagram to gather additional context, including a list of friends, any advertisement accounts configured for the user and a list of pages the user has been granted access (Figure 3).", "sentence_left": "In addition to the saved browser passwords, the malware uses stored cookies to retrieve a User Access Token from Facebook.", "sentence_right": "![Cooperstealer_3](/sites/default/files/inline-images/Cooperstealer_3.png)", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Figure 3: The", "context_right": "and Instagram requests generated by the malware", "_context_left": "Figure 3: The ", "_context_right": " and Instagram requests generated by the malware", "sentence_left": "![Cooperstealer_3](/sites/default/files/inline-images/Cooperstealer_3.png)", "sentence_right": "All requests created from the analyzed sample contain a static Accept-Language header of \"ko-KR,ko;q=0.9,en-US;q=0.8,en;q=0.7\".", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Figure 4: The malware sending a request using stolen cookies to gather additional information of the victim", "context_right": "account.", "_context_left": "Figure 4: The malware sending a request using stolen cookies to gather additional information of the victim ", "_context_right": " account.", "sentence_left": "![Cooperstealer_4](/sites/default/files/inline-images/Cooperstealer_4.png)", "sentence_right": "**Downloader Function**", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Xunlei Networking Technologies, LTD", "context_left": "The executed binary appears to be a legitimate download manager called Xunlei created by", "context_right": ", that while legitimate, was previously identified being bundled with malware in 2013 [reported by ESET](https://www.welivesecurity.com/2013/10/11/win32kankan-chinese-drama/).", "_context_left": "The executed binary appears to be a legitimate download manager called Xunlei created by ", "_context_right": ", that while legitimate, was previously identified being bundled with malware in 2013 [reported by ESET](https://www.welivesecurity.com/2013/10/11/win32kankan-chinese-drama/).", "sentence_left": "*C:\\Users\\<redacted>\\AppData\\Local\\Temp\\download\\ThunderFW.exe ThunderFW \"C:\\Users\\<redacted>\\AppData\\Local\\Temp\\download\\MiniThunderPlatform.exe\"*", "sentence_right": "CopperStealer uses an API exposed from the Xunlei application in order to download the configuration for the follow-up binary.", "label": "Xunlei Limited () is a Chinese multinational technology company and an online service provider founded in 2003. The subsidiary of Xunlei Limited, Shenzhen Xunlei Networking Technologies, Co., Ltd. () was formerly known as Sandai Technologies (Shenzhen) Inc. and changed its name to Shenzhen Xunlei Networking Technologies, Co., Ltd. in May 2005. In April 2014, Xunlei received an investment from a Chinese electronics company Xiaomi of $200 million. On 24 June 2014, it went public on the Nasdaq Stock Exchange, selling 7.315 million American depositary shares (ADS) at $12 and raising just shy of $88 million. According to the annual ranking of China's top 100 internet companies released by Ministry of Industry and Information Technology of the Chinese government, Xunlei occupied 42nd place in 2017's ranking.  The main products developed by Xunlei Limited is the Xunlei download manager and Peer-to-peer software, supporting HTTP, FTP, eDonkey, and BitTorrent protocols. , it was the most commonly used BitTorrent client in the world. In October 2017, the company announced that it will transform itself into a blockchain company, and release a blockchain-based product named OneThing Cloud. OneThing Cloud users get LinkToken(one kind of virtual token) for contributing their bandwidth to the Xunlei's Content Delivery Network.  Xunlei Ltd. announced that its board of directors has appointed Mr. Lei Chen, who is a former Tencent cloud computing unit leader, as its Chief Executive Officer of the Company and Director of the Board on June 29, 2017. On December 12, 2017, Xunlei announced that the board of directors of the", "label_id": 1552340, "label_title": "Xunlei", "label_link": "https://en.wikipedia.org/wiki?curid=10481704", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "ESET", "context_left": "The executed binary appears to be a legitimate download manager called Xunlei created by Xunlei Networking Technologies, LTD, that while legitimate, was previously identified being bundled with malware in 2013 [reported by", "context_right": "](https://www.welivesecurity.com/2013/10/11/win32kankan-chinese-drama/).", "_context_left": "The executed binary appears to be a legitimate download manager called Xunlei created by Xunlei Networking Technologies, LTD, that while legitimate, was previously identified being bundled with malware in 2013 [reported by ", "_context_right": "](https://www.welivesecurity.com/2013/10/11/win32kankan-chinese-drama/).", "sentence_left": "*C:\\Users\\<redacted>\\AppData\\Local\\Temp\\download\\ThunderFW.exe ThunderFW \"C:\\Users\\<redacted>\\AppData\\Local\\Temp\\download\\MiniThunderPlatform.exe\"*", "sentence_right": "CopperStealer uses an API exposed from the Xunlei application in order to download the configuration for the follow-up binary.", "label": "ESET is an IT security company that offers anti-virus and firewall products such as ESET NOD32. ESET is headquartered in Bratislava, Slovakia, and was awarded the recognition of the most successful Slovak company in 2008, 2009 and in 2010. It plays a significant role in overall Cybersecurity.", "label_id": 227795, "label_title": "ESET", "label_link": "https://en.wikipedia.org/wiki?curid=590228", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "During investigation into various CopperStealer samples", "context_right": "researchers discovered two distinct DGA methods in use, which are detailed below.", "_context_left": "During investigation into various CopperStealer samples ", "_context_right": " researchers discovered two distinct DGA methods in use, which are detailed below.", "sentence_left": "This malware uses HTTP in order to communicate with C2 servers which are generated using a Domain Generation Algorithm (DGA).", "sentence_right": "While the use of TLS has been observed in more recent samples, most communication does not make use of TLS.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Twitter", "context_left": "Initially reported by [\"Johann Aydinbas\" on", "context_right": "](https://twitter.com/jaydinbas/status/1355193203725643780) the malware uses a Domain Generation Algorithm (DGA) in order to generate new command and control servers on a daily basis.", "_context_left": "Initially reported by [\"Johann Aydinbas\" on ", "_context_right": "](https://twitter.com/jaydinbas/status/1355193203725643780) the malware uses a Domain Generation Algorithm (DGA) in order to generate new command and control servers on a daily basis.", "sentence_left": "**Domain Generation Algorithm**", "sentence_right": "A [Python3 script](https://github.com/EmergingThreats/threatresearch/tree/master/copperstealer) is publicly available to generate all domains for the observed DGA methods.", "label": "Twitter, Inc. is an American communications company based in San Francisco, California. The company operates the microblogging and social networking service Twitter. It previously operated the Vine short video app and Periscope livestreaming service. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006 and launched in July of that year. By 2012, more than 100 million users posted 340 million tweets a day, and the service handled an average of 1.6 billion search queries per day. The company went public in November 2013. By the start of 2019, Twitter had more than 330 million monthly active users.On April 25, 2022, the Twitter board of directors agreed to a $44 billion buyout by Elon Musk, the CEO of SpaceX and Tesla, potentially making it one of the biggest deals to turn a company private. On July 8, 2022, Musk terminated the deal. As a result, Twitter shares experienced a fall and the company hired a US law firm to take legal action against Musk, launching a lawsuit against him in the Chancery Court of Delaware on July 12.", "label_id": 5903530, "label_title": "Twitter, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=41289288", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Figure 11:", "context_right": "Data exfiltrated to the C2 server via “/info/fb”", "_context_left": "Figure 11: ", "_context_right": " Data exfiltrated to the C2 server via “/info/fb”", "sentence_left": "![Cooperstealer_11](/sites/default/files/inline-images/Cooperstealer_11.png)", "sentence_right": "![Cooperstealer_12](/sites/default/files/inline-images/Cooperstealer_12.png)", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Figure 12:  The decrypted", "context_right": "data sent to the C2 server.", "_context_left": "Figure 12:  The decrypted ", "_context_right": " data sent to the C2 server.", "sentence_left": "![Cooperstealer_12](/sites/default/files/inline-images/Cooperstealer_12.png)", "sentence_right": "The ads\\_info key contains a modified base64 encoded string (not encrypted) which decodes to a json string with information of any setup ad accounts (Figure 13).", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "", "context_right": "has observed rapid development most recently finding Version 52 first observed on March 5, 2021.", "_context_left": "", "_context_right": " has observed rapid development most recently finding Version 52 first observed on March 5, 2021.", "sentence_left": "The first observed sample using the DGA method is associated with Version 10 of the malware.", "sentence_right": "**Seed Changes**", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "While the analyzed sample targets", "context_right": "and Instagram, network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "_context_left": "While the analyzed sample targets ", "_context_right": " and Instagram, network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "sentence_left": "**Target Variation**", "sentence_right": "| **Version** | **Sample SHA256** | **Target Service Provider** |", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Instagram", "context_left": "While the analyzed sample targets Facebook and", "context_right": ", network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "_context_left": "While the analyzed sample targets Facebook and ", "_context_right": ", network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "sentence_left": "**Target Variation**", "sentence_right": "| **Version** | **Sample SHA256** | **Target Service Provider** |", "label": "Instagram (also known as IG or Insta) is a photo and video-sharing social networking service owned by Facebook, Inc. It was created by Kevin Systrom and Mike Krieger, and launched in October 2010 exclusively on iOS. A version for Android devices was released a year and half later, in April 2012, followed by a feature-limited website interface in November 2012, and apps for Windows 10 Mobile and Windows 10 in April 2016 and October 2016 respectively.  The app allows users to upload photos and videos to the service, which can be edited with various filters, and organized with tags and location information. An account's posts can be shared publicly or with pre-approved followers. Users can browse other users' content by tags and locations, and view trending content. Users can \"like\" photos, and follow other users to add their content to a feed.  The service was originally distinguished by only allowing content to be framed in a square (1:1) aspect ratio, but these restrictions were eased in 2015. The service also added messaging features, the ability to include multiple images or videos in a single post, as well as \"Stories\"—similar to its main competitor Snapchat—which allows users to post photos and videos to a sequential feed, with each post accessible by others for 24 hours each. As of January 2019, the Stories feature is being used by 500 million users daily.  After its launch in 2010, Instagram rapidly gained popularity, with one million registered users in two months, 10 million in a year, and", "label_id": 3489589, "label_title": "Instagram", "label_link": "https://en.wikipedia.org/wiki?curid=31591547", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Apple", "context_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing /", "context_right": "/ Paypal |", "_context_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / ", "_context_right": " / Paypal |", "sentence_left": "| **Version** | **Sample SHA256** | **Target Service Provider** |", "sentence_right": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / Google / Facebook |", "label": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services. It is considered one of the Big Four tech companies along with Amazon, Google, and Facebook.  The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, the AirPods wireless earbuds and the HomePod smart speaker. Apple's software includes the macOS, iOS, iPadOS, watchOS, and tvOS operating systems, the iTunes media player, the Safari web browser, and the iLife and iWork creativity and productivity suites, as well as professional applications like Final Cut Pro, Logic Pro, and Xcode. Its online services include the iTunes Store, the iOS App Store, Mac App Store, Apple Music, Apple TV+, iMessage, and iCloud. Other services include Apple Store, Genius Bar, AppleCare, Apple Pay, Apple Pay Cash, and Apple Card.  Apple was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne in April 1976 to develop and sell Wozniak's Apple I personal computer, though Wayne sold his share back within 12 days. It was incorporated as Apple Computer, Inc., in January 1977, and sales of its computers, including the Apple II, grew quickly. Within a few years, Jobs and Wozniak had hired a staff of computer designers and had a production line. Apple went public in 1980 to instant financial success. Over the next few years, Apple shipped new computers featuring innovative graphical user", "label_id": 140, "label_title": "Apple Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=856", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Paypal", "context_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple /", "context_right": "|", "_context_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple / ", "_context_right": " |", "sentence_left": "| **Version** | **Sample SHA256** | **Target Service Provider** |", "sentence_right": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / Google / Facebook |", "label": "PayPal Holdings, Inc. is an American company operating a worldwide online payments system that supports online money transfers and serves as an electronic alternative to traditional paper methods like checks and money orders. The company operates as a payment processor for online vendors, auction sites, and many other commercial users, for which it charges a fee in exchange for benefits such as one-click transactions and password memory. PayPal's payment system, also called PayPal, is considered a type of payment rail.  Established in 1998 as Confinity, PayPal had its initial public offering in 2002, and became a wholly owned subsidiary of eBay later that year. eBay spun off PayPal in 2015. The company ranked 222nd on the 2018 Fortune 500 of the largest United States corporations by revenue.", "label_id": 105612, "label_title": "PayPal", "label_link": "https://en.wikipedia.org/wiki?curid=195809", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Twitter", "context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb |", "context_right": "/ Google / Facebook |", "_context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | ", "_context_right": " / Google / Facebook |", "sentence_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple / Paypal |", "sentence_right": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Google |", "label": "Twitter, Inc. is an American communications company based in San Francisco, California. The company operates the microblogging and social networking service Twitter. It previously operated the Vine short video app and Periscope livestreaming service. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006 and launched in July of that year. By 2012, more than 100 million users posted 340 million tweets a day, and the service handled an average of 1.6 billion search queries per day. The company went public in November 2013. By the start of 2019, Twitter had more than 330 million monthly active users.On April 25, 2022, the Twitter board of directors agreed to a $44 billion buyout by Elon Musk, the CEO of SpaceX and Tesla, potentially making it one of the biggest deals to turn a company private. On July 8, 2022, Musk terminated the deal. As a result, Twitter shares experienced a fall and the company hired a US law firm to take legal action against Musk, launching a lawsuit against him in the Chancery Court of Delaware on July 12.", "label_id": 5903530, "label_title": "Twitter, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=41289288", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Google", "context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter /", "context_right": "/ Facebook |", "_context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / ", "_context_right": " / Facebook |", "sentence_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple / Paypal |", "sentence_right": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Google |", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / Google /", "context_right": "|", "_context_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / Google / ", "_context_right": " |", "sentence_left": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple / Paypal |", "sentence_right": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Google |", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Google", "context_left": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e |", "context_right": "|", "_context_left": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | ", "_context_right": " |", "sentence_left": "| 13 | 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Twitter / Google / Facebook |", "sentence_right": "| 22.4 | 8b4c5372b95dbc8705b82f2223b6086795004b5ad559091f607a43d0b5038595 | Tumblr |", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Tumblr", "context_left": "| 22.4 | 8b4c5372b95dbc8705b82f2223b6086795004b5ad559091f607a43d0b5038595 |", "context_right": "|", "_context_left": "| 22.4 | 8b4c5372b95dbc8705b82f2223b6086795004b5ad559091f607a43d0b5038595 | ", "_context_right": " |", "sentence_left": "| 13 | 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Google |", "sentence_right": "| 46.0.0 | 772062075a6ce77768bd462428eb6554ccaefec146f2f79cf22032614364d800 | Amazon |", "label": "Tumblr (stylized as tumblr and pronounced \"tumbler\") is a microblogging and social networking website founded by David Karp in 2007 and owned by Verizon Media. The service allows users to post multimedia and other content to a short-form blog. Users can follow other users' blogs. Bloggers can also make their blogs private. For bloggers many of the website's features are accessed from a \"dashboard\" interface.  As of May 5, 2019, Tumblr hosts over 465 million blogs. As of January 2016, the website had 555 million monthly visitors.", "label_id": 2315327, "label_title": "Tumblr", "label_link": "https://en.wikipedia.org/wiki?curid=18701436", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Amazon", "context_left": "| 46.0.0 | 772062075a6ce77768bd462428eb6554ccaefec146f2f79cf22032614364d800 |", "context_right": "|", "_context_left": "| 46.0.0 | 772062075a6ce77768bd462428eb6554ccaefec146f2f79cf22032614364d800 | ", "_context_right": " |", "sentence_left": "| 22.4 | 8b4c5372b95dbc8705b82f2223b6086795004b5ad559091f607a43d0b5038595 | Tumblr |", "sentence_right": "| 51.0 | b3681d24634f9b10af333470d1f50404fce978bd78bbe22a283716327cfd48c1 | Google |", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Google", "context_left": "| 51.0 | b3681d24634f9b10af333470d1f50404fce978bd78bbe22a283716327cfd48c1 |", "context_right": "|", "_context_left": "| 51.0 | b3681d24634f9b10af333470d1f50404fce978bd78bbe22a283716327cfd48c1 | ", "_context_right": " |", "sentence_left": "| 46.0.0 | 772062075a6ce77768bd462428eb6554ccaefec146f2f79cf22032614364d800 | Amazon |", "sentence_right": "Table 4: Samples observed targeting other service providers.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "amazon", "context_left": "The response from the C2 server contains an encrypted partial domain name “", "context_right": ".(Figure 17).", "_context_left": "The response from the C2 server contains an encrypted partial domain name “", "_context_right": ".(Figure 17).", "sentence_left": "During a brief dynamic analysis of a Ver 51.0 sample (ed21e90c75aec59d0278efb7107f9253) an HTTP request to “/info/r” is made.", "sentence_right": "The next HTTP request made by the malware is a data exfiltration containing data fields which reference of the amazon URL (Figure 18).", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "amazon", "context_left": "The next HTTP request made by the malware is a data exfiltration containing data fields which reference of the", "context_right": "URL (Figure 18).", "_context_left": "The next HTTP request made by the malware is a data exfiltration containing data fields which reference of the ", "_context_right": " URL (Figure 18).", "sentence_left": "The response from the C2 server contains an encrypted partial domain name “amazon.(Figure 17).", "sentence_right": "![Cooperstealer_17](/sites/default/files/inline-images/Cooperstealer_17.png)", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Amazon", "context_left": "Figure 18:", "context_right": "details exfiltrated to the C2 server.", "_context_left": "Figure 18: ", "_context_right": " details exfiltrated to the C2 server.", "sentence_left": "![Cooperstealer_18](/sites/default/files/inline-images/Cooperstealer_18.png)", "sentence_right": "**Hardcoded Backup C2s**", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Facebook", "context_left": "Previous research from", "context_right": "and Bitdefender has exposed a rapidly increasing ecosystem of Chinese-based malware focused on the monetization of compromised social media and other service accounts.", "_context_left": "Previous research from ", "_context_right": " and Bitdefender has exposed a rapidly increasing ecosystem of Chinese-based malware focused on the monetization of compromised social media and other service accounts.", "sentence_left": "While CopperStealer isn't the most nefarious credential/account stealer in existence, it goes to show that even with basic capabilities, the overall impact can be large.", "sentence_right": "Findings from this investigation point towards CopperStealer being another piece of this everchanging ecosystem.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Chinese", "context_left": "Previous research from Facebook and Bitdefender has exposed a rapidly increasing ecosystem of", "context_right": "-based malware focused on the monetization of compromised social media and other service accounts.", "_context_left": "Previous research from Facebook and Bitdefender has exposed a rapidly increasing ecosystem of ", "_context_right": "-based malware focused on the monetization of compromised social media and other service accounts.", "sentence_left": "While CopperStealer isn't the most nefarious credential/account stealer in existence, it goes to show that even with basic capabilities, the overall impact can be large.", "sentence_right": "Findings from this investigation point towards CopperStealer being another piece of this everchanging ecosystem.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Proofpoint", "context_left": "", "context_right": "threat research would like to thank those in the information security research community who share and provide observations for all to use.", "_context_left": "", "_context_right": " threat research would like to thank those in the information security research community who share and provide observations for all to use.", "sentence_left": "After sinkholing activities helped disrupt CopperStealers current activities, we will continue to monitor the threat landscape to identify and detect future evolutions of this malware.", "sentence_right": "As described earlier in this post, the collaborative efforts granted us the opportunity to proceed further than just creating detections.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 5fa60303a0c4fd13ecd69e7c1a17788b72605473c2fb3f93eb758010326c76e5 | Version 41.4.0 |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| **Indicator** | **Note** |", "sentence_right": "| c8224b778f8d7e73[.]com | February 2021 C2 Server |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 9a3a97f6f45f2c2b[.]com | March 2021 C2 Server |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| a36e971e03d9cbf8[.]com | March 2021 C2 Server |", "sentence_right": "| 768deefde7eecd74[.]com | March 2021 C2 Server |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The malware does make use of several basic anti-analysis techniques to avoid running within researcher systems.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "**Anti-Analysis**", "sentence_right": "* IsDebuggerPresent() check", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The earliest discovered samples date back to July of 2019.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Our investigation uncovered an actively developed password and cookie stealer with a downloader function, capable of delivering additional malware after performing stealer activity.", "sentence_right": "While we analyzed a sample that targets Facebook and Instagram business and advertiser accounts, we also identified additional versions that target other major service providers, including Apple, Amazon, Bing, Google, PayPal, Tumblr and Twitter.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "During a brief dynamic analysis of a Ver 51.0 sample (ed21e90c75aec59d0278efb7107f9253) an HTTP request to “/info/r” is made.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "**Dynamic Cookie Collection**", "sentence_right": "The response from the C2 server contains an encrypted partial domain name “amazon.(Figure 17).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "A [Python3 script](https://github.com/EmergingThreats/threatresearch/tree/master/copperstealer) has been created to decrypt the communications using the observed key and ivs.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Table 2: DES Encryption Keys and IVs for network communication.", "sentence_right": "**Malware Evolution**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Five additional DGA domain variants created by appending the digit “1”, “2”, “3”, “4”, “5” to the concatenated string and contains a single hardcoded backup server (Figure 8).", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The DGA is still based on the middle 16 characters of an MD5 hash of a concatenated string of a “seed” and the current UTC **month** in YYYYMM format.", "sentence_right": "| **C2 string** | **MD5** | **DGA Domain** |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| FrankLin | June 1, 2020 | 3225ce04d0b89652ac6b1f59180eefd41b5a6fdcbabd9066da710cdab462383e  |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| DavidCopperfield | July 26, 2019 | 81202529443a234489720c0030b05d3b5c28fe046a412953e95110699cc9b7cf  |", "sentence_right": "| WebGL | September 22, 2020 | 449973a46282cfbce784d86b42a26a5a259b3f552627986aec57bac4902d3461  |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 844106c92ac5210a[.]com | February 2021 C2 Server |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 574e0f440d5d411d[.]com | February 2021 C2 Server |", "sentence_right": "| 687b318f1a4e0afc[.]com | February 2021 C2 Server |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| e03f2a3c636d458e8122361377ba641b1b7d6b5ff950948820359e5eebed4221 | Installer Leading to CopperStealer |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 81202529443a234489720c0030b05d3b5c28fe046a412953e95110699cc9b7cf | Version 10 |", "sentence_right": "| 729b2cb357db3f9fbca4eff18274c5ce59e4fd18e944c3d36cc7e04f8453a9f6 | Installer Leading to CopperStealer |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The ads\\_info key contains a modified base64 encoded string (not encrypted) which decodes to a json string with information of any setup ad accounts (Figure 13).", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Figure 12:  The decrypted Facebook data sent to the C2 server.", "sentence_right": "![Cooperstealer_13](/sites/default/files/inline-images/Cooperstealer_13.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| c9d92e36006663f53a01a14800389bd29f3266f00727cce1f39862cceccc50b0 | Dropped Smokeloader |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 9f9ec27591faea47ca6c72cf26911d932a2a7efe20fdd1a6df8ea82e226fbf38 | Dropped Smokeloader |", "sentence_right": "| bb5d2c07ce902c78227325bf5f336c04335874445fc0635a6b67ae5ba9d2fefc | Dropped Smokeloader |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| hellojackma | February 8, 2021 | f9188822ce06ba4017508737fd6304babaee4832cfb94803b7ef83e0de9d5327  |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| changenewsys | January 13, 2021 | 10bb601f27c0aae7fb9cc88a45434a8dcd759c03698c00b322f8b7f78ed64164  |", "sentence_right": "| hellojackma | February 21, 2021 | 1edec40732a728195ffea9946dd65ede6072c3c5061cfa3cc6e7cf6b7769052c |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* changenewsys", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* exchangework", "sentence_right": "* hellojackma", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| hxxps://startcrack[.]com/adobe-photoshop-cc-2021-crack-updated/ | Installer Leading to CopperStealer |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| hxxps://piratewares[.]com/allavsoft-downloader-converter-keygen/ | Installer Leading to CopperStealer |", "sentence_right": "| hxxps://keygenninja[.]com/serial/gta\\_4\\_all.html | Installer Leading to CopperStealer |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Version 13 |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Version 13 |", "sentence_right": "| 81202529443a234489720c0030b05d3b5c28fe046a412953e95110699cc9b7cf | Version 10 |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* guid", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Reverse engineering indicated Instagram data is exfiltrated via POST requests to \"/info/ins\" with the following keys:", "sentence_right": "* ver", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "border: 1px solid #000 !important;", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": ".node-blog-full .blog-content img {", "sentence_right": "}", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "![Cooperstealer_14](/sites/default/files/inline-images/Cooperstealer_14.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* regok", "sentence_right": "Figure 14: Downloader status update being send to the C2 server.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "**Target Variation**", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Figure 16: Network Traffic from Version 46.0.0", "sentence_right": "While the analyzed sample targets Facebook and Instagram, network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* ver", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* guid", "sentence_right": "* seller", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "**Seed Changes**", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Proofpoint has observed rapid development most recently finding Version 52 first observed on March 5, 2021.", "sentence_right": "| **Seed** | **First Observed** | **Sample SHA256** |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "![Cooperstealer_1](/sites/default/files/inline-images/Cooperstealer_1.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "However, we observed these sites ultimately provide Potentially Unwanted Programs/Applications (PUP/PUA) or run other malicious executables capable of installing and downloading additional payloads (Figure 1).", "sentence_right": "*Figure 1: A “cracked” application being hosted which dropped CopperStealer.*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "ET MALWARE Win32/CopperStealer CnC Activity M2 - 2031926", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "**Emerging Threats Signatures**", "sentence_right": "ET MALWARE Win32/CopperStealer CnC Activity M3 - 2031927", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| WebGL | September 22, 2020 | 449973a46282cfbce784d86b42a26a5a259b3f552627986aec57bac4902d3461  |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| FrankLin | June 1, 2020 | 3225ce04d0b89652ac6b1f59180eefd41b5a6fdcbabd9066da710cdab462383e  |", "sentence_right": "| Vindiesel | December 8, 2020 | daa6931054a125d49f43537a7c07a3bfad8854e18c0c25b49ad7808040f92bb8  |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "These status updates messages are sent using the same encryption method as other messages via a POST requests to \"/info/retdl\" with the following keys:", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "After completing the downloader function, a downloader specific status update message is sent the C2 server.", "sentence_right": "* name", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* fb\\_start", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* check\\_start", "sentence_right": "* ins\\_start", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| b2996f082d4b43cf9ea3de083ba882269b5f63d6ac53bf31449831e75cb6e4a9 | Version 60.0 |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| b4f3ae0279bacc16[.]com | March 2021 C2 Server (sinkholed) |", "sentence_right": "| b3681d24634f9b10af333470d1f50404fce978bd78bbe22a283716327cfd48c1 | Version 51.0 |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The analyzed sample downloads a configuration from the C2 server with a URI path of \"/info/dd\" (Figure 5).", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "CopperStealer uses an API exposed from the Xunlei application in order to download the configuration for the follow-up binary.", "sentence_right": "The download configuration has also been retrieved from alternative URI paths (See Malware Evolution Section below).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "**Malware Analysis**", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "At the same time, it was observed that CopperStealer was no longer being distributed via the keygenninja[.]com website.", "sentence_right": "A sample with the SHA256 hash of [5fa60303a0c4fd13ecd69e7c1a17788b72605473c2fb3f93eb758010326c76e5](https://bazaar.abuse.ch/sample/5fa60303a0c4fd13ecd69e7c1a17788b72605473c2fb3f93eb758010326c76e5/) was used for this analysis.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "A certificate,  SHA1 Fingerprint=6C:0C:E2:DD:05:84:C4:7C:AC:18:83:9F:14:05:5F:19:FA:27:0C:DD, related to [Charles Proxy](https://www.charlesproxy.com/) is loaded into the victim machine's \"My\" and \"Trusted Root\" certificates stores.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "**Dropped Certificates**", "sentence_right": "The existence of this certificate in the \"My\" certificate store is used when determining the value of the \"isfirst\" flag in addition to the vindiesel registry key.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* os", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* seller", "sentence_right": "* cookie", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "![Cooperstealer_6](/sites/default/files/inline-images/Cooperstealer_6.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Figure 5:  Encrypted download configuration returned from the C2 server.", "sentence_right": "Figure 6: Decrypted download configuration served by the C2 server.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 42e2411108492987315588c71e15f3e6ad266bd380a6f8c6607a577414a332bb | Version 13 |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Version 13 |", "sentence_right": "| 1088966f9f137b15a34da54765d7773743a77da4ac2f70e82e6d603af28cf58e | Version 13 |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "This results in an “extended” list of domains compared to the Version 50.0 sample.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "These are the same methods from Version 50.0, but this version included two additional hardcoded domains and extended the DGA domain variants by appending the digits “1” – “10” to the concatenated string.", "sentence_right": "**C2 Traffic Examples**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| d74b612aa9f21f0d12bdb8a8e8af894bd718a1145c41ec64a646cf4fa78e9f75 | Dropped Smokeloader |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 9902a7fdaac2e764b8e50adbd9ebca4d8d510c2df9af6c5c6a19c721621dd873 | Dropped Smokeloader |", "sentence_right": "**Emerging Threats Signatures**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "However, we observed these sites ultimately provide Potentially Unwanted Programs/Applications (PUP/PUA) or run other malicious executables capable of installing and downloading additional payloads (Figure 1).", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "These sites advertise themselves to offer “cracks”, “keygen” and “serials” to circumvent licensing restrictions of legitimate software.", "sentence_right": "![Cooperstealer_1](/sites/default/files/inline-images/Cooperstealer_1.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Figure 9: A status update being delivered via an HTTP request made by the malware.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![Cooperstealer_9](/sites/default/files/inline-images/Cooperstealer_9.png)", "sentence_right": "The status update message contains three fields (Figure 10).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* Window/class enumeration looking for common analysis tools:", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* GetSystemDefaultLCID() == 0x804 (Chinese (Simplified, PRC)   zh-CN) check", "sentence_right": "+ TCPViewClass", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "We identified several different seeds using this domain pattern among other artifacts.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "4. Apply the Top-Level Domain (TLD): \"1cd81defbab5fc17[.]xyz\"", "sentence_right": "A timeline of seed use can be found in the Malware Evolution section below.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The Subject Common Name of this certificate contains:", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The existence of this certificate in the \"My\" certificate store is used when determining the value of the \"isfirst\" flag in addition to the vindiesel registry key.", "sentence_right": "*Charles Proxy CA (19 十月 2019, DESKTOP-BNAT11U)*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "![Cooperstealer_9](/sites/default/files/inline-images/Cooperstealer_9.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The decryption and encoding methods are detailed within the report.", "sentence_right": "Figure 9: A status update being delivered via an HTTP request made by the malware.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| da5ae4747ff1851c[.]com | March 2021 C2 Server (sinkholed) |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 6c34589d7d1b8d7a[.]com | March 2021 C2 Server (sinkholed) |", "sentence_right": "| f27655e1f8eb05de[.]com | March 2021 C2 Server (sinkholed) |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Within the HTTP traffic, the 'info' form item contains the encrypted details.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "While the malware does not use HTTPS communications, it does leverage DES encryption and a modified base64 encoding.", "sentence_right": "Several different key and iv values have been observed (Table 2).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* ins\\_start", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* fb\\_start", "sentence_right": "* dl\\_start", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "**Anti-Analysis**", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Figure 2: Process Memory Strings", "sentence_right": "The malware does make use of several basic anti-analysis techniques to avoid running within researcher systems.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* downok", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* guid", "sentence_right": "* regok", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "The decryption and encoding methods are detailed within the report.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The analyzed sample sends status update messages to the HTTP Request URI of `/info/step` via a POST with the key of `info` and the value contains encrypted message data (Figure 9).", "sentence_right": "![Cooperstealer_9](/sites/default/files/inline-images/Cooperstealer_9.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "/*--><!]]>*/", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "/*--><!]]]]><![CDATA[>*/", "sentence_right": "**Overview**", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| **Version** | **Sample SHA256** | **Target Service Provider** |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "While the analyzed sample targets Facebook and Instagram, network traffic gathered from other versions indicates other service providers were targeted with unique URI paths that were used for exfiltration (Table 4).", "sentence_right": "| 13 | ebcc7681c6634a22090b9eec8e1a82151173bb74d6668c3e7915a7558b2e9fbe | Bing / Apple / Paypal |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 5071e6e7fd9c82ec[.]com | March 2021 C2 Server (sinkholed) |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| f27655e1f8eb05de[.]com | March 2021 C2 Server (sinkholed) |", "sentence_right": "| b4f3ae0279bacc16[.]com | March 2021 C2 Server (sinkholed) |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "A quick triage of the sample found overlap with [malware](https://www.proofpoint.com/us/threat-reference/malware) tracked internally as CopperStealer.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "On Jan 29th, 2021, a Twitter user, \"[TheAnalyst](https://twitter.com/ffforward/status/1355110538410340353)\", shared a sample which caught our attention after [being notified](https://twitter.com/c3rb3ru5d3d53c/status/1355305724704944129) it triggered an Emerging Threats Network Intrusion Detection System (NIDS) rule.", "sentence_right": "This external interest caused Proofpoint researchers to investigate further, eventually leading to coordinated disruptive actions by Facebook, Cloudflare, and other service providers.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "This registry key is used to determine the malware has been previously run on the victim machine and is used when determining the value of \"isfirst\" flag in the exfiltrated data.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The analyzed sample first attempts to open a specific registry key (below) and is later created.", "sentence_right": "*HKEY\\_CURRENT\\_USER\\SOFTWARE\\Microsoft\\vindiesel*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| exchangework | January 10, 2021 | 6ec80bae15601abfa57fc8ca0a3a83bd6af876a47123c3d8a0ac1761ca3b1289  |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| Vindiesel | December 8, 2020 | daa6931054a125d49f43537a7c07a3bfad8854e18c0c25b49ad7808040f92bb8  |", "sentence_right": "| changenewsys | January 13, 2021 | 10bb601f27c0aae7fb9cc88a45434a8dcd759c03698c00b322f8b7f78ed64164  |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "**Naming**", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "A sample with the SHA256 hash of [5fa60303a0c4fd13ecd69e7c1a17788b72605473c2fb3f93eb758010326c76e5](https://bazaar.abuse.ch/sample/5fa60303a0c4fd13ecd69e7c1a17788b72605473c2fb3f93eb758010326c76e5/) was used for this analysis.", "sentence_right": "Since November 2019, Proofpoint and Emerging Threats have identified this threat as ‘CopperStealer’ and have tracked it internally since then, as well as in [ETPRO signatures](https://www.proofpoint.com/us/daily-ruleset-update-summary-20191114).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* DavidCopperfield", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "A timeline of seed use can be found in the Malware Evolution section below.", "sentence_right": "* FrankLin", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Findings from this investigation point towards CopperStealer being another piece of this everchanging ecosystem.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Previous research from Facebook and Bitdefender has exposed a rapidly increasing ecosystem of Chinese-based malware focused on the monetization of compromised social media and other service accounts.", "sentence_right": "CopperStealer’s active development and use of DGA based C2 servers demonstrates operational maturity as well as redundancy.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "Figure 7: The DGA seed observed in process memory strings.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![Cooperstealer_7](/sites/default/files/inline-images/Cooperstealer_7.png)", "sentence_right": "***Version 50.0 – Version 52.0***", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "* 679150089d1fa44cf099ff4cf677dc683a3fb1bab81b193a56414ac5a046aeeb", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* 3c1f7af5e69a599268bcb3343b8609006a255090234d699c77922c95743e9e98", "sentence_right": "* 9902a7fdaac2e764b8e50adbd9ebca4d8d510c2df9af6c5c6a19c721621dd873", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "| 1edec40732a728195ffea9946dd65ede6072c3c5061cfa3cc6e7cf6b7769052c | Version 50.0 |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 2101fe7d90649a84586e01a615330c95db03c33327cae640cd0e2d7a36f3f2cc | Version 51.0 |", "sentence_right": "| 77daf2ac4fd26e13adbd6b7db03c1fadd30cafc513d03a8412896bb6b4f0f39b | Version 47.0 |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}
{"mention": "![Cooperstealer_15](/sites/default/files/inline-images/Cooperstealer_15.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Our investigation found that the release of new versions increased in frequency starting in August 2020 and accelerated between October 2020 and February 2021, with several updates being released every month (Figure 15).", "sentence_right": "Figure 15: A graph showing the frequency of new version observations.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "proofpoint_2021-03-18_now-you-see-it-now"}