{"mention": "Swedish", "context_left": "| The next link in the redirection chain goes to a", "context_right": "site.", "_context_left": "| The next link in the redirection chain goes to a ", "_context_right": " site.", "sentence_left": "|  |", "sentence_right": "|", "label": "Sweden ( ), formal name: the Kingdom of Sweden (Swedish: ), is a Scandinavian Nordic country in Northern Europe. It borders Norway to the west and north and Finland to the east, and is connected to Denmark in the southwest by a bridge-tunnel across the Oresund Strait. At , Sweden is the largest country in Northern Europe, the third-largest country in the European Union and the fifth largest country in Europe by area. The capital city is Stockholm. Sweden has a total population of 10.3 million of which 2.5 million have a foreign background. It has a low population density of and the highest urban concentration is in the central and southern half of the country.  Sweden is part of the geographical area of Fennoscandia. The climate is in general very mild for its northerly latitude due to significant maritime influence. In spite of the high latitude, Sweden often has warm continental summers, being located in between the North Atlantic, the Baltic Sea and the vast Eurasian Russian landmass. The general climate and environment varies significantly from the south and north due to the vast latitudal difference and much of Sweden has reliably cold and snowy winters. Southern Sweden is predominantly agricultural, while the north is heavily forested and includes a portion of the Scandinavian Mountains.  Germanic peoples have inhabited Sweden since prehistoric times, emerging into history as the Geats (Swedish Gotar) and Swedes (Svear) and constituting the sea peoples known as the Norsemen. An independent Swedish state emerged during the early 12th century.", "label_id": 1003476, "label_title": "Sweden", "label_link": "https://en.wikipedia.org/wiki?curid=5058739", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-09-19_malvertising-campaign-leading-zemot"}
{"mention": "Zscaler", "context_left": "", "context_right": "is actively monitoring this threat and notifying any sites of compromise.", "_context_left": "", "_context_right": " is actively monitoring this threat and notifying any sites of compromise.", "sentence_left": "This malvertising campaign has been highly effective thus far and no site, despite its good intentions, appears to be given any quarter.", "sentence_right": "", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-09-19_malvertising-campaign-leading-zemot"}