{"mention": "Microsoft", "context_left": "* Detected as PWS:Win32/Zbot by", "context_right": "([VT 43/49](https://www.virustotal.com/#/file/1cc3e52e3ba9a3187c430024b61d2111d658bc4500ec77aab995053e8248bb98/analysis/))", "_context_left": "* Detected as PWS:Win32/Zbot by ", "_context_right": " ([VT 43/49](https://www.virustotal.com/#/file/1cc3e52e3ba9a3187c430024b61d2111d658bc4500ec77aab995053e8248bb98/analysis/))", "sentence_left": "* Size: 442368 bytes", "sentence_right": "[POST DATA]", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-03-25_walkthrough-recent-zbot-infection-and"}
{"mention": "SOUTH KOREA", "context_left": "* Country: **", "context_right": "**", "_context_left": "* Country: **", "_context_right": "**", "sentence_left": "* Bits: 0 means OS is **32 BIT**", "sentence_right": "We are continuing to track these malicious Domains and IP addresses and advise you to block them too.", "label": "South Korea (Korean: ; RR: \"Hanguk\" or literally ; RR: \"Namhan\"; officially the Republic of Korea ; RR: \"Daehan Minguk\") is a country in East Asia, constituting the southern part of the Korean Peninsula and sharing a land border with North Korea. The name \"Korea\" is derived from Goguryeo which was one of the great powers in East Asia during its time, ruling most of the Korean Peninsula, Manchuria, parts of the Russian Far East and Inner Mongolia under Gwanggaeto the Great. Its capital, Seoul, is a major global city and half of South Korea's over 51 million people live in the Seoul Capital Area, the fourth largest metropolitan economy in the world.  The Korean Peninsula was inhabited as early as the Lower Paleolithic period. Its first kingdom was noted in Chinese records in the early 7th century BC. Following the unification of the Three Kingdoms of Korea into Silla and Balhae in the late 7th century, Korea was ruled by the Goryeo dynasty (918–1392) and the Joseon dynasty (1392–1897). The succeeding Korean Empire was annexed into the Empire of Japan in 1910. After World War II, Korea was divided into Soviet and U.S.-administered zones, with the latter becoming the Republic of Korea in August 1948. In 1950, a North Korean invasion began the Korean War and after its end in 1953, the country's economy began to soar, recording the fastest rise in average GDP per capita in the world between 1980 and 1990. Authoritarian rule ended in 1987 and the country is now", "label_id": 13374, "label_title": "South Korea", "label_link": "https://en.wikipedia.org/wiki?curid=27019", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-03-25_walkthrough-recent-zbot-infection-and"}
{"mention": "| 91.21.200.217 | [https://www.virustotal.com/en/ip-address/91.21.200.217/information/](https://www.virustotal.com/#/ip-address/91.21.200.217/information/) |", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "| 81.206.227.11 | [https://www.virustotal.com/en/ip-address/81.206.227.11/information/](https://www.virustotal.com/#/ip-address/81.206.227.11/information/) |", "sentence_right": "| 1.240.64.211 | [https://www.virustotal.com/en/ip-address/1.240.64.211/information/](https://www.virustotal.com/#/ip-address/1.240.64.211/information/) |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2014-03-25_walkthrough-recent-zbot-infection-and"}
{"mention": "* gadmxsmfeqrscmfytvksirnyxm.com", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* kvdmkndexomrceqydtgepr.net", "sentence_right": "* xgkzhahdqsxgusireqxdqkzsk.ru", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2014-03-25_walkthrough-recent-zbot-infection-and"}