{"mention": "China", "context_left": "It checks whether the SMS has been sent from", "context_right": "and if so, will abort the notification so that the user has no knowledge of the new SMS.", "_context_left": "It checks whether the SMS has been sent from ", "_context_right": " and if so, will abort the notification so that the user has no knowledge of the new SMS.", "sentence_left": "Its functionality is to fetch the details of each new SMS.", "sentence_right": "|  |", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-03-17_adult-themed-android-sms-stealer"}
{"mention": "China", "context_left": "It is also interesting to note that each of these dropped applications try to target different sim operators in", "context_right": ".", "_context_left": "It is also interesting to note that each of these dropped applications try to target different sim operators in ", "_context_right": ".", "sentence_left": "If one of the applications is detected by AV, the other applications can continue with their work.", "sentence_right": "There has been an increasing tendency of malware in disguise of adult rated applications in order to attract victims.", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-03-17_adult-themed-android-sms-stealer"}
{"mention": "Google", "context_left": "The best way to avoid such applications is to stick to official app stores like", "context_right": "Play and the Amazon app store.", "_context_left": "The best way to avoid such applications is to stick to official app stores like ", "_context_right": " Play and the Amazon app store.", "sentence_left": "There has been an increasing tendency of malware in disguise of adult rated applications in order to attract victims.", "sentence_right": "---", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-03-17_adult-themed-android-sms-stealer"}
{"mention": "Amazon", "context_left": "The best way to avoid such applications is to stick to official app stores like Google Play and the", "context_right": "app store.", "_context_left": "The best way to avoid such applications is to stick to official app stores like Google Play and the ", "_context_right": " app store.", "sentence_left": "There has been an increasing tendency of malware in disguise of adult rated applications in order to attract victims.", "sentence_right": "---", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-03-17_adult-themed-android-sms-stealer"}