{"mention": "Panama", "context_left": "**Introduction** Tax Season is once again upon those of us who don’t have a tax shelter company in", "context_right": ". This year, the IRS warned of a [400% increase](http://wreg.com/2016/02/19/irs-reports-400-surge-in-phishing-malware-incidents-this-tax-season/) in phishing attempts and tax related e-mail scams.", "_context_left": "Tax Season is once again upon those of us who don’t have a tax shelter company in ", "_context_right": ".", "sentence_left": "**Introduction**", "sentence_right": "This year, the IRS warned of a [400% increase](http://wreg.com/2016/02/19/irs-reports-400-surge-in-phishing-malware-incidents-this-tax-season/) in phishing attempts and tax related e-mail scams.", "label": "Panama ( , ; ), officially the Republic of Panama (), is a country in Central America, bordered by Costa Rica to the west, Colombia to the southeast, the Caribbean Sea to the north, and the Pacific Ocean to the south. The capital and largest city is Panama City, whose metropolitan area is home to nearly half the country's /1e6 round 0 million people.  Panama was inhabited by indigenous tribes before Spanish colonists arrived in the 16th century. It broke away from Spain in 1821 and joined the Republic of Gran Colombia, a union of Nueva Granada, Ecuador, and Venezuela. After Gran Colombia dissolved in 1831, Panama and Nueva Granada eventually became the Republic of Colombia. With the backing of the United States, Panama seceded from Colombia in 1903, allowing the construction of the Panama Canal to be completed by the US Army Corps of Engineers between 1904 and 1914. The 1977 Torrijos–Carter Treaties led to the transfer of the Canal from the United States to Panama on December 31, 1999.  Revenue from canal tolls continues to represent a significant portion of Panama's GDP, although commerce, banking, and tourism are major and growing sectors. It is regarded as a high-income country. In 2015 Panama ranked 60th in the world in terms of the Human Development Index. In 2018, Panama was ranked seventh-most competitive economy in Latin America, according to the World Economic Forum's Global Competitiveness Index. Covering around 40 percent of its land area, Panama's jungles are home to an abundance of tropical", "label_id": 11251, "label_title": "Panama", "label_link": "https://en.wikipedia.org/wiki?curid=22997", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "Indian", "context_left": "**Tax 'Challan'** Our second e-mail sample is part of a spam campaign that has been targeting", "context_right": "national taxpayers this year. In this campaign, emails are sent from spoofed Indian government domains, alerting the victim that a sum of money has been deducted from their bank account to cover owed taxes.", "_context_left": "Our second e-mail sample is part of a spam campaign that has been targeting ", "_context_right": " national taxpayers this year.", "sentence_left": "**Tax 'Challan'**", "sentence_right": "In this campaign, emails are sent from spoofed Indian government domains, alerting the victim that a sum of money has been deducted from their bank account to cover owed taxes.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "Indian government", "context_left": "Our second e-mail sample is part of a spam campaign that has been targeting Indian national taxpayers this year. In this campaign, emails are sent from spoofed", "context_right": "domains, alerting the victim that a sum of money has been deducted from their bank account to cover owed taxes. The email instructs the victim to see the challan (receipt) for the transaction, which is a zip archive either attached to the email or hosted at a malicious domain.", "_context_left": "In this campaign, emails are sent from spoofed ", "_context_right": " domains, alerting the victim that a sum of money has been deducted from their bank account to cover owed taxes.", "sentence_left": "Our second e-mail sample is part of a spam campaign that has been targeting Indian national taxpayers this year.", "sentence_right": "The email instructs the victim to see the challan (receipt) for the transaction, which is a zip archive either attached to the email or hosted at a malicious domain.", "label": "The Government of India (ISO: ), often abbreviated as GoI, is the union government created by the constitution of India as the legislative, executive and judicial authority of the union of 29 states and seven union territories of a constitutionally democratic republic. It is located in New Delhi, the capital of India.", "label_id": 217930, "label_title": "Government of India", "label_link": "https://en.wikipedia.org/wiki?curid=553883", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "Zscaler", "context_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/tax-challan-3.png)](/sites/default/files/images/blogs/tax-challan-3.png)", "context_right": "provides coverage for the trojan payload and its network communication. The following domains are contacted by the infostealer:", "_context_left": "", "_context_right": " provides coverage for the trojan payload and its network communication.", "sentence_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/tax-challan-3.png)](/sites/default/files/images/blogs/tax-challan-3.png)", "sentence_right": "The following domains are contacted by the infostealer:", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "Zscaler", "context_left": "**Conclusion**", "context_right": "protects its customers from these threats with multiple layers, but the best protection in this case is to be mindful and cautious. As the IRS Spokesperson Mark S. Green stated: “The IRS DOES NOT initiate contact with taxpayers by email, text, social media or electronic communications to request personal or financial information.", "_context_left": "", "_context_right": " protects its customers from these threats with multiple layers, but the best protection in this case is to be mindful and cautious.", "sentence_left": "**Conclusion**", "sentence_right": "As the IRS Spokesperson Mark S. Green stated: “The IRS DOES NOT initiate contact with taxpayers by email, text, social media or electronic communications to request personal or financial information.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "In the end, this \"installer\" doesn't even install the TurboTax software that was the original lure.", "context_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/chrome-tabs.PNG)](/sites/default/files/images/blogs/chrome-tabs.PNG)", "context_right": "To add insult to injury, the user is shown two browser tabs, one of which is the official TurboTax purchase and download page.", "_context_left": "", "_context_right": "", "sentence_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/chrome-tabs.PNG)](/sites/default/files/images/blogs/chrome-tabs.PNG)", "sentence_right": "To add insult to injury, the user is shown two browser tabs, one of which is the official TurboTax purchase and download page.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "It can download new malicious modules to the victim after infection or simply perform reconnaissance on the user’s system.", "context_left": "Once installed, it begins beaconing to remote control servers with information about the user.", "context_right": "At the time of research, this sample was already well covered with a score of [46/56](https://www.virustotal.com/#/file/9564851dbd97833c336786d4e6ecc6a5ada72a0445da3ad56213aa7c74297c2d/analysis/) on VirusTotal.", "_context_left": "", "_context_right": "", "sentence_left": "Once installed, it begins beaconing to remote control servers with information about the user.", "sentence_right": "At the time of research, this sample was already well covered with a score of [46/56](https://www.virustotal.com/#/file/9564851dbd97833c336786d4e6ecc6a5ada72a0445da3ad56213aa7c74297c2d/analysis/) on VirusTotal.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "Its purpose is to download additional malware payloads and gain remote access to the PC to collect sensitive information.", "context_left": "The threat itself is a family of Trojan Droppers known as Bagsu.", "context_right": "This sample appears to be no different as it delivered a payload from the Worm family [Gamarue](https://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Worm:Win32/Gamarue.I).", "_context_left": "", "_context_right": "", "sentence_left": "The threat itself is a family of Trojan Droppers known as Bagsu.", "sentence_right": "This sample appears to be no different as it delivered a payload from the Worm family [Gamarue](https://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Worm:Win32/Gamarue.I).", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "At the time of research, this threat was detected by [34/56](https://www.virustotal.com/#/file/c1e2d4caf3b90df5f9925a85f699da4c309a1bcb15872893456955072c992216/analysis/) AV vendors on VirusTotal.", "context_left": "Our first e-mail based case comes via a ZIP attachment from a scam e-mail aptly named ‘Tax Report.zip’.", "context_right": "The threat itself is a family of Trojan Droppers known as Bagsu.", "_context_left": "", "_context_right": "", "sentence_left": "Our first e-mail based case comes via a ZIP attachment from a scam e-mail aptly named ‘Tax Report.zip’.", "sentence_right": "The threat itself is a family of Trojan Droppers known as Bagsu.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-04-14_tax-season-scams"}
{"mention": "The sample made other attempts to connect to malicious domains, but these were sinkholed at the time of research:", "context_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/tax-report.png)](/sites/default/files/images/blogs/tax-report.png)", "context_right": "http://dudebox[.]pl/image.php", "_context_left": "", "_context_right": "", "sentence_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/tax-report.png)](/sites/default/files/images/blogs/tax-report.png)", "sentence_right": "http://dudebox[.]pl/image.php", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-04-14_tax-season-scams"}