{"mention": "Microsoft", "context_left": "**Mjag dropper** Mjag dropper is compiled in the", "context_right": ".NET framework, and its original binary is obfuscated using SmartAssembly. The installation path and other details are stored in encrypted form using AES encryption (Fig. 1), and the decryption key is hardcoded.", "_context_left": "Mjag dropper is compiled in the ", "_context_right": " .NET framework, and its original binary is obfuscated using SmartAssembly.", "sentence_left": "**Mjag dropper**", "sentence_right": "The installation path and other details are stored in encrypted form using AES encryption (Fig. 1), and the decryption key is hardcoded.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-01-10_mjag-dropper-using-decoy-documents"}
{"mention": "India Overseas Bank", "context_left": "Fig. 2: Extracting decoy PDF and payload The decoy document claims to be an", "context_right": "NEFT transaction statement. It lures users to click the “Click here to view full document” link, which points to a malicious website hosting a copy of the Mjag droppper payload.", "_context_left": "The decoy document claims to be an ", "_context_right": " NEFT transaction statement.", "sentence_left": "Fig. 2: Extracting decoy PDF and payload", "sentence_right": "It lures users to click the “Click here to view full document” link, which points to a malicious website hosting a copy of the Mjag droppper payload.", "label": "Indian Overseas Bank (IOB) is a major public sector bank based in Chennai, India, with about 3,400 domestic branches. And about 6 foreign branches and representative office  =History=", "label_id": 253390, "label_title": "Indian Overseas Bank", "label_link": "https://en.wikipedia.org/wiki?curid=680206", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2019-01-10_mjag-dropper-using-decoy-documents"}
{"mention": "Zscaler", "context_left": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/puisherRAT/15_sandbox.JPG) Fig. 15:", "context_right": "Sandbox report", "_context_left": "Fig. 15: ", "_context_right": " Sandbox report", "sentence_left": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/puisherRAT/15_sandbox.JPG)", "sentence_right": "", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-01-10_mjag-dropper-using-decoy-documents"}