{"mention": "Microsoft", "context_left": "Recently, we started seeing a new campaign involving multiple signed CryptoWall 3.0 samples in our Cloud Sandboxes being downloaded from a popular file hosting service, MediaFire. A quick Open Source Intelligence (OSINT), search lead us to this e-mail campaign where the attachment contains a", "context_right": "Compiled HTML help (CHM) file that leads to the download and execution of the the latest CryptoWall 3.0 variant hosted on MediaFire. The CHM file downloads and executes the CryptoWall executable from a hardcoded MediaFire location as seen in screenshot below:", "_context_left": "A quick Open Source Intelligence (OSINT), search lead us to this e-mail campaign where the attachment contains a ", "_context_right": " Compiled HTML help (CHM) file that leads to the download and execution of the the latest CryptoWall 3.0 variant hosted on MediaFire.", "sentence_left": "Recently, we started seeing a new campaign involving multiple signed CryptoWall 3.0 samples in our Cloud Sandboxes being downloaded from a popular file hosting service, MediaFire.", "sentence_right": "The CHM file downloads and executes the CryptoWall executable from a hardcoded MediaFire location as seen in screenshot below:", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2015-06-04_signed-cryptowall-30-variant-delivered"}
{"mention": "The ransom amount requested in our case was $500 USD and to prove authenticity, the malware authors also offer the victim a \"Decrypt 1 file for FREE\" option, which is limited to a 512 kilobyte file.", "context_left": "| Personalized ransom payment page |", "context_right": "Below is the geo distribution of the CryptoWall C&C servers we oberved in the past week:", "_context_left": "", "_context_right": "", "sentence_left": "| Personalized ransom payment page |", "sentence_right": "Below is the geo distribution of the CryptoWall C&C servers we oberved in the past week:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-06-04_signed-cryptowall-30-variant-delivered"}