{"mention": "Zscaler", "context_left": "Recently, the", "context_right": "ThreatLabZ team came across a new remote-access trojan (RAT) for sale on the dark web.", "_context_left": "Recently, the ", "_context_right": " ThreatLabZ team came across a new remote-access trojan (RAT) for sale on the dark web.", "sentence_left": "August 08, 2019", "sentence_right": "The RAT, called Saefko, is written in .NET and has multiple functionalities.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Zscaler", "context_left": "The ThreatLabZ team also detonated the Saefko RAT in the", "context_right": "Cloud Sandbox to determine its functionality, communications, and the potential threat.", "_context_left": "The ThreatLabZ team also detonated the Saefko RAT in the ", "_context_right": " Cloud Sandbox to determine its functionality, communications, and the potential threat.", "sentence_left": "They have the ability to steal a lot of data without being detected and spread to other systems across the network.", "sentence_right": "### **Technical Analysis of the Saefko RAT**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Facebook", "context_left": "**", "context_right": "activity**", "_context_left": "**", "_context_right": " activity**", "sentence_left": "| instagram.com | m.instagram.com |", "sentence_right": "| facebook.com | m.facebook.com |", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Google", "context_left": "**", "context_right": "+ activity**", "_context_left": "**", "_context_right": "+ activity**", "sentence_left": "| youtube.com | m.youtube.com |", "sentence_right": "| plus.google.com | m.plus.google.com |", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Microsoft", "context_left": "| identify | Send system information:OS type:", "context_right": "windowsOS version: OS versionOS Username: usernameOS MachineName: System nameOS SystemDirectory: System Directory |", "_context_left": "| identify | Send system information:OS type: ", "_context_right": " windowsOS version: OS versionOS Username: usernameOS MachineName: System nameOS SystemDirectory: System Directory |", "sentence_left": "|", "sentence_right": "| opencd | Open CDROM drive.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ team continues to monitor this threat and others to ensure that Zscaler customers are protected.", "_context_left": "", "_context_right": " ThreatLabZ team continues to monitor this threat and others to ensure that Zscaler customers are protected.", "sentence_left": "Attackers are often careful to prevent the malware from doing too much activity at once, which would slow down the system and possibly attract the attention of the user and IT.", "sentence_right": "### **IOCs**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}
{"mention": "Zscaler", "context_left": "Zscaler ThreatLabZ team continues to monitor this threat and others to ensure that", "context_right": "customers are protected.", "_context_left": "Zscaler ThreatLabZ team continues to monitor this threat and others to ensure that ", "_context_right": " customers are protected.", "sentence_left": "Attackers are often careful to prevent the malware from doing too much activity at once, which would slow down the system and possibly attract the attention of the user and IT.", "sentence_right": "### **IOCs**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-08-08_saefko-new-multi-layered-rat"}