{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ recently discovered a new DoS family bot named Sieren.", "_context_left": "", "_context_right": " ThreatLabZ recently discovered a new DoS family bot named Sieren.", "sentence_left": "December 21, 2018", "sentence_right": "A denial-of-service (DoS) attack is a cyber-attack in which cybercriminals disrupt the service of a host connected to the internet, either temporarily or indefinitely, to its intended users.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-12-21_sieren-new-dos-bot"}
{"mention": "Russian", "context_left": "In the above instance, we saw that a", "context_right": "education material website (*https://deti-online[.]com*) was the intended target for this bot.", "_context_left": "In the above instance, we saw that a ", "_context_right": " education material website (*https://deti-online[.]com*) was the intended target for this bot.", "sentence_left": "The variant we analyzed has 10 methods supported for flooding, and it chooses the method based on data received from the C&C server.", "sentence_right": "We also identified other locations, such as *forum.exlpoit[.]in* and *x3p0[.]xyz*, as the DoS targets from the C&C server during our analysis.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2018-12-21_sieren-new-dos-bot"}