{"mention": "Netherlands", "context_left": "These domains would redirect the user to a Magnitude EK with a randomly generated hostname to attempt hindering researcher's ability to track the threat. However all these sites were hosted on the same IP address hosted in the", "context_right": "(193.169.245.78). 201116.pzmu.nsv.ha.ywyh.ya.fmpryuyqoz.crisisreverse[.]net", "_context_left": "However all these sites were hosted on the same IP address hosted in the ", "_context_right": " (193.169.245.78).", "sentence_left": "These domains would redirect the user to a Magnitude EK with a randomly generated hostname to attempt hindering researcher's ability to track the threat.", "sentence_right": "201116.pzmu.nsv.ha.ywyh.ya.fmpryuyqoz.crisisreverse[.]net", "label": "The Netherlands (, ) is a country located mainly in Northwestern Europe. The European portion of the Netherlands consists of twelve provinces that border Germany to the east, Belgium to the south, and the North Sea to the northwest, with maritime borders in the North Sea with Belgium, Germany and the United Kingdom. Together with three island territories in the Caribbean Sea—Bonaire, Sint Eustatius and Saba—it forms a constituent country of the Kingdom of the Netherlands. The official language is Dutch, but a secondary official language in the province of Friesland is West Frisian.  The six largest cities in the Netherlands are Amsterdam, Rotterdam, The Hague, Utrecht, Eindhoven and Tilburg. Amsterdam is the country's capital, while The Hague holds the seat of the States General, Cabinet and Supreme Court. The Port of Rotterdam is the largest port in Europe, and the largest in any country outside Asia. The country is a founding member of the EU, Eurozone, G10, NATO, OECD and WTO, as well as a part of the Schengen Area and the trilateral Benelux Union. It hosts several intergovernmental organisations and international courts, many of which are centered in The Hague, which is consequently dubbed 'the world's legal capital'.  \"Netherlands\" literally means 'lower countries' in reference to its low elevation and flat topography, with only about 50% of its land exceeding above sea level, and nearly 17% falling below sea level. Most of the areas below sea level, known as \"polders\", are the result of land reclamation that began in the 16th", "label_id": 10347, "label_title": "Netherlands", "label_link": "https://en.wikipedia.org/wiki?curid=21148", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-01-06_yahoo-ad-server-compromise-recap"}
{"mention": "201111.ygiv.wdh.ioycntlg.boxsdiscussing[.]net", "context_left": "201116.yphu.ixrwpvewnkui.limitingbeyond[.]net", "context_right": "201116.cx.zq.ixrwpvewnkui.limitingbeyond[.]net", "_context_left": "", "_context_right": "", "sentence_left": "201116.yphu.ixrwpvewnkui.limitingbeyond[.]net", "sentence_right": "201116.cx.zq.ixrwpvewnkui.limitingbeyond[.]net", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2014-01-06_yahoo-ad-server-compromise-recap"}