{"mention": "Russia", "context_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in", "context_right": "and Ukraine.", "_context_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in ", "_context_right": " and Ukraine.", "sentence_left": "**Introduction**", "sentence_right": "There have also been reports of businesses impacted in Germany, Turkey, and other countries.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Ukraine", "context_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in Russia and", "context_right": ".", "_context_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in Russia and ", "_context_right": ".", "sentence_left": "**Introduction**", "sentence_right": "There have also been reports of businesses impacted in Germany, Turkey, and other countries.", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Germany", "context_left": "There have also been reports of businesses impacted in", "context_right": ", Turkey, and other countries.", "_context_left": "There have also been reports of businesses impacted in ", "_context_right": ", Turkey, and other countries.", "sentence_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in Russia and Ukraine.", "sentence_right": "The ransomware payload contains a self-propagation module designed to perform lateral movement across the corporate network upon successful infection, which makes this threat highly virulent.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Turkey", "context_left": "There have also been reports of businesses impacted in Germany,", "context_right": ", and other countries.", "_context_left": "There have also been reports of businesses impacted in Germany, ", "_context_right": ", and other countries.", "sentence_left": "Almost four months after the last major outbreak, we are seeing a new variant of Petya ransomware dubbed \"Bad Rabbit,\" and it's impacting multiple businesses, primarily in Russia and Ukraine.", "sentence_right": "The ransomware payload contains a self-propagation module designed to perform lateral movement across the corporate network upon successful infection, which makes this threat highly virulent.", "label": "Turkey ( ), officially the Republic of Turkey ( ), is a transcontinental country located mainly in Western Asia, with a smaller portion on the Balkan Peninsula in Southeast Europe. East Thrace, located in Europe, is separated from Anatolia by the Sea of Marmara, the Bosphorous strait and the Dardanelles (collectively called the Turkish Straits). Turkey is bordered by Greece and Bulgaria to its northwest; Georgia to its northeast; Armenia, the Azerbaijani exclave of Nakhchivan and Iran to the east; and Iraq and Syria to the south. Istanbul is the largest city, but more central Ankara is the capital. Approximately 70 to 80 per cent of the country's citizens identify as Turkish. Kurds are the largest minority; the size of the Kurdish population is a subject of dispute with estimates placing the figure at anywhere from 12 to 25 per cent of the population.  At various points in its history, the region has been inhabited by diverse civilizations including the Assyrians, Greeks, Thracians, Phrygians, Urartians, and Armenians. Hellenization started during the era of Alexander the Great and continued into the Byzantine era. The Seljuk Turks began migrating into the area in the 11th century, and their victory over the Byzantines at the Battle of Manzikert in 1071 symbolizes the start and foundation of Turkey. The Seljuk Sultanate of Rum ruled Anatolia until the Mongol invasion in 1243, when it disintegrated into small Turkish principalities. Beginning in the late 13th-century, the Ottomans started uniting these Turkish principalities. After Mehmed II conquered Constantinople in 1453, Ottoman", "label_id": 1602232, "label_title": "Turkey", "label_link": "https://en.wikipedia.org/wiki?curid=11125639", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Russian", "context_left": "[UPDATE] We have found several other news and media sites (", "context_right": ", Bulgarian, Japanese, and others) that were compromised, leading users to a fake Flash Player installer payload.", "_context_left": "[UPDATE] We have found several other news and media sites (", "_context_right": ", Bulgarian, Japanese, and others) that were compromised, leading users to a fake Flash Player installer payload.", "sentence_left": "The initial infection vector appears to be two Russian news agency sites : fontanka[.]ru and interfax[.]ru.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_outbreak.png)", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Bulgarian", "context_left": "[UPDATE] We have found several other news and media sites (Russian,", "context_right": ", Japanese, and others) that were compromised, leading users to a fake Flash Player installer payload.", "_context_left": "[UPDATE] We have found several other news and media sites (Russian, ", "_context_right": ", Japanese, and others) that were compromised, leading users to a fake Flash Player installer payload.", "sentence_left": "The initial infection vector appears to be two Russian news agency sites : fontanka[.]ru and interfax[.]ru.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_outbreak.png)", "label": "Bulgaria (; ), officially the Republic of Bulgaria (, \"\", ), is a country in Southeast Europe. It is bordered by Romania to the north, Serbia and North Macedonia to the west, Greece and Turkey to the south, and the Black Sea to the east. The capital and largest city is Sofia; other major cities are Plovdiv, Varna and Burgas. With a territory of , Bulgaria is Europe's 16th-largest country.  One of the earliest societies in the lands of modern-day Bulgaria was the Neolithic Karanovo culture, which dates back to 6,500 BC. In the 6th to 3rd century BC the region was a battleground for Thracians, Persians, Celts and ancient Macedonians; stability came when the Roman Empire conquered the region in AD 45. The Eastern Roman, or Byzantine, Empire lost some of these territories to an invading Bulgar horde in the late 7th century. The Bulgars founded the First Bulgarian Empire in AD 681, which dominated most of the Balkans and significantly influenced Slavic cultures by developing the Cyrillic script. This state lasted until the early 11th century, when Byzantine emperor Basil II conquered and dismantled it. A successful Bulgarian revolt in 1185 established a Second Bulgarian Empire, which reached its apex under Ivan Asen II (1218–1241). After numerous exhausting wars and feudal strife, the Second Bulgarian Empire disintegrated in 1396 and its territories fell under Ottoman rule for nearly five centuries.  The Russo-Turkish War of 1877–78 resulted in the formation of the current Third Bulgarian State. Many ethnic Bulgarian populations were left", "label_id": 1456, "label_title": "Bulgaria", "label_link": "https://en.wikipedia.org/wiki?curid=3415", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Japanese", "context_left": "[UPDATE] We have found several other news and media sites (Russian, Bulgarian,", "context_right": ", and others) that were compromised, leading users to a fake Flash Player installer payload.", "_context_left": "[UPDATE] We have found several other news and media sites (Russian, Bulgarian, ", "_context_right": ", and others) that were compromised, leading users to a fake Flash Player installer payload.", "sentence_left": "The initial infection vector appears to be two Russian news agency sites : fontanka[.]ru and interfax[.]ru.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_outbreak.png)", "label": "Japan (; \"Nippon\" or \"Nihon\" ; formally \"\" or \"Nihon-koku\", ) is an island country in East Asia. Located in the Pacific Ocean, it lies off the eastern coast of the Asian continent and stretches from the Sea of Okhotsk in the north to the East China Sea and the Philippine Sea in the south.  The kanji that make up Japan's name mean 'sun origin', and it is often called the \"Land of the Rising Sun\". Japan is a stratovolcanic archipelago consisting of about 6,852 islands. The four largest are Honshu, Hokkaido, Kyushu, and Shikoku, which make up about ninety-seven percent of Japan's land area and often are referred to as home islands. The country is divided into 47 prefectures in eight regions, with Hokkaido being the northernmost prefecture and Okinawa being the southernmost one. Japan is the 2nd most populous island country. The population of 126 million (2019) is the world's eleventh largest, of which 98.5% are ethnic Japanese. 90.7% of people live in cities, while 9.3% live in the countryside. About 13.8 million people live in Tokyo, the capital of Japan. The Greater Tokyo Area is the most populous metropolitan area in the world with over 38 million people.  Archaeological research indicates that Japan was inhabited as early as the Upper Paleolithic period. The first written mention of Japan is in Chinese history texts from the 1st century AD. Influence from other regions, mainly China, followed by periods of isolation, particularly from Western Europe, has characterized Japan's history.  From the", "label_id": 7451, "label_title": "Japan", "label_link": "https://en.wikipedia.org/wiki?curid=15573", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Zscaler", "context_left": "We saw multiple instances from this outbreak in the", "context_right": "cloud, and the new ransomware payload was flagged as malicious by the Zscaler Cloud Sandbox module.", "_context_left": "We saw multiple instances from this outbreak in the ", "_context_right": " cloud, and the new ransomware payload was flagged as malicious by the Zscaler Cloud Sandbox module.", "sentence_left": "Figure 2 - Infection cycle [UPDATE: multiple other compromised Russian news and media sites were also part of this campaign]", "sentence_right": "For this blog, we will analyze the attack cycle where the user was redirected from the fontanka[.]ru news site to another compromised site, as shown in Figure 2, which serves the ransomware executable payload.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Zscaler", "context_left": "We saw multiple instances from this outbreak in the Zscaler cloud, and the new ransomware payload was flagged as malicious by the", "context_right": "Cloud Sandbox module.", "_context_left": "We saw multiple instances from this outbreak in the Zscaler cloud, and the new ransomware payload was flagged as malicious by the ", "_context_right": " Cloud Sandbox module.", "sentence_left": "Figure 2 - Infection cycle [UPDATE: multiple other compromised Russian news and media sites were also part of this campaign]", "sentence_right": "For this blog, we will analyze the attack cycle where the user was redirected from the fontanka[.]ru news site to another compromised site, as shown in Figure 2, which serves the ransomware executable payload.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Adobe", "context_left": "Figure 3 - Fake", "context_right": "Flash Player update prompt", "_context_left": "Figure 3 - Fake ", "_context_right": " Flash Player update prompt", "sentence_left": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_flashupdate.png)", "sentence_right": "Once a user clicks the INSTALL button, the ransomware executable will be downloaded on the victim's machine.", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Adobe", "context_left": "The payload will masquerade as", "context_right": "Flash Player setup using the Adobe Flash installer icon, as shown below:", "_context_left": "The payload will masquerade as ", "_context_right": " Flash Player setup using the Adobe Flash installer icon, as shown below:", "sentence_left": "Once a user clicks the INSTALL button, the ransomware executable will be downloaded on the victim's machine.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_fake_flash_install.png)", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Adobe", "context_left": "The payload will masquerade as Adobe Flash Player setup using the", "context_right": "Flash installer icon, as shown below:", "_context_left": "The payload will masquerade as Adobe Flash Player setup using the ", "_context_right": " Flash installer icon, as shown below:", "sentence_left": "Once a user clicks the INSTALL button, the ransomware executable will be downloaded on the victim's machine.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/BR_fake_flash_install.png)", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers.", "_context_left": "", "_context_right": " ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers.", "sentence_left": "Figure 11 - Onion site for ransom payment instructions", "sentence_right": "We will continue to update this blog with additional information as we further analyze the payloads.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Zscaler", "context_left": "Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for", "context_right": "customers.", "_context_left": "Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for ", "_context_right": " customers.", "sentence_left": "Figure 11 - Onion site for ransom payment instructions", "sentence_right": "We will continue to update this blog with additional information as we further analyze the payloads.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}
{"mention": "Zscaler", "context_left": "**", "context_right": "Coverage**", "_context_left": "**", "_context_right": " Coverage**", "sentence_left": "1dnscontrol[.]com", "sentence_right": "Advanced Threat Signatures", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-10-24_bad-rabbit-new-petya-ransomware"}