{"mention": "Chinese", "context_left": "", "context_right": "Cyber Espionage APT Group ‘Emissary Panda’ Activity Update August 20, 2015", "_context_left": "", "_context_right": " Cyber Espionage APT Group ‘Emissary Panda’ Activity Update", "sentence_left": "", "sentence_right": "August 20, 2015", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Chinese", "context_left": "### Introduction Last week we shared research on the [", "context_right": "cyber espionage APT group ‘Emissary Panda’](/blogs/research/chinese-cyber-espionage-apt-group-leveraging-recently-leaked-hacking-team-exploits-target-financial-services-firm) and how the group is for the first time leveraging Hacking Team’s leaked exploits to target a multinational financial services firm. Upon further analysis we have identified multiple other industry verticals that were also targeted by this group in the last month.", "_context_left": "Last week we shared research on the [", "_context_right": " cyber espionage APT group ‘Emissary Panda’](/blogs/research/chinese-cyber-espionage-apt-group-leveraging-recently-leaked-hacking-team-exploits-target-financial-services-firm) and how the group is for the first time leveraging Hacking Team’s leaked exploits to target a multinational financial services firm.", "sentence_left": "### Introduction", "sentence_right": "Upon further analysis we have identified multiple other industry verticals that were also targeted by this group in the last month.", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Adobe", "context_left": "As noted before, this was the first instance of the ‘Emissary Panda’ group weaponizing malware payloads using the 0-day exploits found in the leaked Hacking Team archives. We were able to confirm usage of", "context_right": "Flash exploits CVE-2015-5119 and CVE-2015-5123 in these attacks. In the attack against a Pharmaceutical firm, we observed the use of a compromised Government site to redirect the victim to a server hosting the Hacking Team’s 0-day Flash exploit.", "_context_left": "We were able to confirm usage of ", "_context_right": " Flash exploits CVE-2015-5119 and CVE-2015-5123 in these attacks.", "sentence_left": "As noted before, this was the first instance of the ‘Emissary Panda’ group weaponizing malware payloads using the 0-day exploits found in the leaked Hacking Team archives.", "sentence_right": "In the attack against a Pharmaceutical firm, we observed the use of a compromised Government site to redirect the victim to a server hosting the Hacking Team’s 0-day Flash exploit.", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Zscaler", "context_left": "In another instance, spearphishing e-mail was used to target an organization in energy sector that resulted in installation of HttpBrowser RAT. The attacks against these organizations were largely unsuccessful as the", "context_right": "security platform blocked either the exploitation attempt or the Command & Control communication attempt. |  |", "_context_left": "The attacks against these organizations were largely unsuccessful as the ", "_context_right": " security platform blocked either the exploitation attempt or the Command & Control communication attempt.", "sentence_left": "In another instance, spearphishing e-mail was used to target an organization in energy sector that resulted in installation of HttpBrowser RAT.", "sentence_right": "|  |", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "United States", "context_left": "### Conclusion It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in", "context_right": ", Europe, Middle East, and Asia. In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "_context_left": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in ", "_context_right": ", Europe, Middle East, and Asia.", "sentence_left": "### Conclusion", "sentence_right": "In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Europe", "context_left": "### Conclusion It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States,", "context_right": ", Middle East, and Asia. In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "_context_left": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, ", "_context_right": ", Middle East, and Asia.", "sentence_left": "### Conclusion", "sentence_right": "In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Middle East", "context_left": "### Conclusion It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe,", "context_right": ", and Asia. In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "_context_left": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe, ", "_context_right": ", and Asia.", "sentence_left": "### Conclusion", "sentence_right": "In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "label": "The Middle East is a transcontinental region centered on Western Asia, Turkey (both Asian and European), and Egypt (which is mostly in North Africa). Saudi Arabia is geographically the largest Middle Eastern nation while Bahrain is the smallest. The corresponding adjective is \"Middle Eastern\" and the derived noun is \"Middle Easterner\". The term has come into wider usage as a replacement of the term Near East (as opposed to the Far East) beginning in the early 20th century.  Arabs, Turks, Persians, Kurds, and Azeris (excluding Azerbaijan) constitute the largest ethnic groups in the region by population. Arabs constitute the largest ethnic group in the region by a clear margin. Indigenous minorities of the Middle East include Jews, Baloch, Assyrians, Berbers (who primarily live in North Africa), Copts, Druze, Lurs, Mandaeans, Samaritans, Shabaks, Tats, and Zazas. European ethnic groups that form a diaspora in the region include Albanians, Bosniaks, Circassians (including Kabardians), Crimean Tatars, Greeks, Franco-Levantines, and Italo-Levantines. Among other migrant populations are Chinese, Filipinos, Indians, Indonesians, Pakistanis, Pashtuns, Romani, and sub-Saharan Africans.  The history of the Middle East dates back to ancient times, with the (geopolitical) importance of the region being recognized for millennia. Several major religions have their origins in the Middle East, including Judaism, Christianity, and Islam; the Baha'i faith, Mandaeism, Unitarian Druze, and numerous other belief systems were also established within the region.  The Middle East generally has a hot, arid climate, with several major rivers providing irrigation to support agriculture in limited areas such as the Nile Delta", "label_id": 9453, "label_title": "Middle East", "label_link": "https://en.wikipedia.org/wiki?curid=19323", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "Asia", "context_left": "### Conclusion It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe, Middle East, and", "context_right": ". In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "_context_left": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe, Middle East, and ", "_context_right": ".", "sentence_left": "### Conclusion", "sentence_right": "In order to protect themselves, it is extremely important for organizations to have SSL security inspection enabled as well as a Sandbox environment to detonate and block the 0-day exploits involved in such targeted attacks.", "label": "Asia () is Earth's largest and most populous continent, located primarily in the Eastern and Northern Hemispheres. It shares the continental landmass of Eurasia with the continent of Europe and the continental landmass of Afro-Eurasia with both Europe and Africa. Asia covers an area of , about 30% of Earth's total land area and 8.7% of the Earth's total surface area. The continent, which has long been home to the majority of the human population, was the site of many of the first civilizations. Asia is notable for not only its overall large size and population, but also dense and large settlements, as well as vast barely populated regions. Its 4.5 billion people () constitute roughly 60% of the world's population.  In general terms, Asia is bounded on the east by the Pacific Ocean, on the south by the Indian Ocean, and on the north by the Arctic Ocean. The border of Asia with Europe is a historical and cultural construct, as there is no clear physical and geographical separation between them. It is somewhat arbitrary and has moved since its first conception in classical antiquity. The division of Eurasia into two continents reflects East–West cultural, linguistic, and ethnic differences, some of which vary on a spectrum rather than with a sharp dividing line. The most commonly accepted boundaries place Asia to the east of the Suez Canal separating it from Africa; and to the east of the Turkish Straits, the Ural Mountains and Ural River, and to the south of the Caucasus Mountains", "label_id": 72, "label_title": "Asia", "label_link": "https://en.wikipedia.org/wiki?curid=689", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "In this attack, we were able to prevent the download and installation of the RAT payload.", "context_left": "| APT Attack chain targeting a multinational Pharmaceutical company |", "context_right": "In another instance, spearphishing e-mail was used to target an organization in energy sector that resulted in installation of HttpBrowser RAT.", "_context_left": "", "_context_right": "", "sentence_left": "| APT Attack chain targeting a multinational Pharmaceutical company |", "sentence_right": "In another instance, spearphishing e-mail was used to target an organization in energy sector that resulted in installation of HttpBrowser RAT.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "As noted before, this was the first instance of the ‘Emissary Panda’ group weaponizing malware payloads using the 0-day exploits found in the leaked Hacking Team archives.", "context_left": "### Attack Chain", "context_right": "We were able to confirm usage of Adobe Flash exploits CVE-2015-5119 and CVE-2015-5123 in these attacks.", "_context_left": "", "_context_right": "", "sentence_left": "### Attack Chain", "sentence_right": "We were able to confirm usage of Adobe Flash exploits CVE-2015-5119 and CVE-2015-5123 in these attacks.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "### Conclusion", "context_left": "We are still investigating some of these attack chains and will share additional details when they become available.", "context_right": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe, Middle East, and Asia.", "_context_left": "", "_context_right": "", "sentence_left": "We are still investigating some of these attack chains and will share additional details when they become available.", "sentence_right": "It is alarming to see an uptick in the activity from this group targeting multiple verticals with organizations located in United States, Europe, Middle East, and Asia.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "|  |", "context_left": "The attacker controlled server will serve and execute browser based exploits to install a RAT on the target machine.", "context_right": "| APT Attack chain targeting a multinational Pharmaceutical company |", "_context_left": "", "_context_right": "", "sentence_left": "The attacker controlled server will serve and execute browser based exploits to install a RAT on the target machine.", "sentence_right": "| APT Attack chain targeting a multinational Pharmaceutical company |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "The attacker controlled server will serve and execute browser based exploits to install a RAT on the target machine.", "context_left": "This technique is known as Strategic Web Compromise (SWC) or a Watering Hole attack, wherein a legitimate trusted website known to be visited by the target group is compromised in order to redirect them to the attacker controlled server.", "context_right": "|  |", "_context_left": "", "_context_right": "", "sentence_left": "This technique is known as Strategic Web Compromise (SWC) or a Watering Hole attack, wherein a legitimate trusted website known to be visited by the target group is compromised in order to redirect them to the attacker controlled server.", "sentence_right": "|  |", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "We are still investigating some of these attack chains and will share additional details when they become available.", "context_left": "| Emissary Panda APT attacks seen in last month |", "context_right": "### Conclusion", "_context_left": "", "_context_right": "", "sentence_left": "| Emissary Panda APT attacks seen in last month |", "sentence_right": "### Conclusion", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "August 20, 2015", "context_left": "Chinese Cyber Espionage APT Group ‘Emissary Panda’ Activity Update", "context_right": "### Introduction", "_context_left": "", "_context_right": "", "sentence_left": "Chinese Cyber Espionage APT Group ‘Emissary Panda’ Activity Update", "sentence_right": "### Introduction", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}
{"mention": "### Attack Chain", "context_left": "* Pharmaceutical", "context_right": "As noted before, this was the first instance of the ‘Emissary Panda’ group weaponizing malware payloads using the 0-day exploits found in the leaked Hacking Team archives.", "_context_left": "", "_context_right": "", "sentence_left": "* Pharmaceutical", "sentence_right": "As noted before, this was the first instance of the ‘Emissary Panda’ group weaponizing malware payloads using the 0-day exploits found in the leaked Hacking Team archives.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2015-08-20_chinese-cyber-espionage-apt-group"}