{"mention": "Zscaler", "context_left": "May 20, 2020 The", "context_right": "[ThreatLabZ](/threatlabz/threat-map-dashboard) team is continually monitoring known threats to see if they re-appear in a different form. One such threat we've kept an eye on is Amadey, a bot of Russian origin, which was first seen in late 2018.", "_context_left": "The ", "_context_right": " [ThreatLabZ](/threatlabz/threat-map-dashboard) team is continually monitoring known threats to see if they re-appear in a different form.", "sentence_left": "May 20, 2020", "sentence_right": "One such threat we've kept an eye on is Amadey, a bot of Russian origin, which was first seen in late 2018.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Russian", "context_left": "The Zscaler [ThreatLabZ](/threatlabz/threat-map-dashboard) team is continually monitoring known threats to see if they re-appear in a different form. One such threat we've kept an eye on is Amadey, a bot of", "context_right": "origin, which was first seen in late 2018. Once on a victim's machine, Amadey sends user data to a Command and Control (C&C) server and executes other tasks sent back by the C&C server.", "_context_left": "One such threat we've kept an eye on is Amadey, a bot of ", "_context_right": " origin, which was first seen in late 2018.", "sentence_left": "The Zscaler [ThreatLabZ](/threatlabz/threat-map-dashboard) team is continually monitoring known threats to see if they re-appear in a different form.", "sentence_right": "Once on a victim's machine, Amadey sends user data to a Command and Control (C&C) server and executes other tasks sent back by the C&C server.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Avast Software", "context_left": "Below are the list of antivirus product names that Amadey looks for before starting the execution: *", "context_right": "* Avira", "_context_left": "* ", "_context_right": "", "sentence_left": "Below are the list of antivirus product names that Amadey looks for before starting the execution:", "sentence_right": "* Avira", "label": "Avast Software s.r.o. is a Czech multinational cybersecurity software company headquartered in Prague, Czech Republic that researches and develops computer security software, machine learning and artificial intelligence. Avast has more than 435 million monthly active users and the largest market share among anti-malware application vendors worldwide as of January 2018. The company has approximately 1,700 employees across its 25 offices worldwide.  Avast was founded by Pavel Baudis and Eduard Kucera in 1988 as a cooperative. It had been a private company since 2010 and had its IPO in May 2018. In July 2016, Avast acquired competitor AVG Technologies for $1.3 billion. At the time, AVG was the third-ranked antivirus product. It is dual-listed on the Prague Stock Exchange and on the London Stock Exchange and is a constituent of the FTSE 250 Index.", "label_id": 406667, "label_title": "Avast", "label_link": "https://en.wikipedia.org/wiki?curid=1351756", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Avira", "context_left": "* Avast Software *", "context_right": "* Kaspersky Lab", "_context_left": "* ", "_context_right": "", "sentence_left": "* Avast Software", "sentence_right": "* Kaspersky Lab", "label": "Avira Operations GmbH & Co. KG is a German multinational security software company mainly known for their antivirus software \"Avira Internet Security\".  Avira was founded in 2006, but the anti virus application is under active development since 1986 through its predecessor company H+BEDV Datentechnik GmbH.  As of 2012, Avira software is estimated to have over 100 million customers. In June 2012, Avira ranked sixth in the antivirus market share report from OPSWAT.  Avira's headquarters are located near Lake Constance, in Tettnang, Germany. The company has additional offices in the USA, China, Romania, and the Netherlands.  The company supports the Auerbach Stiftung, a foundation created by the company's founder, Tjark Auerbach. It promotes charitable and social projects, the arts, culture and science.", "label_id": 3425443, "label_title": "Avira", "label_link": "https://en.wikipedia.org/wiki?curid=30871197", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Kaspersky", "context_left": "* Avira *", "context_right": "Lab * ESET", "_context_left": "* ", "_context_right": " Lab", "sentence_left": "* Avira", "sentence_right": "* ESET", "label": "Kaspersky Lab (; Russian: Лаборатория Касперского, \"Laboratoriya Kasperskogo\") is a multinational cybersecurity and anti-virus provider headquartered in Moscow, Russia and operated by a holding company in the United Kingdom. It was founded in 1997 by Eugene Kaspersky, Natalya Kaspersky, and Alexey De-Monderik; Eugene Kaspersky is currently the CEO. Kaspersky Lab develops and sells antivirus, internet security, password management, endpoint security, and other cybersecurity products and services.  Kaspersky expanded abroad from 2005–2010 and grew to $698 million in annual revenues by 2017, up 8% from 2016, though annual revenues were down 8% in North America due to U.S. government security concerns. As of 2016, the software has about 400 million users and has the largest market-share of cybersecurity software vendors in Europe. Kaspersky Lab ranks fourth in the global ranking of antivirus vendors by revenue. It was the first Russian company to be included into the rating of the world's leading software companies, called the Software Top 100 (79th on the list, as of 6/29/2012). Kaspersky Lab is ranked 4th in Endpoint Security segment according to IDC data for 2010. According to Gartner, Kaspersky Lab is currently the third largest vendor of consumer IT security software worldwide and the fifth largest vendor of Enterprise Endpoint Protection. Kaspersky Lab has been named a \"Leader\" in the Gartner Magic Quadrant for Endpoint Protection Platforms.  The Kaspersky Global Research and Analysis Team (GReAT) has led the discovery of sophisticated espionage platforms conducted by nations, such as Equation Group and the Stuxnet worm. Various covert government-sponsored cyber-espionage efforts", "label_id": 2647511, "label_title": "Kaspersky Lab", "label_link": "https://en.wikipedia.org/wiki?curid=22172878", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "ESET", "context_left": "* Kaspersky Lab *", "context_right": "* Panda Security", "_context_left": "* ", "_context_right": "", "sentence_left": "* Kaspersky Lab", "sentence_right": "* Panda Security", "label": "ESET is an IT security company that offers anti-virus and firewall products such as ESET NOD32. ESET is headquartered in Bratislava, Slovakia, and was awarded the recognition of the most successful Slovak company in 2008, 2009 and in 2010. It plays a significant role in overall Cybersecurity.", "label_id": 227795, "label_title": "ESET", "label_link": "https://en.wikipedia.org/wiki?curid=590228", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Panda Security", "context_left": "* ESET *", "context_right": "* Dr. Web", "_context_left": "* ", "_context_right": "", "sentence_left": "* ESET", "sentence_right": "* Dr. Web", "label": "Panda Security is a Spanish company that specializes in creating products for IT security. It started with antivirus software, and now also provides and develops cybersecurity software. This includes security products and services for both businesses and home users, and protection tools for systems, networks, emails, and other private information.", "label_id": 353291, "label_title": "Panda Security", "label_link": "https://en.wikipedia.org/wiki?curid=1114733", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Bitdefender", "context_left": "* 360 Total Security *", "context_right": "* Norton", "_context_left": "* ", "_context_right": "", "sentence_left": "* 360 Total Security", "sentence_right": "* Norton", "label": "Bitdefender is a Romanian cybersecurity and anti-virus software company. It was founded in 2001 by Florin Talpes who is currently the CEO. Bitdefender develops and sells anti-virus software, internet security software, endpoint security software, and other cybersecurity products and services.  As of 2018, the software has about 500 million users worldwide.", "label_id": 1780391, "label_title": "Bitdefender", "label_link": "https://en.wikipedia.org/wiki?curid=12807844", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Sophos", "context_left": "* Norton *", "context_right": "* Comodo", "_context_left": "* ", "_context_right": "", "sentence_left": "* Norton", "sentence_right": "* Comodo", "label": "Sophos Group plc is a British security software and hardware company. Sophos develops products for communication endpoint, encryption, network security, email security, mobile security and unified threat management. Sophos is primarily focused on providing security software to the mid market and pragmatic enterprise from 100- to 5,000-seat organizations. Whilst not a primary focus, Sophos also protects home users, through free antivirus software (Sophos Home) intended to demonstrate product functionality. It is listed on the London Stock Exchange and is a constituent of the FTSE 250 Index.", "label_id": 260635, "label_title": "Sophos", "label_link": "https://en.wikipedia.org/wiki?curid=713412", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}
{"mention": "Canada", "context_left": "*Figure 10: The POST parameters of Amadey-C&C communication.* We looked at the C&C panel associated with the payload that we analyzed and discovered that a large percentage (56 percent) of infected systems are based in", "context_right": ". ![LiveCP](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Amadey/live_control_panel.JPG)", "_context_left": "We looked at the C&C panel associated with the payload that we analyzed and discovered that a large percentage (56 percent) of infected systems are based in ", "_context_right": ".", "sentence_left": "*Figure 10: The POST parameters of Amadey-C&C communication.*", "sentence_right": "![LiveCP](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Amadey/live_control_panel.JPG)", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-05-20_latest-version-amadey-introduces-screen"}