{"mention": "Adobe", "context_left": "| Checking to see what version of", "context_right": "is installed.", "_context_left": "| Checking to see what version of ", "_context_right": " is installed.", "sentence_left": "|  |", "sentence_right": "|", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-03-12_lightsout-ek-targets-energy-sector"}
{"mention": "The purpose of this is to pass along diagnostics to the attacker so that the proper malicious package is sent to the victim.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "The compromise leads the victim to another site which provides the attacker with a specific user-agent in the URL field.", "sentence_right": "This should be taken as a point of identification in administrator logs as this may indicate an attack on your network.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2014-03-12_lightsout-ek-targets-energy-sector"}