{"mention": "Rio", "context_left": "Zika isn't the Only Thing You Need to Worry About During the", "context_right": "Olympics", "_context_left": "Zika isn't the Only Thing You Need to Worry About During the ", "_context_right": " Olympics", "sentence_left": "", "sentence_right": "July 15, 2016", "label": "Rio de Janeiro (; ; \"River of January\"), or simply Rio, is anchor to the Rio de Janeiro metropolitan area and the second-most populous municipality in Brazil and the sixth-most populous in the Americas. Rio de Janeiro is the capital of the state of Rio de Janeiro, Brazil's third-most populous state. Part of the city has been designated as a World Heritage Site, named \"\"Rio de Janeiro: Carioca Landscapes between the Mountain and the Sea\"\", by UNESCO on 1 July 2012 as a Cultural Landscape.  Founded in 1565 by the Portuguese, the city was initially the seat of the Captaincy of Rio de Janeiro, a domain of the Portuguese Empire. Later, in 1763, it became the capital of the State of Brazil, a state of the Portuguese Empire. In 1808, when the Portuguese Royal Court transferred itself from Portugal to Brazil, Rio de Janeiro became the chosen seat of the court of Queen Maria I of Portugal, who subsequently, in 1815, under the leadership of her son, the Prince Regent, and future King Joao VI of Portugal, raised Brazil to the dignity of a kingdom, within the United Kingdom of Portugal, Brazil, and Algarves. Rio stayed the capital of the pluricontinental Lusitanian monarchy until 1822, when the War of Brazilian Independence began. This is one of the few instances in history that the capital of a colonising country officially shifted to a city in one of its colonies. Rio de Janeiro subsequently served as the capital of the independent monarchy, the Empire of Brazil,", "label_id": 12848, "label_title": "Rio de Janeiro", "label_link": "https://en.wikipedia.org/wiki?curid=25936", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "Rio de Janeiro", "context_left": "In just a few weeks, thousands of athletes and fans from around the world will gather in", "context_right": "for one of the world's most widely anticipated international sporting events, the Olympics.", "_context_left": "In just a few weeks, thousands of athletes and fans from around the world will gather in ", "_context_right": " for one of the world's most widely anticipated international sporting events, the Olympics.", "sentence_left": "July 15, 2016", "sentence_right": "However, as one of the most popular events, the Olympics also entices cyber criminals and scamsters to take advantage of unsuspecting users who might be searching for related news, the event schedule, online streams, or even the Zika virus impact.", "label": "Rio de Janeiro (; ; \"River of January\"), or simply Rio, is anchor to the Rio de Janeiro metropolitan area and the second-most populous municipality in Brazil and the sixth-most populous in the Americas. Rio de Janeiro is the capital of the state of Rio de Janeiro, Brazil's third-most populous state. Part of the city has been designated as a World Heritage Site, named \"\"Rio de Janeiro: Carioca Landscapes between the Mountain and the Sea\"\", by UNESCO on 1 July 2012 as a Cultural Landscape.  Founded in 1565 by the Portuguese, the city was initially the seat of the Captaincy of Rio de Janeiro, a domain of the Portuguese Empire. Later, in 1763, it became the capital of the State of Brazil, a state of the Portuguese Empire. In 1808, when the Portuguese Royal Court transferred itself from Portugal to Brazil, Rio de Janeiro became the chosen seat of the court of Queen Maria I of Portugal, who subsequently, in 1815, under the leadership of her son, the Prince Regent, and future King Joao VI of Portugal, raised Brazil to the dignity of a kingdom, within the United Kingdom of Portugal, Brazil, and Algarves. Rio stayed the capital of the pluricontinental Lusitanian monarchy until 1822, when the War of Brazilian Independence began. This is one of the few instances in history that the capital of a colonising country officially shifted to a city in one of its colonies. Rio de Janeiro subsequently served as the capital of the independent monarchy, the Empire of Brazil,", "label_id": 12848, "label_title": "Rio de Janeiro", "label_link": "https://en.wikipedia.org/wiki?curid=25936", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "South Africa", "context_left": "Our second case involves the compromised", "context_right": "Gymnastic Federation website, which is leading users to Neutrino Exploit Kit via an injected script.", "_context_left": "Our second case involves the compromised ", "_context_right": " Gymnastic Federation website, which is leading users to Neutrino Exploit Kit via an injected script.", "sentence_left": "**Case 2**:", "sentence_right": "When examining the website's code, we can see the Flash object for the EITest redirector embedded towards the bottom of the page.", "label": "South Africa, officially the Republic of South Africa (RSA), is the southernmost country in Africa. It is bounded to the south by of coastline of Southern Africa stretching along the South Atlantic and Indian Oceans; to the north by the neighbouring countries of Namibia, Botswana, and Zimbabwe; and to the east and northeast by Mozambique and Eswatini (Swaziland); and it surrounds the enclaved country of Lesotho. South Africa is the largest country in Southern Africa and the 25th-largest country in the world by land area and, with over 57 million people, is the world's 24th-most populous nation. It is the southernmost country on the mainland of the Old World or the Eastern Hemisphere. About 80 percent of South Africans are of Bantu ancestry, divided among a variety of ethnic groups speaking different African languages, nine of which have official status. The remaining population consists of Africa's largest communities of European, Asian (Indian), and multiracial (Coloured) ancestry.  South Africa is a multiethnic society encompassing a wide variety of cultures, languages, and religions. Its pluralistic makeup is reflected in the constitution's recognition of 11 official languages, which is the fourth-highest number in the world. Two of these languages are of European origin: Afrikaans developed from Dutch and serves as the first language of most coloured and white South Africans; English reflects the legacy of British colonialism, and is commonly used in public and commercial life, though it is fourth-ranked as a spoken first language. The country is one of the few in Africa never to have", "label_id": 2197667, "label_title": "South Africa", "label_link": "https://en.wikipedia.org/wiki?curid=17416221", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "Adobe", "context_left": "Users should always make sure that", "context_right": "Flash Players Auto-Update feature is enabled, and it is highly recommended to leverage click-to-play functionality in web browsers.", "_context_left": "Users should always make sure that ", "_context_right": " Flash Players Auto-Update feature is enabled, and it is highly recommended to leverage click-to-play functionality in web browsers.", "sentence_left": "We’ve reported on previous cases where compromised sites can cause [ransomware infections](/blogs/research/chinese-government-website-compromised-leads-angler) or [worse](/blogs/research/neutrino-malvertising-campaign-drops-gamarue), and this continues to be true with the examples covered today.", "sentence_right": "These steps can greatly reduce users' exposure to vulnerabilities.", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "Following the EITest gate is a Neutrino landing page and SWF payload.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "![compromised.png](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/downloads/blog-image-2-1501492995.png)", "sentence_right": "Upon successful exploit run, the ransomware CryptXXX is delivered to the victim's machine.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "* Always ensure that your operating system and web browser have the latest security patches installed", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* Use two-factor authentication whenever possible especially on sensitive accounts such as those used for banking", "sentence_right": "* Use browser add-ons like Adblock Plus to block popups and potential malvertisements", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "* Steer clear of unofficial mobile application stores", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Be wary of any suspicious attachments", "sentence_right": "* Check the authenticity of the URL or website address before clicking on a link", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}
{"mention": "As we get closer to the event, we expect to see a rise in threats and scams leveraging Olympics topics to target a large number of victims.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "These steps can greatly reduce users' exposure to vulnerabilities.", "sentence_right": "Zscaler's standard security checklist - Olympics Edition:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2016-07-15_zika-isnt-only-thing-you"}