{"mention": "Europe", "context_left": "Emotet, the credential stealing banking Trojan, was first reported in 2014 when it wreaked havoc in", "context_right": "and the United States.", "_context_left": "Emotet, the credential stealing banking Trojan, was first reported in 2014 when it wreaked havoc in ", "_context_right": " and the United States.", "sentence_left": "**Introduction**", "sentence_right": "The Zscaler Threat Research team has been monitoring the new variant of Emotet since April 2017 and has recently seen a spike in Emotet related spam activity.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-08-23_look-recent-emotet-campaigns-august"}
{"mention": "United States", "context_left": "Emotet, the credential stealing banking Trojan, was first reported in 2014 when it wreaked havoc in Europe and the", "context_right": ".", "_context_left": "Emotet, the credential stealing banking Trojan, was first reported in 2014 when it wreaked havoc in Europe and the ", "_context_right": ".", "sentence_left": "**Introduction**", "sentence_right": "The Zscaler Threat Research team has been monitoring the new variant of Emotet since April 2017 and has recently seen a spike in Emotet related spam activity.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-08-23_look-recent-emotet-campaigns-august"}
{"mention": "Zscaler", "context_left": "The", "context_right": "Threat Research team has been monitoring the new variant of Emotet since April 2017 and has recently seen a spike in Emotet related spam activity.", "_context_left": "The ", "_context_right": " Threat Research team has been monitoring the new variant of Emotet since April 2017 and has recently seen a spike in Emotet related spam activity.", "sentence_left": "Emotet, the credential stealing banking Trojan, was first reported in 2014 when it wreaked havoc in Europe and the United States.", "sentence_right": "Emotet is a multi-component malware which specializes in a multitude of nefarious activities, including stealing credentials from browsers and mail clients, banking theft via Man-in-the-Browser attack, email harvesting and propagation through spam emails from infected systems.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-08-23_look-recent-emotet-campaigns-august"}
{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers.", "_context_left": "", "_context_right": " ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers.", "sentence_left": "There have been reports of Emotet variants with network spreading features but none of the payloads we are seeing in the recent campaigns have this feature.", "sentence_right": "Technical Analysis by Manohar Ghule.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-08-23_look-recent-emotet-campaigns-august"}
{"mention": "Zscaler", "context_left": "Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for", "context_right": "customers.", "_context_left": "Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for ", "_context_right": " customers.", "sentence_left": "There have been reports of Emotet variants with network spreading features but none of the payloads we are seeing in the recent campaigns have this feature.", "sentence_right": "Technical Analysis by Manohar Ghule.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-08-23_look-recent-emotet-campaigns-august"}