{"mention": "Google", "context_left": "This campaign attempts to disguise itself as a benign", "context_right": "Analytics library, in one instance naming the injected script “googleanalytics.js”.", "_context_left": "This campaign attempts to disguise itself as a benign ", "_context_right": " Analytics library, in one instance naming the injected script “googleanalytics.js”.", "sentence_left": "Each of these domains hosts slight variations of the same scripts, but they all have the common purpose to launch the JavaScript keylogger and initiate a cryptocurrency mining script.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/downloads/blog-image-1-1522318983.png)", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-02-02_compromised-wordpress-sites-stealing-credentials"}
{"mention": "Yandex", "context_left": "The contents of this script are designed to look like legitimate software, with references to", "context_right": "statistics tracking and variable names that imply the functionality of a linter (software that is used to find programming errors in source code).", "_context_left": "The contents of this script are designed to look like legitimate software, with references to ", "_context_right": " statistics tracking and variable names that imply the functionality of a linter (software that is used to find programming errors in source code).", "sentence_left": "*Figure 4: cdns[.]ws/lib/kl.js keylogger script, deobfuscated*", "sentence_right": "The script connects to a the URL obfuscated at the top of the script using the WebSocket protocol and reports observed keystrokes.", "label": "Yandex N.V. (; ) is a Russian multinational corporation specializing in Internet-related products and services, including search and information services, eCommerce, transportation, navigation, mobile applications, and online advertising. Yandex provides over 70 services in total. Incorporated in the Netherlands, Yandex primarily serves audiences in Russia and the Commonwealth of Independent States. The company founders and most of the team members are located in Russia. The company has 18 commercial offices worldwide.  It is the largest technology company in Russia and the largest search engine on the internet in Russian, with a market share of over 52%. The Yandex.ru home page is the 4th most popular website in Russia. It also has the largest market share of any search engine in the Commonwealth of Independent States and is the 5th largest search engine worldwide after Google, Baidu, Bing, and Yahoo!.  Yandex's main competitors on the Russian market are Google, Mail.ru, and Rambler.  According to the company, one of its biggest advantages for Russian-language users is the ability to recognize Russian inflection in search queries.  Yandex has invested in companies including Vizi Labs, Face.com, Blekko, Seismotech, Multiship, SalesPredict, and Doc+.", "label_id": 732786, "label_title": "Yandex", "label_link": "https://en.wikipedia.org/wiki?curid=3099107", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-02-02_compromised-wordpress-sites-stealing-credentials"}
{"mention": "Zscaler", "context_left": "", "context_right": "protects against this threat, including coverage for both the keylogger and the coin miner parts of the campaign.", "_context_left": "", "_context_right": " protects against this threat, including coverage for both the keylogger and the coin miner parts of the campaign.", "sentence_left": "This particular campaign, however, is interesting in that it does not require direct user interaction (e.g. with a phishing page) and does not install malicious software on the victim’s computer (e.g. with an exploit kit), instead opting to passively record user and administrator keystrokes and silently run cryptocurrency mining scripts in the background.", "sentence_right": "", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-02-02_compromised-wordpress-sites-stealing-credentials"}