{"mention": "Zscaler", "context_left": "There's no doubt that ransomware is one of the most popular malware threats of 2014.", "context_right": "is not alone in this opinion, as other security firms have observed up to a [700% increase](http://www.theregister.co.uk/2014/09/12/file_scrambling_ransomware_plague/) in infection rates to ransom-like malicious activity on victim PCs. It's no wonder the attacks are so effective when for example, the delivery mechanism is designed to impersonate a legitimate service such as a harmless eFax.", "_context_left": "", "_context_right": " is not alone in this opinion, as other security firms have observed up to a [700% increase](http://www.theregister.co.uk/2014/09/12/file_scrambling_ransomware_plague/) in infection rates to ransom-like malicious activity on victim PCs.", "sentence_left": "There's no doubt that ransomware is one of the most popular malware threats of 2014.", "sentence_right": "It's no wonder the attacks are so effective when for example, the delivery mechanism is designed to impersonate a legitimate service such as a harmless eFax.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-10-27_crypto-ransomware-running-rampant"}
{"mention": "Australian", "context_left": "Attackers will often pose as legitimate services, such as a law enforcement agency or a mass media outlet, in order to lure the unsuspecting victim into their scheme. We recently encountered a ransomware campaign leveraging phishing e-mails purporting to be from the", "context_right": "Postal Services. The spam campaign themes used by the attackers involve tracking services or mobile invoices containing a link to the malicious content.", "_context_left": "We recently encountered a ransomware campaign leveraging phishing e-mails purporting to be from the ", "_context_right": " Postal Services.", "sentence_left": "Attackers will often pose as legitimate services, such as a law enforcement agency or a mass media outlet, in order to lure the unsuspecting victim into their scheme.", "sentence_right": "The spam campaign themes used by the attackers involve tracking services or mobile invoices containing a link to the malicious content.", "label": "Australia, officially the Commonwealth of Australia, is a sovereign country comprising the mainland of the Australian continent, the island of Tasmania, and numerous smaller islands. It is the largest country in Oceania and the world's sixth-largest country by total area. The neighbouring countries are Papua New Guinea, Indonesia, and East Timor to the north; the Solomon Islands and Vanuatu to the north-east; and New Zealand to the south-east. The population of / 1000000 round 0 million is highly urbanised and heavily concentrated on the eastern seaboard. Australia's capital is Canberra, and its largest city is Sydney. The country's other major metropolitan areas are Melbourne, Brisbane, Perth, and Adelaide.  Indigenous Australians inhabited the continent for about 65,000 years prior to European discovery with the arrival of Dutch explorers in the early 17th century, who named it New Holland. In 1770, Australia's eastern half was claimed by Great Britain and initially settled through penal transportation to the colony of New South Wales from 26 January 1788, a date which became Australia's national day. The population grew steadily in subsequent decades, and by the time of an 1850s gold rush, most of the continent had been explored and an additional five self-governing crown colonies established. On 1 January 1901, the six colonies federated, forming the Commonwealth of Australia. Australia has since maintained a stable liberal democratic political system that functions as a federal parliamentary constitutional monarchy, comprising six states and ten territories.  Being the oldest, flattest and driest inhabited continent, with the least fertile soils, Australia", "label_id": 959820, "label_title": "Australia", "label_link": "https://en.wikipedia.org/wiki?curid=4689264", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-10-27_crypto-ransomware-running-rampant"}
{"mention": "Zscaler", "context_left": "A few do were still live at the time of the research.", "context_right": "inspected the associated IP addresses and found them to be hosted in the Russian Federation. The two server IP addresses of note at the time of the blog are **46.161.30.20** and **46.161.30.19**.", "_context_left": "", "_context_right": " inspected the associated IP addresses and found them to be hosted in the Russian Federation.", "sentence_left": "A few do were still live at the time of the research.", "sentence_right": "The two server IP addresses of note at the time of the blog are **46.161.30.20** and **46.161.30.19**.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-10-27_crypto-ransomware-running-rampant"}
{"mention": "Russian", "context_left": "A few do were still live at the time of the research. Zscaler inspected the associated IP addresses and found them to be hosted in the", "context_right": "Federation. The two server IP addresses of note at the time of the blog are **46.161.30.20** and **46.161.30.19**.", "_context_left": "Zscaler inspected the associated IP addresses and found them to be hosted in the ", "_context_right": " Federation.", "sentence_left": "A few do were still live at the time of the research.", "sentence_right": "The two server IP addresses of note at the time of the blog are **46.161.30.20** and **46.161.30.19**.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-10-27_crypto-ransomware-running-rampant"}
{"mention": "US-CERT", "context_left": "Administrators should be on the lookout for the above connections as they likely indicate a compromised system. Given how prevalent this threat is, the [U](https://www.us-cert.gov/ncas/alerts/TA14-295A)[.](https://www.us-cert.gov/ncas/alerts/TA14-295A)[S. Government](https://www.us-cert.gov/ncas/alerts/TA14-295A) recently released an associated alert on the", "context_right": "site. Taking regular backups of your personal files remains a user's best chance at mitigating the threat if they have been hit by this attack.", "_context_left": "Given how prevalent this threat is, the [U](https://www.us-cert.gov/ncas/alerts/TA14-295A)[.](https://www.us-cert.gov/ncas/alerts/TA14-295A)[S. Government](https://www.us-cert.gov/ncas/alerts/TA14-295A) recently released an associated alert on the ", "_context_right": " site.", "sentence_left": "Administrators should be on the lookout for the above connections as they likely indicate a compromised system.", "sentence_right": "Taking regular backups of your personal files remains a user's best chance at mitigating the threat if they have been hit by this attack.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2014-10-27_crypto-ransomware-running-rampant"}