{"mention": "Ransomware", "context_left": "Aug 18, 2021", "context_right": "is a top threat that security teams should be tailoring their systems to defend against. But in order to do so, they may need to look further than the ransomware itself.", "_context_left": "", "_context_right": " is a top threat that security teams should be tailoring their systems to defend against.", "sentence_left": "Aug 18, 2021", "sentence_right": "But in order to do so, they may need to look further than the ransomware itself.", "label": "Ransomware is a type of malware from cryptovirology that threatens to publish the victim's data or perpetually block access to it unless a ransom is paid. While some simple ransomware may lock the system in a way which is not difficult for a knowledgeable person to reverse, more advanced malware uses a technique called cryptoviral extortion, in which it encrypts the victim's files, making them inaccessible, and demands a ransom payment to decrypt them. In a properly implemented cryptoviral extortion attack, recovering the files without the decryption key is an intractable problem – and difficult to trace digital currencies such as Ukash or Bitcoin and other cryptocurrency are used for the ransoms, making tracing and prosecuting the perpetrators difficult.  Ransomware attacks are typically carried out using a Trojan that is disguised as a legitimate file that the user is tricked into downloading or opening when it arrives as an email attachment. However, one high-profile example, the \"WannaCry worm\", travelled automatically between computers without user interaction.  Starting from around 2012 the use of ransomware scams has grown internationally. There were 181.5 million ransomware attacks in the first six months of 2018. This marks a 229% increase over this same time frame in 2017. In June 2014, vendor McAfee released data showing that it had collected more than double the number of samples of ransomware that quarter than it had in the same quarter of the previous year. CryptoLocker was particularly successful, procuring an estimated US $3 million before it was taken down by authorities,", "label_id": 518576, "label_title": "Ransomware", "label_link": "https://en.wikipedia.org/wiki?curid=1906321", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-08-18_information-stealer-ransomware-account-takeover"}
{"mention": "Malware", "context_left": "The activity that Intel 471 analysts observe on the cybercrime underground has changed a bit with the rise of ransomware.", "context_right": "that has been used for traditional fraud schemes — particularly information stealers — has also been co-opted into the cycle of ransomware campaigns. While serving a reliable method for criminals to obtain credentials tied to financial accounts, they are now using information stealers to also go after corporate remote network login credentials, like virtual private networks (VPNs) or remote desktop software.", "_context_left": "", "_context_right": " that has been used for traditional fraud schemes — particularly information stealers — has also been co-opted into the cycle of ransomware campaigns.", "sentence_left": "The activity that Intel 471 analysts observe on the cybercrime underground has changed a bit with the rise of ransomware.", "sentence_right": "While serving a reliable method for criminals to obtain credentials tied to financial accounts, they are now using information stealers to also go after corporate remote network login credentials, like virtual private networks (VPNs) or remote desktop software.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-08-18_information-stealer-ransomware-account-takeover"}
{"mention": "Apple", "context_left": "* **Inventory management:** Have an inventory of what network equipment, devices and software are being used on your systems. If you are suddenly seeing logins from", "context_right": "devices, and you know that you are solely running Windows machines, it should send up a flag that something is amiss. * **Organizational buy-in:** To those not in the cybersecurity trenches, opting for convenience over security is going to be the default mindset.", "_context_left": "If you are suddenly seeing logins from ", "_context_right": " devices, and you know that you are solely running Windows machines, it should send up a flag that something is amiss.", "sentence_left": "* **Inventory management:** Have an inventory of what network equipment, devices and software are being used on your systems.", "sentence_right": "* **Organizational buy-in:** To those not in the cybersecurity trenches, opting for convenience over security is going to be the default mindset.", "label": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California, that designs, develops, and sells consumer electronics, computer software, and online services. It is considered one of the Big Four tech companies along with Amazon, Google, and Facebook.  The company's hardware products include the iPhone smartphone, the iPad tablet computer, the Mac personal computer, the iPod portable media player, the Apple Watch smartwatch, the Apple TV digital media player, the AirPods wireless earbuds and the HomePod smart speaker. Apple's software includes the macOS, iOS, iPadOS, watchOS, and tvOS operating systems, the iTunes media player, the Safari web browser, and the iLife and iWork creativity and productivity suites, as well as professional applications like Final Cut Pro, Logic Pro, and Xcode. Its online services include the iTunes Store, the iOS App Store, Mac App Store, Apple Music, Apple TV+, iMessage, and iCloud. Other services include Apple Store, Genius Bar, AppleCare, Apple Pay, Apple Pay Cash, and Apple Card.  Apple was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne in April 1976 to develop and sell Wozniak's Apple I personal computer, though Wayne sold his share back within 12 days. It was incorporated as Apple Computer, Inc., in January 1977, and sales of its computers, including the Apple II, grew quickly. Within a few years, Jobs and Wozniak had hired a staff of computer designers and had a production line. Apple went public in 1980 to instant financial success. Over the next few years, Apple shipped new computers featuring innovative graphical user", "label_id": 140, "label_title": "Apple Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=856", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-08-18_information-stealer-ransomware-account-takeover"}