{"mention": "Iran’s", "context_left": "", "context_right": "domestic espionage: Lessons from recent data leaks Jul 08, 2020", "_context_left": "", "_context_right": " domestic espionage: Lessons from recent data leaks", "sentence_left": "", "sentence_right": "Jul 08, 2020", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "By the Intel 471 Global Research Team. In the last decade,", "context_right": "has undergone a quiet revolution. Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "_context_left": "In the last decade, ", "_context_right": " has undergone a quiet revolution.", "sentence_left": "By the Intel 471 Global Research Team.", "sentence_right": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranians", "context_left": "In the last decade, Iran has undergone a quiet revolution. Since the“Green Movement” uprising in 2009, more", "context_right": "have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "_context_left": "Since the“Green Movement” uprising in 2009, more ", "_context_right": " have dared to openly oppose their regime.", "sentence_left": "In the last decade, Iran has undergone a quiet revolution.", "sentence_right": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Lebanon", "context_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in", "context_right": ", Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian. There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "_context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in ", "_context_right": ", Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "sentence_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "sentence_right": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "label": "Lebanon (; ; ; ), officially known as the Lebanese Republic ( ; ; ), is a country in Western Asia. It is bordered by Syria to the north and east and Israel to the south, while Cyprus is west across the Mediterranean Sea. Lebanon's location at the crossroads of the Mediterranean Basin and the Arabian hinterland facilitated its rich history and shaped a cultural identity of religious and ethnic diversity. At just 10,452 km (4,036 sq. mi.), it is the smallest recognized sovereign state on the mainland Asian continent.  The earliest evidence of civilization in Lebanon dates back more than seven thousand years, predating recorded history. Lebanon was the home of the Canaanites/Phoenicians and their kingdoms, a maritime culture that flourished for over a thousand years (c. 1550–539 BC). In 64 BC, the region came under the rule of the Roman Empire, and eventually became one of the Empire's leading centers of Christianity. In the Mount Lebanon range a monastic tradition known as the Maronite Church was established. As the Arab Muslims conquered the region, the Maronites held onto their religion and identity. However, a new religious group, the Druze, established themselves in Mount Lebanon as well, generating a religious divide that has lasted for centuries. During the Crusades, the Maronites re-established contact with the Roman Catholic Church and asserted their communion with Rome. The ties they established with the Latins have influenced the region into the modern era.  The region eventually was ruled by the Ottoman Empire from 1516 to 1918. Following", "label_id": 8597, "label_title": "Lebanon", "label_link": "https://en.wikipedia.org/wiki?curid=17771", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Syria", "context_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon,", "context_right": ", Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian. There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "_context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, ", "_context_right": ", Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "sentence_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "sentence_right": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "label": "Syria (), officially the Syrian Arab Republic (), is a country in Western Asia, bordering Lebanon to the southwest, the Mediterranean Sea to the west, Turkey to the north, Iraq to the east, Jordan to the south, and Israel to the southwest. A country of fertile plains, high mountains, and deserts, Syria is home to diverse ethnic and religious groups, including Syrian Arabs, Greeks, Armenians, Assyrians, Kurds, Circassians, Mandeans and Turkemens. Religious groups include Sunnis, Christians, Alawites, Druze, Isma'ilis, Mandeans, Shiites, Salafis, Yazidis, and Jews. Sunnis make up the largest religious group in Syria.  Syria is a unitary republic consisting of 14 governorates and is the only country that politically espouses Ba'athism. It is a member of one international organization other than the United Nations, the Non-Aligned Movement; it has become suspended from the Arab League in November 2011 and the Organisation of Islamic Cooperation, and self-suspended from the Union for the Mediterranean.  In English, the name \"Syria\" was formerly synonymous with the Levant (The region of Syria, known in Arabic as \"al-Sham\"), while the modern state encompasses the sites of several ancient kingdoms and empires, including the Eblan civilization of the 3rd millennium BC. Aleppo and the capital city Damascus are among the oldest continuously inhabited cities in the world. In the Islamic era, Damascus was the seat of the Umayyad Caliphate and a provincial capital of the Mamluk Sultanate in Egypt. The modern Syrian state was established in the mid-20th century after centuries of Ottoman and a brief period French mandate,", "label_id": 1288506, "label_title": "Syria", "label_link": "https://en.wikipedia.org/wiki?curid=7515849", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iraq", "context_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria,", "context_right": ", Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian. There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "_context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, ", "_context_right": ", Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "sentence_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "sentence_right": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "label": "Iraq (, or ; '; '), officially the Republic of Iraq ( '; '), is a country in Western Asia, bordered by Turkey to the north, Iran to the east, Kuwait to the southeast, Saudi Arabia to the south, Jordan to the southwest and Syria to the west. The capital, and largest city, is Baghdad. Iraq is home to diverse ethnic groups including Arabs, Kurds, Chaldeans, Assyrians, Turkmen, Shabakis, Yazidis, Armenians, Mandeans, Circassians and Kawliya. Around 95% of the country's /1e6 round 0 million citizens are Muslims, with Christianity, Yarsan, Yezidism and Mandeanism also present. The official languages of Iraq are Arabic and Kurdish.  Iraq has a coastline measuring on the northern Persian Gulf and encompasses the Mesopotamian Alluvial Plain, the northwestern end of the Zagros mountain range and the eastern part of the Syrian Desert. Two major rivers, the Tigris and Euphrates, run south through Iraq and into the Shatt al-Arab near the Persian Gulf. These rivers provide Iraq with significant amounts of fertile land.  The region between the Tigris and Euphrates rivers, historically known as Mesopotamia, is often referred to as the cradle of civilisation. It was here that mankind first began to read, write, create laws and live in cities under an organised government—notably Uruk, from which \"Iraq\" is derived. The area has been home to successive civilisations since the 6th millennium BC. Iraq was the centre of the Akkadian, Sumerian, Assyrian, Chaldean Empire, and Babylonian empires. It was also part of the Median, Achaemenid, Hellenistic, Parthian, Sassanid, Roman, Rashidun,", "label_id": 1288520, "label_title": "Iraq", "label_link": "https://en.wikipedia.org/wiki?curid=7515928", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Yemen", "context_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq,", "context_right": "and others, amid a deteriorating socioeconomic situation of the average Iranian. There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "_context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, ", "_context_right": " and others, amid a deteriorating socioeconomic situation of the average Iranian.", "sentence_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "sentence_right": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "label": "Yemen (; ), officially the Republic of Yemen (, literally \"Yemeni Republic\"), is a country at the southern end of the Arabian Peninsula in Western Asia. It is the second-largest Arab sovereign state in the peninsula, occupying . The coastline stretches for about . It is bordered by Saudi Arabia to the north, the Red Sea to the west, the Gulf of Aden and Guardafui Channel to the south, and the Arabian Sea and Oman to the east. Yemen's territory encompasses more than 200 islands, including the largest island in the Middle East, Socotra. Yemen is a member of the Arab League, United Nations, Non-Aligned Movement and the Organisation of Islamic Cooperation.  Yemen's constitutionally stated capital is the city of Sana'a, but the city has been under Houthi rebel control since February 2015. Yemen is a developing country and the most corrupt country in the Arab world. In 2019, the United Nations reported that Yemen is the country with the most people in need of humanitarian aid in the world with 24.1 million.  Historically, Yemen was the home of the Sabaeans, a trading state that flourished for over a thousand years and also included parts of modern-day Ethiopia and Eritrea. In 275 CE, the region came under the rule of the later Jewish-influenced Himyarite Kingdom. Christianity arrived in the fourth century. Islam spread quickly in the seventh century and Yemenite troops were crucial in the expansion of the early Islamic conquests. Administration of Yemen has long been notoriously difficult. Several dynasties emerged from", "label_id": 155810, "label_title": "Yemen", "label_link": "https://en.wikipedia.org/wiki?curid=350939", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime. The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average", "context_right": ". There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "_context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average ", "_context_right": ".", "sentence_left": "Since the“Green Movement” uprising in 2009, more Iranians have dared to openly oppose their regime.", "sentence_right": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran’s", "context_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian. There was a lot of talk in the past about", "context_right": "espionage measures and offensive cyber activities targeting other countries. However, growing domestic unrest prompted the Iranian regime to invest more resources in developing espionage capabilities aimed against its own citizens.", "_context_left": "There was a lot of talk in the past about ", "_context_right": " espionage measures and offensive cyber activities targeting other countries.", "sentence_left": "The reasons include accusations of elections tampering, global sanctions, increased inflation, heavy investment of state funds in the nuclear and arming programs, and ambitious regional policies in Lebanon, Syria, Iraq, Yemen and others, amid a deteriorating socioeconomic situation of the average Iranian.", "sentence_right": "However, growing domestic unrest prompted the Iranian regime to invest more resources in developing espionage capabilities aimed against its own citizens.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries. However, growing domestic unrest prompted the", "context_right": "regime to invest more resources in developing espionage capabilities aimed against its own citizens. Additionally, the regime carried out tough measures against civil uprisings such as cutting off the internet in the country for long periods of time and killing hundreds of protestors.", "_context_left": "However, growing domestic unrest prompted the ", "_context_right": " regime to invest more resources in developing espionage capabilities aimed against its own citizens.", "sentence_left": "There was a lot of talk in the past about Iran’s espionage measures and offensive cyber activities targeting other countries.", "sentence_right": "Additionally, the regime carried out tough measures against civil uprisings such as cutting off the internet in the country for long periods of time and killing hundreds of protestors.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "Additionally, the regime carried out tough measures against civil uprisings such as cutting off the internet in the country for long periods of time and killing hundreds of protestors. During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by", "context_right": "security forces. Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "_context_left": "During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by ", "_context_right": " security forces.", "sentence_left": "Additionally, the regime carried out tough measures against civil uprisings such as cutting off the internet in the country for long periods of time and killing hundreds of protestors.", "sentence_right": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Persian", "context_left": "During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by Iranian security forces. Among the top whistleblowers are operators of the Lab Dookhtegan (translated in", "context_right": "as “stitched lips”) Telegram channel and an activist named Masoud Molavi. Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "_context_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in ", "_context_right": " as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "sentence_left": "During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by Iranian security forces.", "sentence_right": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Telegram", "context_left": "During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by Iranian security forces. Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”)", "context_right": "channel and an activist named Masoud Molavi. Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "_context_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) ", "_context_right": " channel and an activist named Masoud Molavi.", "sentence_left": "During the past year, a number of online activists have leaked what they claim to be inside information about the regime’s surveillance methods, in an attempt to expose the unethical tactics used by Iranian security forces.", "sentence_right": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi. Molavi, assassinated by", "context_right": "agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information. The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "_context_left": "Molavi, assassinated by ", "_context_right": " agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "sentence_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "sentence_right": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Telegram", "context_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi. Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box", "context_right": "channel that was responsible for many notable leaks of Iranian government information. The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "_context_left": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box ", "_context_right": " channel that was responsible for many notable leaks of Iranian government information.", "sentence_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "sentence_right": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian government", "context_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi. Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of", "context_right": "information. The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "_context_left": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of ", "_context_right": " information.", "sentence_left": "Among the top whistleblowers are operators of the Lab Dookhtegan (translated in Persian as “stitched lips”) Telegram channel and an activist named Masoud Molavi.", "sentence_right": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "label": "The Government of the Islamic Republic of Iran (, known simply as Nezam () is the ruling state and current political system in Iran, in power since the revolution and fall of Pahlavi dynasty in 1979.  Its constitution, adopted by a referendum, uses separation of powers model with Executive, Legislative, and Judicial systems, while the Supreme Leader is the country's head of state and commander-in-chief of the armed forces.  It is currently one of the four governments using the title Islamic republic.", "label_id": 5106680, "label_title": "Government of the Islamic Republic of Iran", "label_link": "https://en.wikipedia.org/wiki?curid=50913538", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information. The series of leaks uncovered hundreds of documents that offer a glimpse into the way", "context_right": "is spying on its own people. According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "_context_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way ", "_context_right": " is spying on its own people.", "sentence_left": "Molavi, assassinated by Iranian agents in November 2019, was a former cybersecurity official behind the Black Box Telegram channel that was responsible for many notable leaks of Iranian government information.", "sentence_right": "According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Islamic Revolutionary Guard Corps", "context_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people. According to the leaked information, the", "context_right": "(IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad. Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "_context_left": "According to the leaked information, the ", "_context_right": " (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "sentence_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "sentence_right": "Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "label": "The Islamic Revolutionary Guard Corps (IRGC) ( or Sepah for short) is a branch of the Iranian Armed Forces, founded after the Iranian Revolution on 22 April 1979 by order of Ayatollah Ruhollah Khomeini. Whereas the Iranian Army defends Iranian borders and maintains internal order, according to the Iranian constitution, the Revolutionary Guard (\"pasdaran\") is intended to protect the country's Islamic republic political system. The Revolutionary Guards state that their role in protecting the Islamic system is preventing foreign interference as well as coups by the military or \"deviant movements\".  The Revolutionary Guards have roughly 125,000 military personnel including ground, aerospace and naval forces. Its naval forces are now the primary forces tasked with operational control of the Persian Gulf. It also controls the paramilitary Basij militia which has about 90,000 active personnel. Its media arm is Sepah News.  Since its origin as an ideologically driven militia, the Army of the Guardians of the Islamic Revolution has taken a greater role in nearly every aspect of Iranian society. Its expanded social, political, military and economic role under President Mahmoud Ahmadinejad's administration—especially during the 2009 presidential election and post-election suppression of protest—has led many Western analysts to argue that its political power has surpassed even that of the country's Shia clerical system.  The Chief Commander of the Guardians since 2019 is Hossein Salami who was preceded by Mohammad Ali Jafari and Yahya Rahim Safavi respectively from 2007 and 1997.  The IRGC is designated as a terrorist organization by the governments of Bahrain,", "label_id": 393629, "label_title": "Islamic Revolutionary Guard Corps", "label_link": "https://en.wikipedia.org/wiki?curid=1285472", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "IRGC", "context_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people. According to the leaked information, the Islamic Revolutionary Guard Corps (", "context_right": ") and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad. Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "_context_left": "According to the leaked information, the Islamic Revolutionary Guard Corps (", "_context_right": ") and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "sentence_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "sentence_right": "Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "label": "The Islamic Revolutionary Guard Corps (IRGC) ( or Sepah for short) is a branch of the Iranian Armed Forces, founded after the Iranian Revolution on 22 April 1979 by order of Ayatollah Ruhollah Khomeini. Whereas the Iranian Army defends Iranian borders and maintains internal order, according to the Iranian constitution, the Revolutionary Guard (\"pasdaran\") is intended to protect the country's Islamic republic political system. The Revolutionary Guards state that their role in protecting the Islamic system is preventing foreign interference as well as coups by the military or \"deviant movements\".  The Revolutionary Guards have roughly 125,000 military personnel including ground, aerospace and naval forces. Its naval forces are now the primary forces tasked with operational control of the Persian Gulf. It also controls the paramilitary Basij militia which has about 90,000 active personnel. Its media arm is Sepah News.  Since its origin as an ideologically driven militia, the Army of the Guardians of the Islamic Revolution has taken a greater role in nearly every aspect of Iranian society. Its expanded social, political, military and economic role under President Mahmoud Ahmadinejad's administration—especially during the 2009 presidential election and post-election suppression of protest—has led many Western analysts to argue that its political power has surpassed even that of the country's Shia clerical system.  The Chief Commander of the Guardians since 2019 is Hossein Salami who was preceded by Mohammad Ali Jafari and Yahya Rahim Safavi respectively from 2007 and 1997.  The IRGC is designated as a terrorist organization by the governments of Bahrain,", "label_id": 393629, "label_title": "Islamic Revolutionary Guard Corps", "label_link": "https://en.wikipedia.org/wiki?curid=1285472", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people. According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the", "context_right": "Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad. Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "_context_left": "According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the ", "_context_right": " Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "sentence_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "sentence_right": "Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people. According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in", "context_right": "and abroad. Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "_context_left": "According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in ", "_context_right": " and abroad.", "sentence_left": "The series of leaks uncovered hundreds of documents that offer a glimpse into the way Iran is spying on its own people.", "sentence_right": "Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the Iranian MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad. Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the", "context_right": "MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure. ### Tools and Techniques used for Domestic Espionage", "_context_left": "Much of this activity allegedly was conducted in the Rana Intelligent Computing Institute, an organization working under the ", "_context_right": " MOIS, involved in internal espionage by developing unique tools and gaining access to a variety of foreign countries’ infrastructure.", "sentence_left": "According to the leaked information, the Islamic Revolutionary Guard Corps (IRGC) and the Iranian Ministry of Intelligence Services (MOIS) developed numerous tools, malicious software, surveillance systems and data analysis platforms, in order to control citizens in Iran and abroad.", "sentence_right": "### Tools and Techniques used for Domestic Espionage", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "### Tools and Techniques used for Domestic Espionage According to the information shared by these whistleblowers,", "context_right": "is heavily investing in the development of customized tools and malicious software for domestic espionage. For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "_context_left": "According to the information shared by these whistleblowers, ", "_context_right": " is heavily investing in the development of customized tools and malicious software for domestic espionage.", "sentence_left": "### Tools and Techniques used for Domestic Espionage", "sentence_right": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "According to the information shared by these whistleblowers, Iran is heavily investing in the development of customized tools and malicious software for domestic espionage. For example, the", "context_right": "regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications. According to an Iranian blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers.", "_context_left": "For example, the ", "_context_right": " regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "sentence_left": "According to the information shared by these whistleblowers, Iran is heavily investing in the development of customized tools and malicious software for domestic espionage.", "sentence_right": "According to an Iranian blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications. According to an", "context_right": "blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers. ![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "_context_left": "According to an ", "_context_right": " blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers.", "sentence_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "sentence_right": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Persian", "context_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications. According to an Iranian blog called Arezooyenatamam, (translated in", "context_right": "as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers. ![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "_context_left": "According to an Iranian blog called Arezooyenatamam, (translated in ", "_context_right": " as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in Iran such as university campuses or protest centers.", "sentence_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "sentence_right": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications. According to an Iranian blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in", "context_right": "such as university campuses or protest centers. ![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "_context_left": "According to an Iranian blog called Arezooyenatamam, (translated in Persian as ‘an unfinished dream”), this system has been installed on pickup trucks posted in strategic locations in ", "_context_right": " such as university campuses or protest centers.", "sentence_left": "For example, the Iranian regime developed a surveillance system dubbed Abi, which allegedly was used to spy on political activists, human rights lawyers, regime opponents and protesters by intercepting Bluetooth communications.", "sentence_right": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png) A screenshot from the Abi system monitoring of Sharif UniversityThe", "context_right": "regime also developed customized malware used for stealing information from citizens. One example found in those leaks was called WinspySuite, a remote access and information stealing malware that reportedly was used specifically to spy on suspects arrested by the regime.", "_context_left": "A screenshot from the Abi system monitoring of Sharif UniversityThe ", "_context_right": " regime also developed customized malware used for stealing information from citizens.", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2.png)", "sentence_right": "One example found in those leaks was called WinspySuite, a remote access and information stealing malware that reportedly was used specifically to spy on suspects arrested by the regime.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Facebook", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png) A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including", "context_right": ", Twitter, and Instagram, and on messaging applications such as Telegram. According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "_context_left": "A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including ", "_context_right": ", Twitter, and Instagram, and on messaging applications such as Telegram.", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png)", "sentence_right": "According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Twitter", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png) A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including Facebook,", "context_right": ", and Instagram, and on messaging applications such as Telegram. According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "_context_left": "A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including Facebook, ", "_context_right": ", and Instagram, and on messaging applications such as Telegram.", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png)", "sentence_right": "According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "label": "Twitter, Inc. is an American communications company based in San Francisco, California. The company operates the microblogging and social networking service Twitter. It previously operated the Vine short video app and Periscope livestreaming service. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006 and launched in July of that year. By 2012, more than 100 million users posted 340 million tweets a day, and the service handled an average of 1.6 billion search queries per day. The company went public in November 2013. By the start of 2019, Twitter had more than 330 million monthly active users.On April 25, 2022, the Twitter board of directors agreed to a $44 billion buyout by Elon Musk, the CEO of SpaceX and Tesla, potentially making it one of the biggest deals to turn a company private. On July 8, 2022, Musk terminated the deal. As a result, Twitter shares experienced a fall and the company hired a US law firm to take legal action against Musk, launching a lawsuit against him in the Chancery Court of Delaware on July 12.", "label_id": 5903530, "label_title": "Twitter, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=41289288", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Telegram", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png) A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including Facebook, Twitter, and Instagram, and on messaging applications such as", "context_right": ". According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "_context_left": "A screenshot from the Winspy Suite control panelAnother malware project dubbed Project 420 aka Dolphin developed, deployed and controlled an undisclosed mobile malware capable of collecting and analyzing information about the activities of individuals and groups on social media networks including Facebook, Twitter, and Instagram, and on messaging applications such as ", "_context_right": ".", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-3.png)", "sentence_right": "According to leaked information, the regime not only developed tools for stealing sensitive data from its citizens, but also created designated platforms for the collection and analysis of the data.", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "A software called Seraj was used as an analytical search engine for data on suspects, employees, intelligence operations and arrests related to the MOIS. Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in", "context_right": "and abroad. Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens.", "_context_left": "Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in ", "_context_right": " and abroad.", "sentence_left": "A software called Seraj was used as an analytical search engine for data on suspects, employees, intelligence operations and arrests related to the MOIS.", "sentence_right": "Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "IRGC", "context_left": "Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in Iran and abroad. Additionally, the", "context_right": "and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens. For example, the MOIS would compromise Iran’s National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest.", "_context_left": "Additionally, the ", "_context_right": " and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens.", "sentence_left": "Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in Iran and abroad.", "sentence_right": "For example, the MOIS would compromise Iran’s National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest.", "label": "The Islamic Revolutionary Guard Corps (IRGC) ( or Sepah for short) is a branch of the Iranian Armed Forces, founded after the Iranian Revolution on 22 April 1979 by order of Ayatollah Ruhollah Khomeini. Whereas the Iranian Army defends Iranian borders and maintains internal order, according to the Iranian constitution, the Revolutionary Guard (\"pasdaran\") is intended to protect the country's Islamic republic political system. The Revolutionary Guards state that their role in protecting the Islamic system is preventing foreign interference as well as coups by the military or \"deviant movements\".  The Revolutionary Guards have roughly 125,000 military personnel including ground, aerospace and naval forces. Its naval forces are now the primary forces tasked with operational control of the Persian Gulf. It also controls the paramilitary Basij militia which has about 90,000 active personnel. Its media arm is Sepah News.  Since its origin as an ideologically driven militia, the Army of the Guardians of the Islamic Revolution has taken a greater role in nearly every aspect of Iranian society. Its expanded social, political, military and economic role under President Mahmoud Ahmadinejad's administration—especially during the 2009 presidential election and post-election suppression of protest—has led many Western analysts to argue that its political power has surpassed even that of the country's Shia clerical system.  The Chief Commander of the Guardians since 2019 is Hossein Salami who was preceded by Mohammad Ali Jafari and Yahya Rahim Safavi respectively from 2007 and 1997.  The IRGC is designated as a terrorist organization by the governments of Bahrain,", "label_id": 393629, "label_title": "Islamic Revolutionary Guard Corps", "label_link": "https://en.wikipedia.org/wiki?curid=1285472", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in Iran and abroad. Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on", "context_right": "citizens. For example, the MOIS would compromise Iran’s National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest.", "_context_left": "Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on ", "_context_right": " citizens.", "sentence_left": "Another system mentioned in reports dubbed Shojreh includes a mapping of family relations of Jewish people in Iran and abroad.", "sentence_right": "For example, the MOIS would compromise Iran’s National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran’s", "context_left": "Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens. For example, the MOIS would compromise", "context_right": "National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest. The MOIS allegedly also abused this access to send phishing emails with malicious attachments from the library’s official email account.", "_context_left": "For example, the MOIS would compromise ", "_context_right": " National Library computer network seeking to obtain personal information about users, mainly students and political prisoners, and their topics of interest.", "sentence_left": "Additionally, the IRGC and MOIS gained unauthorized access to legitimate services or websites to spy on Iranian citizens.", "sentence_right": "The MOIS allegedly also abused this access to send phishing emails with malicious attachments from the library’s official email account.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranians", "context_left": "The MOIS allegedly also abused this access to send phishing emails with malicious attachments from the library’s official email account. ### Tracking", "context_right": "Abroad In addition to all of the above, the Iranian government is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from Iranian cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies.", "_context_left": "### Tracking ", "_context_right": " Abroad", "sentence_left": "The MOIS allegedly also abused this access to send phishing emails with malicious attachments from the library’s official email account.", "sentence_right": "In addition to all of the above, the Iranian government is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from Iranian cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian government", "context_left": "### Tracking Iranians Abroad In addition to all of the above, the", "context_right": "is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from Iranian cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies. ![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "_context_left": "In addition to all of the above, the ", "_context_right": " is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from Iranian cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies.", "sentence_left": "### Tracking Iranians Abroad", "sentence_right": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "label": "The Government of the Islamic Republic of Iran (, known simply as Nezam () is the ruling state and current political system in Iran, in power since the revolution and fall of Pahlavi dynasty in 1979.  Its constitution, adopted by a referendum, uses separation of powers model with Executive, Legislative, and Judicial systems, while the Supreme Leader is the country's head of state and commander-in-chief of the armed forces.  It is currently one of the four governments using the title Islamic republic.", "label_id": 5106680, "label_title": "Government of the Islamic Republic of Iran", "label_link": "https://en.wikipedia.org/wiki?curid=50913538", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "### Tracking Iranians Abroad In addition to all of the above, the Iranian government is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from", "context_right": "cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies. ![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "_context_left": "In addition to all of the above, the Iranian government is making great efforts to monitor citizens going abroad by surveying and analyzing location data obtained from ", "_context_right": " cellular operators with a system called Pouya, and by compromising the infrastructure of foreign companies.", "sentence_left": "### Tracking Iranians Abroad", "sentence_right": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Persian", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png) A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in", "context_right": "as ‘the hidden facts’) to expose Iranian regime espionage-related activity. The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "_context_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in ", "_context_right": " as ‘the hidden facts’) to expose Iranian regime espionage-related activity.", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "sentence_right": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png) A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose", "context_right": "regime espionage-related activity. The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "_context_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose ", "_context_right": " regime espionage-related activity.", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-4.png)", "sentence_right": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iran", "context_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose Iranian regime espionage-related activity. The site contains a large section about espionage enterprises outside", "context_right": "that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "_context_left": "The site contains a large section about espionage enterprises outside ", "_context_right": " that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose Iranian regime espionage-related activity.", "sentence_right": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranians", "context_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose Iranian regime espionage-related activity. The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of", "context_right": "traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "_context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of ", "_context_right": " traveling abroad.", "sentence_left": "A screenshot from the Pouya systemIn 2019, an unknown activist or group of activists launched a site called “Vagheyatepenhaan” (translated in Persian as ‘the hidden facts’) to expose Iranian regime espionage-related activity.", "sentence_right": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Bahrain", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in", "context_right": ", Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in ", "_context_right": ", Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Bahrain (; ' ), officially the Kingdom of Bahrain ( '), is an island country in the Persian Gulf. The sovereign state comprises a small archipelago centered around Bahrain Island, situated between the Qatar peninsula and the north eastern coast of Saudi Arabia, to which it is connected by the King Fahd Causeway. Bahrain's population is 1,234,561 (c. 2010), including 666,172 non-nationals. It is in size, making it the third-smallest nation in Asia after the Maldives and Singapore.  Bahrain is the site of the ancient Dilmun civilisation. It has been famed since antiquity for its pearl fisheries, which were considered the best in the world into the 19th century. Bahrain was one of the earliest areas to convert to Islam, in 628 CE. Following a period of Arab rule, Bahrain was occupied by the Portuguese in 1521, who in turn were expelled in 1602 by Shah Abbas I of the Safavid dynasty under the Persian Empire. In 1783, the Bani Utbah clan captured Bahrain from Nasr Al-Madhkur and it has since been ruled by the Al Khalifa royal family, with Ahmed al Fateh as Bahrain's first hakim.  In the late 1800s, following successive treaties with the British, Bahrain became a protectorate of the United Kingdom. In 1971, Bahrain declared independence. Formerly an emirate, the Arab constitutional monarchy of Bahrain was declared a kingdom in 2002. In 2011, the country experienced protests inspired by the regional Arab Spring. Bahrain's ruling al-Khalifa royal family has been accused and criticized for human rights abuses, including imprisonment,", "label_id": 2342885, "label_title": "Bahrain", "label_link": "https://en.wikipedia.org/wiki?curid=18933277", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Dubai", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain,", "context_right": ", India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, ", "_context_right": ", India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Dubai ( ; \"\", ) is the largest and most populous city in the United Arab Emirates (UAE). On the southeast coast of the Persian Gulf, it is the capital of the Emirate of Dubai, one of the seven emirates that make up the country.  Dubai is a global city and business hub of the Middle East. It is also a major global transport hub for passengers and cargo. Oil revenue helped accelerate the development of the city, which was already a major mercantile hub, but Dubai's oil reserves are limited and production levels are low: today, less than 5% of the emirate's revenue comes from oil. A growing centre for regional and international trade since the early 20th century, Dubai's economy today relies on revenues from trade, tourism, aviation, real estate, and financial services.  Dubai has attracted world attention through large construction projects and sports events, in particular the world's tallest building, the Burj Khalifa. , Dubai was the most expensive city in the Middle East. In 2014, Dubai's hotel rooms were rated as the second most expensive in the world.", "label_id": 111183, "label_title": "Dubai", "label_link": "https://en.wikipedia.org/wiki?curid=211583", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "India", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai,", "context_right": ", Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, ", "_context_right": ", Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Indonesia", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India,", "context_right": ", Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, ", "_context_right": ", Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Indonesia ( , ; Indonesian: ), officially the Republic of Indonesia ( ), is a country in Southeast Asia, between the Indian and Pacific oceans. It is the world's largest island country, with more than seventeen thousand islands, and at , the 14th largest by land area and 7th in the combined sea and land area. With over floor(/1e6) million people, it is the world's 4th most populous country as well as the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's population.  The sovereign state is a presidential, constitutional republic with an elected legislature. It has 34 provinces, of which five have special status. Jakarta, the country's capital, is the second-most populous urban area in the world. The country shares land borders with Papua New Guinea, East Timor, and the eastern part of Malaysia. Other neighbouring countries include Singapore, Vietnam, the Philippines, Australia, Palau, and India's Andaman and Nicobar Islands. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support a high level of biodiversity. The country has abundant natural resources like oil and natural gas, tin, copper, and gold, while agriculture mainly produces rice, palm oil, tea, coffee, cacao, medicinal plants, spices, and rubber. China, the United States, Japan, Singapore, and India are Indonesia's major trading partners.  The history of the Indonesian archipelago has been influenced by foreign powers drawn to its natural resources. It has been a valuable region for trade since at least", "label_id": 6963, "label_title": "Indonesia", "label_link": "https://en.wikipedia.org/wiki?curid=14579", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Malaysia", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia,", "context_right": ", Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, ", "_context_right": ", Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Malaysia ( ; ) is a country in Southeast Asia. The federal constitutional monarchy consists of 13 states and three federal territories, separated by the South China Sea into two similarly sized regions, Peninsular Malaysia and East Malaysia (Malaysian Borneo). Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land and maritime borders with Brunei and Indonesia and a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital and largest city while Putrajaya is the seat of federal government. With a population of over 30 million, Malaysia is the world's 44th most populous country. The southernmost point of continental Eurasia, Tanjung Piai, is in Malaysia. In the tropics, Malaysia is one of 17 megadiverse countries, with large numbers of endemic species.  Malaysia has its origins in the Malay kingdoms which, from the 18th century, became subject to the British Empire, along with the British Straits Settlements protectorate. Peninsular Malaysia was unified as the Malayan Union in 1946. Malaya was restructured as the Federation of Malaya in 1948, and achieved independence on 31 August 1957. Malaya united with North Borneo, Sarawak, and Singapore on 16 September 1963 to become Malaysia. In 1965, Singapore was expelled from the federation.  The country is multi-ethnic and multi-cultural, which plays a large role in its politics. About half the population is ethnically Malay, with large minorities of Malaysian Chinese, Malaysian Indians, and indigenous peoples. While recognising Islam as the country's established religion,", "label_id": 810965, "label_title": "Malaysia", "label_link": "https://en.wikipedia.org/wiki?curid=3607937", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Pakistan", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia,", "context_right": ", the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, ", "_context_right": ", the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Philippines", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the", "context_right": ", Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the ", "_context_right": ", Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "The Philippines ( ; or ' ), officially the Republic of the Philippines (), is an archipelagic country in Southeast Asia. Situated in the western Pacific Ocean, it consists of about 7,641 islands that are categorized broadly under three main geographical divisions from north to south: Luzon, Visayas and Mindanao. The capital city of the Philippines is Manila and the most populous city is Quezon City, both part of Metro Manila. Bounded by the South China Sea on the west, the Philippine Sea on the east and the Celebes Sea on the southwest, the Philippines shares maritime borders with Taiwan to the north, Japan to the northeast, Vietnam to the west, Palau to the east, and Malaysia and Indonesia to the south.  The Philippines' location on the Pacific Ring of Fire and close to the equator makes the Philippines prone to earthquakes and typhoons, but also endows it with abundant natural resources and some of the world's greatest biodiversity. The Philippines has an area of , according to the Philippines Statistical Authority and the WorldBank and, as of 2015, had a population of at least 100 million. , it is the eighth-most populated country in Asia and the 12th most populated country in the world. Approximately 10 million additional Filipinos lived overseas, comprising one of the world's largest diasporas. Multiple ethnicities and cultures are found throughout the islands. In prehistoric times, Negritos were some of the archipelago's earliest inhabitants. They were followed by successive waves of Austronesian peoples. Exchanges with Malay, Indian, Arab and", "label_id": 11485, "label_title": "Philippines", "label_link": "https://en.wikipedia.org/wiki?curid=23440", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Qatar", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines,", "context_right": ", Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, ", "_context_right": ", Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Qatar (, , or ; ' ; local vernacular pronunciation: ), officially the State of Qatar ( '), is a country located in Western Asia, occupying the small Qatar Peninsula on the northeastern coast of the Arabian Peninsula. Whether the sovereign state should be regarded as a constitutional monarchy or an absolute monarchy is disputed. Its sole land border is with neighbouring Gulf Cooperation Council (GCC) monarchy Saudi Arabia to the south, with the rest of its territory surrounded by the Persian Gulf. The Gulf of Bahrain, an inlet of the Persian Gulf, separates Qatar from nearby Bahrain.  In early 2017, Qatar's total population was 2.6 million: 313,000 Qatari citizens and 2.3 million expatriates. Islam is the official religion of Qatar. The country has the highest per capita income in the world. Qatar is classified by the UN as a country of very high human development and is widely regarded as the most advanced Arab state for human development. Qatar is a high-income economy, backed by the world's third-largest natural gas reserves and oil reserves.  Qatar has been ruled by the House of Thani since Mohammed bin Thani signed a treaty with the British in 1868 that recognised its separate status. Following Ottoman rule, Qatar became a British protectorate in the early 20th century until gaining independence in 1971. In 2003, the constitution was overwhelmingly approved in a referendum, with almost 98% in favour. In the 21st century, Qatar emerged as a significant power in the Arab world both through its globally expanding", "label_id": 1358067, "label_title": "Qatar", "label_link": "https://en.wikipedia.org/wiki?curid=8238258", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Saudi Arabia", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar,", "context_right": ", Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, ", "_context_right": ", Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Saudi Arabia, officially the Kingdom of Saudi Arabia, is a sovereign state in Western Asia constituting the bulk of the Arabian Peninsula. With a land area of approximately , Saudi Arabia is geographically the largest sovereign state in the Middle East, the second-largest in the Arab world (after Algeria), the fifth-largest in Asia, and the 12th-largest in the world. Saudi Arabia is bordered by Jordan and Iraq to the north, Kuwait to the northeast, Qatar, Bahrain, and the United Arab Emirates to the east, Oman to the southeast and Yemen to the south; it is separated from Israel and Egypt by the Gulf of Aqaba. It is the only nation with both a Red Sea coast and a Persian Gulf coast, and most of its terrain consists of arid desert, lowland and mountains. As of October 2018, the Saudi economy was the largest in the Middle East and the 18th largest in the world. Saudi Arabia also has one of the world's youngest populations; 50 percent of its 33.4 million people are under 25 years old.  The territory that now constitutes Saudi Arabia was the site of several ancient cultures and civilizations. The prehistory of Saudi Arabia shows some of the earliest traces of human activity in the world. The world's second-largest religion, Islam, emerged in modern-day Saudi Arabia. In the early 7th century, the Islamic prophet Muhammad united the population of Arabia and created a single Islamic religious polity. Following his death in 632, his followers rapidly expanded the territory under Muslim rule", "label_id": 155296, "label_title": "Saudi Arabia", "label_link": "https://en.wikipedia.org/wiki?curid=349303", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Thailand", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia,", "context_right": "and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, ", "_context_right": " and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Thailand, officially the Kingdom of Thailand and formerly known as Siam, is a country at the centre of the Southeast Asian Indochinese peninsula composed of 76 provinces. At and over 68 million people, Thailand is the world's 50th largest country by total area and the 21st-most-populous country. The capital and largest city is Bangkok, a special administrative area. Thailand is bordered to the north by Myanmar and Laos, to the east by Laos and Cambodia, to the south by the Gulf of Thailand and Malaysia, and to the west by the Andaman Sea and the southern extremity of Myanmar. Its maritime boundaries include Vietnam in the Gulf of Thailand to the southeast, and Indonesia and India on the Andaman Sea to the southwest. Although nominally a constitutional monarchy and parliamentary democracy, the most recent coup in 2014 established a de facto military dictatorship.  Tai peoples migrated from southwestern China to mainland Southeast Asia from the 11th century; the oldest known mention of their presence in the region by the exonym \"Siamese\" dates to the 12th century. Various Indianised kingdoms such as the Mon, the Khmer Empire and Malay states ruled the region, competing with Thai states such as Ngoenyang, the Sukhothai Kingdom, Lan Na and the Ayutthaya Kingdom, which rivaled each other. Documented European contact began in 1511 with a Portuguese diplomatic mission to Ayutthaya, one of the great powers in the region. Ayutthaya reached its peak during cosmopolitan Narai's reign (1656–88), gradually declining thereafter until being ultimately destroyed in 1767 in a war", "label_id": 14933, "label_title": "Thailand", "label_link": "https://en.wikipedia.org/wiki?curid=30128", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "United Arab Emirates", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the", "context_right": "(UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the ", "_context_right": " (UAE) for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "The United Arab Emirates (UAE; ') literally \"'State' of the United Arab Emirates\", sometimes simply called the Emirates ( '), is a country in Western Asia at the southeast end of the Arabian Peninsula on the Persian Gulf, bordering Oman to the east and Saudi Arabia to the south and west, as well as sharing maritime borders with Qatar to the west and Iran to the north. The sovereign constitutional monarchy is a federation of seven emirates consisting of Abu Dhabi (which serves as the capital), Ajman, Dubai, Fujairah, Ras Al Khaimah, Sharjah and Umm Al Quwain. Their boundaries are complex, with numerous enclaves within the various emirates. Each emirate is governed by a ruler; together, they jointly form the Federal Supreme Council. One of the rulers serves as the President of the United Arab Emirates. In 2013, the UAE's population was 9.2 million, of which 1.4 million are Emirati citizens and 7.8 million are expatriates.  Human occupation of the present UAE has been traced back to the emergence of anatomically modern humans from Africa some 125,000 BCE through finds at the Faya-1 site in Mleiha, Sharjah. Burial sites dating back to the Neolithic Age and the Bronze Age include the oldest known such inland site at Jebel Buhais. Known as Magan to the Sumerians, the area was home to a prosperous Bronze Age trading culture during the Umm Al Nar period, which traded between the Indus Valley, Bahrain and Mesopotamia as well as Iran, Bactria and the Levant. The ensuing Wadi Suq period", "label_id": 34300, "label_title": "United Arab Emirates", "label_link": "https://en.wikipedia.org/wiki?curid=69328", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "UAE", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (", "context_right": ") for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (", "_context_right": ") for data collection on flights of Iranian citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "The United Arab Emirates (UAE; ') literally \"'State' of the United Arab Emirates\", sometimes simply called the Emirates ( '), is a country in Western Asia at the southeast end of the Arabian Peninsula on the Persian Gulf, bordering Oman to the east and Saudi Arabia to the south and west, as well as sharing maritime borders with Qatar to the west and Iran to the north. The sovereign constitutional monarchy is a federation of seven emirates consisting of Abu Dhabi (which serves as the capital), Ajman, Dubai, Fujairah, Ras Al Khaimah, Sharjah and Umm Al Quwain. Their boundaries are complex, with numerous enclaves within the various emirates. Each emirate is governed by a ruler; together, they jointly form the Federal Supreme Council. One of the rulers serves as the President of the United Arab Emirates. In 2013, the UAE's population was 9.2 million, of which 1.4 million are Emirati citizens and 7.8 million are expatriates.  Human occupation of the present UAE has been traced back to the emergence of anatomically modern humans from Africa some 125,000 BCE through finds at the Faya-1 site in Mleiha, Sharjah. Burial sites dating back to the Neolithic Age and the Bronze Age include the oldest known such inland site at Jebel Buhais. Known as Magan to the Sumerians, the area was home to a prosperous Bronze Age trading culture during the Umm Al Nar period, which traded between the Indus Valley, Bahrain and Mesopotamia as well as Iran, Bactria and the Levant. The ensuing Wadi Suq period", "label_id": 34300, "label_title": "United Arab Emirates", "label_link": "https://en.wikipedia.org/wiki?curid=69328", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad. According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of", "context_right": "citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "_context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of ", "_context_right": " citizens.", "sentence_left": "The site contains a large section about espionage enterprises outside Iran that was conducted to monitor the movement of Iranians traveling abroad.", "sentence_right": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Republic of Georgia", "context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the", "context_right": ", a neighboring country and a popular holiday destination for Iranians. While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the Iranian regime’s priorities.", "_context_left": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the ", "_context_right": ", a neighboring country and a popular holiday destination for Iranians.", "sentence_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_right": "While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the Iranian regime’s priorities.", "label": "Georgia (, ), known until 1995 as the Republic of Georgia (), is a country in the Caucasus region of Eurasia. Located at the crossroads of Western Asia and Eastern Europe, it is bounded to the west by the Black Sea, to the north by Russia, to the south by Turkey and Armenia, and to the southeast by Azerbaijan. The capital and largest city is Tbilisi. Georgia covers a territory of , and its 2017 population is about 3.718 million. Georgia is a unitary parliamentary republic, with the government elected through a representative democracy.  During the classical era, several independent kingdoms became established in what is now Georgia, such as Colchis and Iberia. The Georgians officially adopted Christianity in the early 4th century. The Eastern Orthodox Church had enormous importance for spiritual and political unification of early Georgian states. A unified Kingdom of Georgia reached its Golden Age during the reign of King David the Builder and Queen Tamar the Great in the 12th and early 13th centuries. Thereafter, the kingdom declined and eventually disintegrated under hegemony of various regional powers, including the Mongols, the Ottoman Empire, and successive dynasties of Iran. In the late 18th century, the eastern Georgian Kingdom of Kartli-Kakheti forged an alliance with the Russian Empire, which directly annexed the kingdom in 1801 and conquered the western Kingdom of Imereti in 1810. Russian rule over Georgia was eventually acknowledged in various peace treaties with Iran and the Ottomans and the remaining Georgian territories were absorbed by the Russian Empire in a", "label_id": 24934, "label_title": "Georgia (country)", "label_link": "https://en.wikipedia.org/wiki?curid=48768", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranians", "context_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens. In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for", "context_right": ". While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the Iranian regime’s priorities.", "_context_left": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for ", "_context_right": ".", "sentence_left": "According to this information, the regime gained access to computer systems of numerous airline companies in Bahrain, Dubai, India, Indonesia, Malaysia, Pakistan, the Philippines, Qatar, Saudi Arabia, Thailand and the United Arab Emirates (UAE) for data collection on flights of Iranian citizens.", "sentence_right": "While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the Iranian regime’s priorities.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}
{"mention": "Iranian", "context_left": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians. While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the", "context_right": "regime’s priorities. However, the information disclosed provides evidence that as time goes by, motivation to expose these activities likely will remain high.", "_context_left": "While they can be considered revealing, It should be noted that these leaks provide a very narrow window into the full extent of the ", "_context_right": " regime’s priorities.", "sentence_left": "In another case, leaked documents showed the government worked on a project that aimed to compromise hotel websites in the Republic of Georgia, a neighboring country and a popular holiday destination for Iranians.", "sentence_right": "However, the information disclosed provides evidence that as time goes by, motivation to expose these activities likely will remain high.", "label": "Iran, also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. With 82 million inhabitants, Iran is the world's 18th most populous country. Its territory spans , making it the second largest country in the Middle East and the 17th largest in the world. Iran is bordered to the northwest by Armenia and the Republic of Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan and Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Its central location in Eurasia and Western Asia, and its proximity to the Strait of Hormuz, give it geostrategic importance. Tehran is the political and economic center of Iran, and the largest and most populous city in Western Asia with more than 8.8 million residents in the city and 15 million in the larger metropolitan area.  Iran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BCE. It was first unified by the Iranian Medes in the seventh century BCE, and reached its territorial height in the sixth century BCE under Cyrus the Great, whose Achaemenid Empire stretched from Eastern Europe to the Indus Valley, one of the largest empires in history. The empire fell to Alexander the Great in the fourth century BCE and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the", "label_id": 7000, "label_title": "Iran", "label_link": "https://en.wikipedia.org/wiki?curid=14653", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-07-08_irans-domestic-espionage"}