{"mention": "Malware", "context_left": "By the Intel 471", "context_right": "Intelligence team.", "_context_left": "By the Intel 471 ", "_context_right": " Intelligence team.", "sentence_left": "Mar 26, 2020", "sentence_right": "Background", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Microsoft", "context_left": "The actor used a series of tools in this operation, including KeitaroTDS, a malicious", "context_right": "Excel spreadsheet document builder and the Zloader banking trojan (aka Terdot).", "_context_left": "The actor used a series of tools in this operation, including KeitaroTDS, a malicious ", "_context_right": " Excel spreadsheet document builder and the Zloader banking trojan (aka Terdot).", "sentence_left": "The threat actor that sent this malspam campaign demonstrated good operational security (OPSEC) by hiding their infrastructure behind professional bulletproof hosting (BPH) services and by filtering traffic to hide final payloads from curious researchers.", "sentence_right": "Considering the nature of the malspam documents (usually named “Invoice”) and the use of a banking trojan, we assess the intended goal of the attackers was to make unauthorized bank transfers from victim accounts.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Google", "context_left": "The sender was an AOL mail account, using the AOL mail portal and a Windows machine using the", "context_right": "Chrome browser (if the user agent can be trusted).", "_context_left": "The sender was an AOL mail account, using the AOL mail portal and a Windows machine using the ", "_context_right": " Chrome browser (if the user agent can be trusted).", "sentence_left": "| **SHA256 hash** | 5d1bb0aef5545138feb825d5b0669ccc4a68abb4323362f2fe188e86c62aeed0 |", "sentence_right": "| **From: Annika Preston <[[email protected]](/cdn-cgi/l/email-protection)>To: ****@intel471.com**Message-ID: <[[email protected]](/cdn-cgi/l/email-protection)>Subject: March Incoming Invoice from Seed RecordsMIME-Version: 1.0Content-Type: multipart/mixed;boundary=\"----=\\\\_Part\\\\_719010\\\\_1408914388.1584984371396\"References: <[[email protected]](/cdn-cgi/l/email-protection)>X-Mailer: **WebService/1.1.15518 aolwebmail** Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36 |", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "GitHub", "context_left": "As shown in the HTTP request below, the malicious server performed a redirection to the", "context_right": "software development platform (GitHub was advised) and downloaded a dynamic link library (DLL) from a public repository.", "_context_left": "As shown in the HTTP request below, the malicious server performed a redirection to the ", "_context_right": " software development platform (GitHub was advised) and downloaded a dynamic link library (DLL) from a public repository.", "sentence_left": "The DLL at the location hxxps://grpxmqnrb[.]pw/egrg4g3g was retrieved and saved under \"C:\\Users\\Public\\fef2fff.html\" before being executed.", "sentence_right": "| GET /egrg4g3g HTTP/1.1Host: grpxmqnrb[.]pwUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0)Accept: */*HTTP/1.1 302 FoundServer: nginxDate: Tue, 24 Mar 2020 13:00:34 GMTContent-Type: text/html; charset=UTF-8Content-Length: 0Connection: keep-aliveCache-Control: no-cache, no-store, must-revalidate,post-check=0,pre-check=0Expires: 0Last-Modified: Tue, 24 Mar 2020 13:00:34 GMT**Location: hxxps://github[.]com/arntsonl/calc\\\\_security\\\\_poc/raw/master/dll/calc.dll**Pragma: no-cacheSet-Cookie: \\\\_subid=357bngnes3kqn;Expires=Friday, 24-Apr-2020 13:00:34 GMT;Max-Age=2678400;Path=/X-Content-Type-Options: nosniff |", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "GitHub", "context_left": "As shown in the HTTP request below, the malicious server performed a redirection to the GitHub software development platform (", "context_right": "was advised) and downloaded a dynamic link library (DLL) from a public repository.", "_context_left": "As shown in the HTTP request below, the malicious server performed a redirection to the GitHub software development platform (", "_context_right": " was advised) and downloaded a dynamic link library (DLL) from a public repository.", "sentence_left": "The DLL at the location hxxps://grpxmqnrb[.]pw/egrg4g3g was retrieved and saved under \"C:\\Users\\Public\\fef2fff.html\" before being executed.", "sentence_right": "| GET /egrg4g3g HTTP/1.1Host: grpxmqnrb[.]pwUser-Agent: Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.0)Accept: */*HTTP/1.1 302 FoundServer: nginxDate: Tue, 24 Mar 2020 13:00:34 GMTContent-Type: text/html; charset=UTF-8Content-Length: 0Connection: keep-aliveCache-Control: no-cache, no-store, must-revalidate,post-check=0,pre-check=0Expires: 0Last-Modified: Tue, 24 Mar 2020 13:00:34 GMT**Location: hxxps://github[.]com/arntsonl/calc\\\\_security\\\\_poc/raw/master/dll/calc.dll**Pragma: no-cacheSet-Cookie: \\\\_subid=357bngnes3kqn;Expires=Friday, 24-Apr-2020 13:00:34 GMT;Max-Age=2678400;Path=/X-Content-Type-Options: nosniff |", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "payload", "context_left": "Clearly, we have received a decoy", "context_right": ".", "_context_left": "Clearly, we have received a decoy ", "_context_right": ".", "sentence_left": "![](https://d39ec1uo9ktrut.cloudfront.net/pasted-image-0-2-300x73.png)", "sentence_right": "Network artifact research", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Chinese", "context_left": "We can see the domain is administered via DNSPod, a product of", "context_right": "company Tencent ().", "_context_left": "We can see the domain is administered via DNSPod, a product of ", "_context_right": " company Tencent ().", "sentence_left": "1584947588 3600 180 1209600 180 |", "sentence_right": "The IP address in the address record or “A record” belongs to Alibaba Cloud aka Aliyun.", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Tencent", "context_left": "We can see the domain is administered via DNSPod, a product of Chinese company", "context_right": "().", "_context_left": "We can see the domain is administered via DNSPod, a product of Chinese company ", "_context_right": " ().", "sentence_left": "1584947588 3600 180 1209600 180 |", "sentence_right": "The IP address in the address record or “A record” belongs to Alibaba Cloud aka Aliyun.", "label": "Tencent Holdings Limited () is a Chinese multinational investment holding conglomerate founded in 1998, whose subsidiaries specialise in various Internet-related services and products, entertainment, artificial intelligence and technology both in China and globally. Its twin-skyscrapers headquarters Tencent Seafront Towers (also known as \"Tencent Binhai Mansion\") are based in Nanshan District, Shenzhen.  Tencent is the world's largest gaming company, one of the world's most valuable technology companies, one of the world's largest social media companies, and one of the world's largest venture capital firms and investment corporations. Its many services include social network, music, web portals, e-commerce, mobile games, internet services, payment systems, smartphones, and multiplayer online games, which are all among the world's biggest and most successful in their respective categories. Offerings in China include the instant messenger Tencent QQ and one of the largest web portals, QQ.com. It also owns the majority of China's music services (Tencent Music Entertainment), with more than 700 million active users and 120 million paying subscribers. The company surpassed the market value of US$500 billion in 2018, becoming the first Asian technology company to cross the valuation mark. It has since then emerged as one of Asia's most valuable companies, and among the world's top technology companies by market value. Tencent has been credited as one of the world's most innovative companies by numerous media and firms. As of 2018, Tencent has the 5th highest global brand value.  Tencent controls hundreds of subsidiaries and associates in numerous industries and areas, creating a broad portfolio of ownerships and", "label_id": 2138910, "label_title": "Tencent", "label_link": "https://en.wikipedia.org/wiki?curid=16709162", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Alibaba Cloud", "context_left": "The IP address in the address record or “A record” belongs to", "context_right": "aka Aliyun.", "_context_left": "The IP address in the address record or “A record” belongs to ", "_context_right": " aka Aliyun.", "sentence_left": "We can see the domain is administered via DNSPod, a product of Chinese company Tencent ().", "sentence_right": "| inetnum: 8.208.0.0 - 8.208.255.255netname: ALICLOUD-GBdescr: Aliyun Computing Co.LTD |", "label": "Alibaba Cloud (), also known as Aliyun, is a Chinese cloud computing company, a subsidiary of Alibaba Group. Alibaba Cloud provides cloud computing services to online businesses and Alibaba's own e-commerce ecosystem. Alibaba Cloud's international operations are registered and headquartered in Singapore.  Alibaba Cloud offers cloud services. Services are available on a pay-as-you-go basis and include Elastic Compute, Data Storage, Relational Databases, Big-Data Processing, Anti-DDoS protection and Content Delivery Networks (CDN).  Outside of the status as the largest cloud computing company in China, Alibaba Cloud operates in 19 data center regions and 56 availability zones around the globe. As of June 2017, Alibaba Cloud is placed in the Visionaries' quadrant of Gartner's Magic Quadrant for Cloud Infrastructure as a Service, Worldwide.", "label_id": 5123429, "label_title": "Alibaba Cloud", "label_link": "https://en.wikipedia.org/wiki?curid=51100188", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Aliyun", "context_left": "The IP address in the address record or “A record” belongs to Alibaba Cloud aka", "context_right": ".", "_context_left": "The IP address in the address record or “A record” belongs to Alibaba Cloud aka ", "_context_right": ".", "sentence_left": "We can see the domain is administered via DNSPod, a product of Chinese company Tencent ().", "sentence_right": "| inetnum: 8.208.0.0 - 8.208.255.255netname: ALICLOUD-GBdescr: Aliyun Computing Co.LTD |", "label": "Alibaba Cloud (), also known as Aliyun, is a Chinese cloud computing company, a subsidiary of Alibaba Group. Alibaba Cloud provides cloud computing services to online businesses and Alibaba's own e-commerce ecosystem. Alibaba Cloud's international operations are registered and headquartered in Singapore.  Alibaba Cloud offers cloud services. Services are available on a pay-as-you-go basis and include Elastic Compute, Data Storage, Relational Databases, Big-Data Processing, Anti-DDoS protection and Content Delivery Networks (CDN).  Outside of the status as the largest cloud computing company in China, Alibaba Cloud operates in 19 data center regions and 56 availability zones around the globe. As of June 2017, Alibaba Cloud is placed in the Visionaries' quadrant of Gartner's Magic Quadrant for Cloud Infrastructure as a Service, Worldwide.", "label_id": 5123429, "label_title": "Alibaba Cloud", "label_link": "https://en.wikipedia.org/wiki?curid=51100188", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Aliyun Computing Co.LTD", "context_left": "| inetnum: 8.208.0.0 - 8.208.255.255netname: ALICLOUD-GBdescr:", "context_right": "|", "_context_left": "| inetnum: 8.208.0.0 - 8.208.255.255netname: ALICLOUD-GBdescr: ", "_context_right": " |", "sentence_left": "The IP address in the address record or “A record” belongs to Alibaba Cloud aka Aliyun.", "sentence_right": "This IP address was identified by our intelligence team as hosted by the well-known Russian-based BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "label": "Alibaba Cloud (), also known as Aliyun, is a Chinese cloud computing company, a subsidiary of Alibaba Group. Alibaba Cloud provides cloud computing services to online businesses and Alibaba's own e-commerce ecosystem. Alibaba Cloud's international operations are registered and headquartered in Singapore.  Alibaba Cloud offers cloud services. Services are available on a pay-as-you-go basis and include Elastic Compute, Data Storage, Relational Databases, Big-Data Processing, Anti-DDoS protection and Content Delivery Networks (CDN).  Outside of the status as the largest cloud computing company in China, Alibaba Cloud operates in 19 data center regions and 56 availability zones around the globe. As of June 2017, Alibaba Cloud is placed in the Visionaries' quadrant of Gartner's Magic Quadrant for Cloud Infrastructure as a Service, Worldwide.", "label_id": 5123429, "label_title": "Alibaba Cloud", "label_link": "https://en.wikipedia.org/wiki?curid=51100188", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Russian-based", "context_left": "This IP address was identified by our intelligence team as hosted by the well-known", "context_right": "BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "_context_left": "This IP address was identified by our intelligence team as hosted by the well-known ", "_context_right": " BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "sentence_left": "| inetnum: 8.208.0.0 - 8.208.255.255netname: ALICLOUD-GBdescr: Aliyun Computing Co.LTD |", "sentence_right": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud, Tencent Cloud, Google Cloud and others.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Alibaba-Cloud", "context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as", "context_right": ", Tencent Cloud, Google Cloud and others.", "_context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as ", "_context_right": ", Tencent Cloud, Google Cloud and others.", "sentence_left": "This IP address was identified by our intelligence team as hosted by the well-known Russian-based BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "sentence_right": "The service uses the Chinese based free DNS provider DNSPOD to rotate client domains across the reverse proxy network.", "label": "Alibaba Cloud (), also known as Aliyun, is a Chinese cloud computing company, a subsidiary of Alibaba Group. Alibaba Cloud provides cloud computing services to online businesses and Alibaba's own e-commerce ecosystem. Alibaba Cloud's international operations are registered and headquartered in Singapore.  Alibaba Cloud offers cloud services. Services are available on a pay-as-you-go basis and include Elastic Compute, Data Storage, Relational Databases, Big-Data Processing, Anti-DDoS protection and Content Delivery Networks (CDN).  Outside of the status as the largest cloud computing company in China, Alibaba Cloud operates in 19 data center regions and 56 availability zones around the globe. As of June 2017, Alibaba Cloud is placed in the Visionaries' quadrant of Gartner's Magic Quadrant for Cloud Infrastructure as a Service, Worldwide.", "label_id": 5123429, "label_title": "Alibaba Cloud", "label_link": "https://en.wikipedia.org/wiki?curid=51100188", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Tencent", "context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud,", "context_right": "Cloud, Google Cloud and others.", "_context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud, ", "_context_right": " Cloud, Google Cloud and others.", "sentence_left": "This IP address was identified by our intelligence team as hosted by the well-known Russian-based BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "sentence_right": "The service uses the Chinese based free DNS provider DNSPOD to rotate client domains across the reverse proxy network.", "label": "Tencent Holdings Limited () is a Chinese multinational investment holding conglomerate founded in 1998, whose subsidiaries specialise in various Internet-related services and products, entertainment, artificial intelligence and technology both in China and globally. Its twin-skyscrapers headquarters Tencent Seafront Towers (also known as \"Tencent Binhai Mansion\") are based in Nanshan District, Shenzhen.  Tencent is the world's largest gaming company, one of the world's most valuable technology companies, one of the world's largest social media companies, and one of the world's largest venture capital firms and investment corporations. Its many services include social network, music, web portals, e-commerce, mobile games, internet services, payment systems, smartphones, and multiplayer online games, which are all among the world's biggest and most successful in their respective categories. Offerings in China include the instant messenger Tencent QQ and one of the largest web portals, QQ.com. It also owns the majority of China's music services (Tencent Music Entertainment), with more than 700 million active users and 120 million paying subscribers. The company surpassed the market value of US$500 billion in 2018, becoming the first Asian technology company to cross the valuation mark. It has since then emerged as one of Asia's most valuable companies, and among the world's top technology companies by market value. Tencent has been credited as one of the world's most innovative companies by numerous media and firms. As of 2018, Tencent has the 5th highest global brand value.  Tencent controls hundreds of subsidiaries and associates in numerous industries and areas, creating a broad portfolio of ownerships and", "label_id": 2138910, "label_title": "Tencent", "label_link": "https://en.wikipedia.org/wiki?curid=16709162", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Google Cloud", "context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud, Tencent Cloud,", "context_right": "and others.", "_context_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud, Tencent Cloud, ", "_context_right": " and others.", "sentence_left": "This IP address was identified by our intelligence team as hosted by the well-known Russian-based BPH service [yalishanda](https://krebsonsecurity.com/2019/07/meet-the-worlds-biggest-bulletproof-hoster/).", "sentence_right": "The service uses the Chinese based free DNS provider DNSPOD to rotate client domains across the reverse proxy network.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "Chinese", "context_left": "The service uses the", "context_right": "based free DNS provider DNSPOD to rotate client domains across the reverse proxy network.", "_context_left": "The service uses the ", "_context_right": " based free DNS provider DNSPOD to rotate client domains across the reverse proxy network.", "sentence_left": "The actor yalishanda’s service offers a reverse proxy network that abuses cloud providers, such as Alibaba-Cloud, Tencent Cloud, Google Cloud and others.", "sentence_right": "This can be thought of as a host-based fast-flux service.", "label": "Greater China is an informal geographical area that shares commercial and cultural ties with the Han Chinese people, The notion of \"Greater China\" refers to the area that usually encompasses Mainland China, Hong Kong, Macau, and Taiwan in East Asia, places where the majority are culturally and ethnically Han Chinese. Some analysts may also include places which have predominantly ethnic Chinese population such as Singapore. The term can be generalised to encompass \"linkages among regional Chinese communities\".", "label_id": 5903531, "label_title": "China (region)", "label_link": "https://en.wikipedia.org/wiki?curid=50560673", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "payload", "context_left": "We initially were unable to download the intended", "context_right": "from hxxps://grpxmqnrb[.]pw/egrg4g3g, but by following the trail of infrastructure and record of activity, we were able to reproduce the steps and continue the investigation.", "_context_left": "We initially were unable to download the intended ", "_context_right": " from hxxps://grpxmqnrb[.]pw/egrg4g3g, but by following the trail of infrastructure and record of activity, we were able to reproduce the steps and continue the investigation.", "sentence_left": "-------------------------", "sentence_right": "The file invoice-522.xls (SHA256: 34c5591a749636853aef4f9b3867560319d78ab530a332575fee88a85287dcfa) was analyzed on the VirusTotal intelligence platform and found to communicate with the same IP address, although via a different domain and file path.", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "VirusTotal", "context_left": "The file invoice-522.xls (SHA256: 34c5591a749636853aef4f9b3867560319d78ab530a332575fee88a85287dcfa) was analyzed on the", "context_right": "intelligence platform and found to communicate with the same IP address, although via a different domain and file path.", "_context_left": "The file invoice-522.xls (SHA256: 34c5591a749636853aef4f9b3867560319d78ab530a332575fee88a85287dcfa) was analyzed on the ", "_context_right": " intelligence platform and found to communicate with the same IP address, although via a different domain and file path.", "sentence_left": "We initially were unable to download the intended payload from hxxps://grpxmqnrb[.]pw/egrg4g3g, but by following the trail of infrastructure and record of activity, we were able to reproduce the steps and continue the investigation.", "sentence_right": "This likely is a previous campaign by the same threat actor or group.", "label": "VirusTotal is a website created by the Spanish security company Hispasec Sistemas. Launched in June 2004, it was acquired by Google Inc. in September 2012. The company's ownership switched in January 2018 to Chronicle, a subsidiary of Alphabet Inc..  VirusTotal aggregates many antivirus products and online scan engines to check for viruses that the user's own antivirus may have missed, or to verify against any false positives. Files up to 550 MB can be uploaded to the website or sent via email. Anti-virus software vendors can receive copies of files that were flagged by other scans but passed by their own engine, to help improve their software and, by extension, VirusTotal's own capability. Users can also scan suspect URLs and search through the VirusTotal dataset. VirusTotal for dynamic analysis of malware uses Cuckoo sandbox. VirusTotal was selected by \"PC World\" as one of the best 100 products of 2007.", "label_id": 2031721, "label_title": "VirusTotal", "label_link": "https://en.wikipedia.org/wiki?curid=15472369", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "payload", "context_left": "This analysis provided a successful fetch of the initial", "context_right": ": 06afeaf2b0b985e0d9e048ea8ef0231026cac4c03d3ddf45f6a4ab18d884505c", "_context_left": "This analysis provided a successful fetch of the initial ", "_context_right": ": 06afeaf2b0b985e0d9e048ea8ef0231026cac4c03d3ddf45f6a4ab18d884505c", "sentence_left": "This likely is a previous campaign by the same threat actor or group.", "sentence_right": "This payload is an exact match of the one received by Amirreza Niakanlahiji and Pedram Amini in their blog post on a previous campaign from the same actors (see: ).", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "payload", "context_left": "This", "context_right": "is an exact match of the one received by Amirreza Niakanlahiji and Pedram Amini in their blog post on a previous campaign from the same actors (see: ).", "_context_left": "This ", "_context_right": " is an exact match of the one received by Amirreza Niakanlahiji and Pedram Amini in their blog post on a previous campaign from the same actors (see: ).", "sentence_left": "This analysis provided a successful fetch of the initial payload: 06afeaf2b0b985e0d9e048ea8ef0231026cac4c03d3ddf45f6a4ab18d884505c", "sentence_right": "They received a payload that contacted some unknown controllers:", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}
{"mention": "payload", "context_left": "They received a", "context_right": "that contacted some unknown controllers:", "_context_left": "They received a ", "_context_right": " that contacted some unknown controllers:", "sentence_left": "This payload is an exact match of the one received by Amirreza Niakanlahiji and Pedram Amini in their blog post on a previous campaign from the same actors (see: ).", "sentence_right": "* hxxps://aquolepp[.]pw/milagrecf.php", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2020-03-26_analysis-of-an-attempted-attack"}