{"mention": "Github", "context_left": "We noticed that the Malleable-C2 profile was based off this public profile on", "context_right": ":", "_context_left": "We noticed that the Malleable-C2 profile was based off this public profile on ", "_context_right": ":", "sentence_left": "Each Cobalt Strike variant was fetched from the very same server (http[:]//107.173.49.118) and tried to connect to https[:]//olhnmn.com (http[:]//217.12.201.194) based on the preferred communication protocol.", "sentence_right": "```", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "Canada", "context_left": "Through the course of our research, we identified 18 entities in", "context_right": ", Germany, Ireland, Luxembourg, the U.K. and the U.S. where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in ", "_context_right": ", Germany, Ireland, Luxembourg, the U.K. and the U.S. where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "Canada ( ) is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering , making it the world's second-largest country by total area. Its southern border with the United States, stretching some , is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.  As a whole, Canada is sparsely populated, the majority of its land area being dominated by forest and tundra. Its population is highly urbanized, with over 80 percent of its inhabitants concentrated in large and medium-sized cities, and 70 percent of citizens residing within of the southern border. Canada's climate varies widely across its vast area, ranging from arctic weather in the north, to hot summers in the southern regions, with four distinct seasons.  Various indigenous peoples have inhabited what is now Canada for thousands of years before European colonization. Beginning in the 16th century, British and French expeditions explored and later settled along the Atlantic coast. As a consequence of various armed conflicts, France ceded nearly all of its colonies in North America in 1763. In 1867, with the union of three British North American colonies through Confederation, Canada was formed as a federal dominion of four provinces. This began an accretion of provinces and territories and a process of increasing autonomy from the United Kingdom. This widening autonomy was highlighted by the Statute of Westminster of", "label_id": 1001810, "label_title": "Canada", "label_link": "https://en.wikipedia.org/wiki?curid=5042916", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "Germany", "context_left": "Through the course of our research, we identified 18 entities in Canada,", "context_right": ", Ireland, Luxembourg, the U.K. and the U.S. where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in Canada, ", "_context_right": ", Ireland, Luxembourg, the U.K. and the U.S. where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "Germany (, ), officially the Federal Republic of Germany (, ), is a country in Central and Western Europe, lying between the Baltic and North Seas to the north and the Alps, Lake Constance and the High Rhine to the south. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium and the Netherlands to the west.  Germany includes 16 constituent states, covers an area of , and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport. Germany's largest urban area is the Ruhr, with its main centres of Dortmund and Essen. The country's other major cities are Hamburg, Munich, Cologne, Stuttgart, Dusseldorf, Leipzig, Bremen, Dresden, Hanover, and Nuremberg.  Various Germanic tribes have inhabited the northern parts of modern Germany since classical antiquity. A region named Germania was documented before AD 100. During the Migration Period, the Germanic tribes expanded southward. Beginning in the 10th century, German territories formed a central part of the Holy Roman Empire. During the 16th century, northern German regions became the centre of the Protestant Reformation. After the collapse of the Holy Roman", "label_id": 5640, "label_title": "Germany", "label_link": "https://en.wikipedia.org/wiki?curid=11867", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "Ireland", "context_left": "Through the course of our research, we identified 18 entities in Canada, Germany,", "context_right": ", Luxembourg, the U.K. and the U.S. where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, ", "_context_right": ", Luxembourg, the U.K. and the U.S. where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "Ireland ( ), also known as the Republic of Ireland ('), is a country in north-western Europe occupying 26 of 32 counties of the island of Ireland. The capital and largest city is Dublin, which is located on the eastern side of the island. Around a third of the country's population of 4.8 million people resides in the greater Dublin area. The sovereign state shares its only land border with Northern Ireland, a part of the United Kingdom. It is otherwise surrounded by the Atlantic Ocean, with the Celtic Sea to the south, St George's Channel to the south-east, and the Irish Sea to the east. It is a unitary, parliamentary republic. The legislature, the ', consists of a lower house, ', an upper house, ', and an elected President (') who serves as the largely ceremonial head of state, but with some important powers and duties. The head of government is the ' (Prime Minister, literally 'Chief', a title not used in English), who is elected by the Dail and appointed by the President; the Taoiseach in turn appoints other government ministers.  The state was created as the Irish Free State in 1922 as a result of the Anglo-Irish Treaty. It was established as a dominion within the British Commonwealth of Nations. In 1936 the British king was removed from its constitution. Its current constitution was adopted in 1937 and saw the state renamed \"Ireland\" with an elected non-executive president as head of state. Ireland cut its last ties with the Commonwealth in", "label_id": 6954, "label_title": "Republic of Ireland", "label_link": "https://en.wikipedia.org/wiki?curid=14560", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "Luxembourg", "context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland,", "context_right": ", the U.K. and the U.S. where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland, ", "_context_right": ", the U.K. and the U.S. where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "Luxembourg (; ; ; ), officially the Grand Duchy of Luxembourg, is a small landlocked country in western Europe. It is bordered by Belgium to the west and north, Germany to the east, and France to the south. Its capital, Luxembourg City, is one of the four official capitals of the European Union (together with Brussels, Frankfurt, and Strasbourg) and the seat of the European Court of Justice, the highest judicial authority in the EU. Its culture, people, and languages are highly intertwined with its neighbours, making it essentially a mixture of French and German cultures, as evident by the nation's three official languages: French, German, and the national language of Luxembourgish. The repeated invasions by Germany, especially in World War II, resulted in the country's strong will for mediation between France and Germany and, among other things, led to the foundation of the European Union.  With an area of , it is one of the smallest sovereign states in Europe. In 2018, Luxembourg had a population of 602,005, which makes it one of the least-populous countries in Europe, but by far the one with the highest population growth rate. Foreigners account for nearly half of Luxembourg's population. As a representative democracy with a constitutional monarch, it is headed by Grand Duke Henri and is the world's only remaining sovereign grand duchy. Luxembourg is a developed country, with an advanced economy and one of the world's highest GDP (PPP) per capita. The City of Luxembourg with its old quarters and fortifications was declared a", "label_id": 8489, "label_title": "Luxembourg", "label_link": "https://en.wikipedia.org/wiki?curid=17515", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "U.K.", "context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland, Luxembourg, the", "context_right": "and the U.S. where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland, Luxembourg, the ", "_context_right": " and the U.S. where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country located off the north-western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the United Kingdom that shares a land border with another sovereign state, the Republic of Ireland. Apart from this land border, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the south-west, giving it the 12th-longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. The United Kingdom's were home to an estimated 66.0 million inhabitants in 2017.  The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The current monarch is Queen Elizabeth II, who has reigned since 1952, making her the world's longest-serving current head of state. The United Kingdom's capital and largest city is London, a global city and financial centre with an urban area population of 10.3 million. Other major cities include Birmingham, Manchester, Glasgow, Leeds and Liverpool.  The United Kingdom consists of four constituent countries: England, Scotland, Wales, and Northern Ireland. Their capitals are London, Edinburgh, Cardiff, and Belfast, respectively. Apart from England, the countries have their own devolved governments, each with varying powers, but such power is delegated by the Parliament of the United Kingdom,", "label_id": 15734, "label_title": "United Kingdom", "label_link": "https://en.wikipedia.org/wiki?curid=31717", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}
{"mention": "U.S.", "context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland, Luxembourg, the U.K. and the", "context_right": "where the script was deployed.", "_context_left": "Through the course of our research, we identified 18 entities in Canada, Germany, Ireland, Luxembourg, the U.K. and the ", "_context_right": " where the script was deployed.", "sentence_left": "The tactics, techniques and procedures (TTPs) used by the operator or operators of the VBScript tool suggested they might be operating undisclosed ransomware and using the script at the initial compromise stage and to conduct reconnaissance in the system.", "sentence_right": "|", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-19_cobalt-strike-cybercriminals-trickbot-qbot"}