{"mention": "United States", "context_left": "May 10, 2021 With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the", "context_right": ", another well-known variant on the cybercrime underground has been thrust into the international spotlight. On May 10, 2021, the U.S. Federal Bureau of Investigation announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event.", "_context_left": "With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the ", "_context_right": ", another well-known variant on the cybercrime underground has been thrust into the international spotlight.", "sentence_left": "May 10, 2021", "sentence_right": "On May 10, 2021, the U.S. Federal Bureau of Investigation announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "U.S.", "context_left": "With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the United States, another well-known variant on the cybercrime underground has been thrust into the international spotlight. On May 10, 2021, the", "context_right": "Federal Bureau of Investigation announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event. While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year.", "_context_left": "On May 10, 2021, the ", "_context_right": " Federal Bureau of Investigation announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event.", "sentence_left": "With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the United States, another well-known variant on the cybercrime underground has been thrust into the international spotlight.", "sentence_right": "While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "Federal Bureau of Investigation", "context_left": "With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the United States, another well-known variant on the cybercrime underground has been thrust into the international spotlight. On May 10, 2021, the U.S.", "context_right": "announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event. While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year.", "_context_left": "On May 10, 2021, the U.S. ", "_context_right": " announced the attack on Colonial Pipeline was caused by the DarkSide ransomware variant, which forced the company to halt the pipeline’s operations so Colonial could carry out a full investigation into the event.", "sentence_left": "With the ransomware incident that [shut down a major fuel pipeline](https://www.washingtonpost.com/business/2021/05/08/cyber-attack-colonial-pipeline/) in the United States, another well-known variant on the cybercrime underground has been thrust into the international spotlight.", "sentence_right": "While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year.", "label": "The Federal Bureau of Investigation (FBI) is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. Operating under the jurisdiction of the United States Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.  Although many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in smaller cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.  Despite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in U.S. embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. The FBI can and does at times carry out secret activities overseas, just as the CIA has a limited", "label_id": 5289, "label_title": "Federal Bureau of Investigation", "label_link": "https://en.wikipedia.org/wiki?curid=11127", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "cybercriminals", "context_left": "While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year. The following is an examination of how DarkSide rose to prominence among", "context_right": "— which Intel 471 has been tracking since they emerged in the underground — in an ecosystem that is teeming with actors looking for new ways to extort businesses out of their money. While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model.", "_context_left": "The following is an examination of how DarkSide rose to prominence among ", "_context_right": " — which Intel 471 has been tracking since they emerged in the underground — in an ecosystem that is teeming with actors looking for new ways to extort businesses out of their money.", "sentence_left": "While the general public may be hearing DarkSide’s name for the first time, Intel 471 has been tracking those associated with the variant since they first announced their products to the cybercrime underground last year.", "sentence_right": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model.", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "Russian-language", "context_left": "The following is an examination of how DarkSide rose to prominence among cybercriminals — which Intel 471 has been tracking since they emerged in the underground — in an ecosystem that is teeming with actors looking for new ways to extort businesses out of their money. While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular", "context_right": "hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model. Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in Europe and the United States.", "_context_left": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular ", "_context_right": " hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model.", "sentence_left": "The following is an examination of how DarkSide rose to prominence among cybercriminals — which Intel 471 has been tracking since they emerged in the underground — in an ecosystem that is teeming with actors looking for new ways to extort businesses out of their money.", "sentence_right": "Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in Europe and the United States.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "Europe", "context_left": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model. Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in", "context_right": "and the United States. In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates.", "_context_left": "Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in ", "_context_right": " and the United States.", "sentence_left": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model.", "sentence_right": "In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "United States", "context_left": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model. Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in Europe and the", "context_right": ". In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates.", "_context_left": "Soon after, the ransomware was spotted to be behind numerous attacks, including several incidents targeting manufacturers and law firms in Europe and the ", "_context_right": ".", "sentence_left": "While spotted in the wild as far back as August 2020, DarkSide’s developer “debuted” the ransomware on the popular Russian-language hacker forum XSS in November 2020, advertising that he was looking for partners in an attempt to adopt an affiliate “as-a-service” model.", "sentence_right": "In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "Microsoft", "context_left": "In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates. These included versions for targeting", "context_right": "Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS). With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like Citrix, Remote Desktop Web (RDWeb), or remote desktop protocol (RDP), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware.", "_context_left": "These included versions for targeting ", "_context_right": " Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS).", "sentence_left": "In March 2021, the developer rolled out a number of new features in an effort to attract new affiliates.", "sentence_right": "With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like Citrix, Remote Desktop Web (RDWeb), or remote desktop protocol (RDP), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "Citrix", "context_left": "These included versions for targeting Microsoft Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS). With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like", "context_right": ", Remote Desktop Web (RDWeb), or remote desktop protocol (RDP), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware. For initial access to networks, actors usually purchased access credentials on underground forums, conducted brute-force attacks, used spam campaigns to spread malware loaders and/or bought access to popular botnets such as Dridex, TrickBot and ZLoader.", "_context_left": "With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like ", "_context_right": ", Remote Desktop Web (RDWeb), or remote desktop protocol (RDP), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware.", "sentence_left": "These included versions for targeting Microsoft Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS).", "sentence_right": "For initial access to networks, actors usually purchased access credentials on underground forums, conducted brute-force attacks, used spam campaigns to spread malware loaders and/or bought access to popular botnets such as Dridex, TrickBot and ZLoader.", "label": "Citrix Systems, Inc. is an American multinational software company that provides server, application and desktop virtualization, networking, software as a service (SaaS), and cloud computing technologies. Citrix solutions are claimed to be in use by over 400,000 clients worldwide, including 99% of the Fortune 100, and 98% of the Fortune 500. The company was founded in Richardson, Texas in 1989 by Ed Iacobucci, who served as chairman until his departure in 2000. It began by developing remote access products for Microsoft operating systems, licensing source code from Microsoft, and has been in partnership with the company throughout its history. By the 1990s, Citrix came to prominence as an industry leader in thin client technology, enabling purpose-built devices to access remote servers and resources. The company launched its first initial public offering in 1995 and, with few competitors, experienced large revenue increases between 1995 and 1999. Citrix acquired Sequoia Software Corp. in 2001 and ExpertCity, a provider of remote desktop products, in 2003. This was followed by more than a dozen other acquisitions from 2005 to 2012, which allowed Citrix to expand into server and desktop virtualization, cloud computing, Infrastructure as a Service, and Software as a Service offerings. In 2014, Citrix acquired Framehawk and used its technology to improve the delivery of virtual desktops and applications over wireless networks. In 2016, as part of a US$1.8 billion product deal with LogMeIn, Citrix spun off the GoTo product line into a new business entity, entitled GetGo. In 2017, Citrix completed the merger of GetGo with LogMeIn's", "label_id": 142057, "label_title": "Citrix Systems", "label_link": "https://en.wikipedia.org/wiki?curid=309948", "entity_class": "NE", "entity_type": "ORG", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "RDP", "context_left": "These included versions for targeting Microsoft Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS). With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like Citrix, Remote Desktop Web (RDWeb), or remote desktop protocol (", "context_right": "), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware. For initial access to networks, actors usually purchased access credentials on underground forums, conducted brute-force attacks, used spam campaigns to spread malware loaders and/or bought access to popular botnets such as Dridex, TrickBot and ZLoader.", "_context_left": "With respect to DarkSide’s affiliates, there is overlap in how the ransomware was delivered, including affiliates gaining initial network access by exploiting vulnerable software like Citrix, Remote Desktop Web (RDWeb), or remote desktop protocol (", "_context_right": "), performing lateral movement, and exfiltrating sensitive data before ultimately deploying ransomware.", "sentence_left": "These included versions for targeting Microsoft Windows and Linux based systems, enhanced encryption settings, a full-fledged and integrated feature built directly into the management panel that enabled affiliates to arrange calls meant to pressure victims into paying ransoms, and a way to launch a distributed denial-of-service (DDoS).", "sentence_right": "For initial access to networks, actors usually purchased access credentials on underground forums, conducted brute-force attacks, used spam campaigns to spread malware loaders and/or bought access to popular botnets such as Dridex, TrickBot and ZLoader.", "label": "Remote Desktop Protocol (RDP) is a proprietary protocol developed by Microsoft, which provides a user with a graphical interface to connect to another computer over a network connection. The user employs RDP client software for this purpose, while the other computer must run RDP server software.  Clients exist for most versions of Microsoft Windows (including Windows Mobile), Linux, Unix, macOS, iOS, Android, and other operating systems. RDP servers are built into Windows operating systems; an RDP server for Unix and OS X also exists. By default, the server listens on TCP port 3389 and UDP port 3389.  Microsoft currently refers to their official RDP client software as Remote Desktop Connection, formerly \"Terminal Services Client\".  The protocol is an extension of the ITU-T T.128 application sharing protocol.", "label_id": 246384, "label_title": "Remote Desktop Protocol", "label_link": "https://en.wikipedia.org/wiki?curid=652617", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "sub-Saharan Africa", "context_left": "This is not the first time DarkSide operators have tried to put PR spin on their actions. In October, [the group announced on its blog](https://www.zdnet.com/article/ransomware-gang-donates-part-of-ransom-demands-to-charity-organizations/) that it would donate a portion of the collected ransoms to [Children International](https://www.children.org/), non-profit child sponsorship organization dedicated to fighting poverty, and [The Water Project](https://thewaterproject.org/), a non-profit aiming to provide clean water to countries in", "context_right": ". \"We think it's fair that some of the money they've paid will go to charity,” the entry on the blog site read.", "_context_left": "In October, [the group announced on its blog](https://www.zdnet.com/article/ransomware-gang-donates-part-of-ransom-demands-to-charity-organizations/) that it would donate a portion of the collected ransoms to [Children International](https://www.children.org/), non-profit child sponsorship organization dedicated to fighting poverty, and [The Water Project](https://thewaterproject.org/), a non-profit aiming to provide clean water to countries in ", "_context_right": ".", "sentence_left": "This is not the first time DarkSide operators have tried to put PR spin on their actions.", "sentence_right": "\"We think it's fair that some of the money they've paid will go to charity,” the entry on the blog site read.", "label": "Sub-Saharan Africa is, geographically, the area of the continent of Africa that lies south of the Sahara. According to the United Nations, it consists of all African countries that are fully or partially located south of the Sahara. It contrasts with North Africa, whose territories are part of the League of Arab states within the Arab world. The states of Somalia, Djibouti, Comoros and the Arabic speaking Mauritania are however geographically in sub-Saharan Africa, although they are members of the Arab League as well. The UN Development Program lists 46 of Africa’s 54 countries as “sub-Saharan,” excluding Algeria, Djibouti, Egypt, Libya, Morocco, Somalia, Sudan and Tunisia.  The Sahel is the transitional zone in between the Sahara and the tropical savanna of the Sudan region and farther south the forest-savanna mosaic of tropical Africa.  Since probably 3500 BCE, the Saharan and sub-Saharan regions of Africa have been separated by the extremely harsh climate of the sparsely populated Sahara, forming an effective barrier interrupted by only the Nile in Sudan, though the Nile was blocked by the river's cataracts. The Sahara pump theory explains how flora and fauna (including \"Homo sapiens\") left Africa to penetrate the Middle East and beyond. African pluvial periods are associated with a Wet Sahara phase, during which larger lakes and more rivers existed.  The use of the term has been criticized because it refers to the South only by cartography conventions and projects a connotation of inferiority; a vestige of colonialism, which some say, divided Africa into European terms of", "label_id": 13405, "label_title": "Sub-Saharan Africa", "label_link": "https://en.wikipedia.org/wiki?curid=27067", "entity_class": "NE", "entity_type": "LOC", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}
{"mention": "cybercriminals", "context_left": "The popularity and increasing maturity of the ransomware-as-a-service model combined with the aging systems that control energy systems is a compounding problem. As threat actors continue to observe ransomware’s operational success, more", "context_right": "likely will want to get in on the action due to its thriving sub-industries (i.e. access brokers, credential shops, and bulletproof hosting) and higher returns when compared other crimes (i.e. targeting bank accounts). It’s imperative that companies responsible for critical infrastructure understand that insecure systems present a juicy ransomware target to the cybercriminal underground, and proactive defenses will go a long way in preventing future incidents like what happened with Colonial Pipeline.", "_context_left": "As threat actors continue to observe ransomware’s operational success, more ", "_context_right": " likely will want to get in on the action due to its thriving sub-industries (i.e. access brokers, credential shops, and bulletproof hosting) and higher returns when compared other crimes (i.e. targeting bank accounts).", "sentence_left": "The popularity and increasing maturity of the ransomware-as-a-service model combined with the aging systems that control energy systems is a compounding problem.", "sentence_right": "It’s imperative that companies responsible for critical infrastructure understand that insecure systems present a juicy ransomware target to the cybercriminal underground, and proactive defenses will go a long way in preventing future incidents like what happened with Colonial Pipeline.", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "intel471_2021-05-10_darkside-ransomware-colonial-pipeline-attack"}