{"mention": "China", "context_left": "", "context_right": ": From culture to conflict in the cyberspace April 14, 2020", "_context_left": "", "_context_right": ": From culture to conflict in the cyberspace", "sentence_left": "", "sentence_right": "April 14, 2020", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "US", "context_left": "April 14, 2020 Since in 2013 the", "context_right": "cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "_context_left": "Since in 2013 the ", "_context_right": " cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_left": "April 14, 2020", "sentence_right": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Mandiant", "context_left": "April 14, 2020 Since in 2013 the US cybersecurity consultancy", "context_right": "published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "_context_left": "Since in 2013 the US cybersecurity consultancy ", "_context_right": " published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_left": "April 14, 2020", "sentence_right": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "label": "Mandiant is an American cybersecurity firm. It rose to prominence in February 2013 when it released a report directly implicating China in cyber espionage. On December 30, 2013, Mandiant was acquired by FireEye in a stock and cash deal worth in excess of $1 billion.", "label_id": 4096704, "label_title": "Mandiant", "label_link": "https://en.wikipedia.org/wiki?curid=38573495", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese government", "context_left": "April 14, 2020 Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the", "context_right": ", the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "_context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the ", "_context_right": ", the news about its actions in cyberspace has been significantly increased.", "sentence_left": "April 14, 2020", "sentence_right": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "label": "The central government of the People's Republic of China is divided among several state organs:   The legal power of the Communist Party is guaranteed by the PRC Constitution and its position as the supreme political authority in the PRC is realised through its comprehensive control of the state, military, and media. According to a prominent government spokesman:We will never simply copy the system of Western countries or introduce a system of multiple parties holding office in rotation; although China’s state organs have different responsibilities, they all adhere to the line, principles and policies of the party.  The primary organs of state power are the National People's Congress (NPC), the President, and the State Council. Members of the State Council include the Premier, a variable number of Vice Premiers (now four), five State Councilors (protocol equal of vice premiers but with narrower portfolios), The Secretary-General, and now 26 ministers and other cabinet-level department heads. During the 1980s there was an attempt made to separate party and state functions, with the party deciding general policy and the state carrying it out. The attempt was abandoned in the 1990s with the result that the political leadership within the state are also the leaders of the party. This dual structure thereby creates a single centralized focus of power.  At the same time there has been a move to separate party and state offices at levels other than the central government. It is not unheard of for a sub-national executive to also be party secretary. This", "label_id": 750050, "label_title": "Government of China", "label_link": "https://en.wikipedia.org/wiki?curid=3205521", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "US", "context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the", "context_right": "DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "_context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the ", "_context_right": " DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_right": "With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese military", "context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five", "context_right": "members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "_context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five ", "_context_right": " members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_right": "With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "label": "The Republic of China Military Academy (also known as ) is the military academy for the army of the Republic of China, located in Fengshan District, Kaohsiung. Previously known as the the military academy produced many prestigious commanders who fought in many of China's conflicts in the 20th century, notably the Northern Expedition, the Second Sino-Japanese War and the Chinese Civil War.  The military academy was officially opened on May 1, 1924 under the Kuomintang (KMT), but the first lessons began on June 16, 1924. The inauguration was on Changzhou Island offshore from the Whampoa (Huangpu) dock in Guangzhou, thus earning its name. During the inaugural ceremonies, Sun Yat-sen (or Sun Yixian) delivered a speech that was later to become the lyrics of the national anthem of the Republic of China. It has been considered one of the most important institutions of the Republic of China with National Chengchi University, which is a prestigious incubator for senior civil service.  After the Republic of China government retreated from mainland China to Taiwan, the academy was re-established as the Republic of China Military Academy in Fengshan District, Kaohsiung.", "label_id": 165603, "label_title": "Republic of China Military Academy", "label_link": "https://en.wikipedia.org/wiki?curid=383837", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "FBI", "context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the", "context_right": "has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "_context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the ", "_context_right": " has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_right": "With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "label": "The Federal Bureau of Investigation (FBI) is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. Operating under the jurisdiction of the United States Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.  Although many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in smaller cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.  Despite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in U.S. embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. The FBI can and does at times carry out secret activities overseas, just as the CIA has a limited", "label_id": 5289, "label_title": "Federal Bureau of Investigation", "label_link": "https://en.wikipedia.org/wiki?curid=11127", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "PLA", "context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of", "context_right": "unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "_context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of ", "_context_right": " unit 61398 (People’s Liberations Army) with APT1.", "sentence_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_right": "With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "label": "The Chinese People's Liberation Army (PLA) is the armed forces of the People's Republic of China (PRC) and its founding and ruling political party, the Communist Party of China (CPC). The PLA consists of five professional service branches: the Ground Force, Navy, Air Force, Rocket Force, and the Strategic Support Force. Units around the country are assigned to one of five theater commands by geographical location. The PLA is the world's largest military force and constitutes the second largest defence budget in the world. It is one of the fastest modernising military powers in the world and has been termed as a potential military superpower, with significant regional defense and rising global power projection capabilities.  The PLA is under the command of the Central Military Commission (CMC) of the CPC. It is legally obliged to follow the principle of civilian control of the military, although in practical terms this principle has been implemented in such a way as to ensure the PLA is under the absolute control of the Communist Party. Its commander in chief is the Chairman of the Central Military Commission (usually the General Secretary of the Communist Party of China). Since 1949, China has used nine different military strategies, which the PLA calls \"strategic guidelines\". The most important came in 1956, 1980, and 1993. In times of national emergency, the People's Armed Police and the People's Liberation Army militia act as a reserve and support element for the PLAGF.", "label_id": 33243, "label_title": "People's Liberation Army", "label_link": "https://en.wikipedia.org/wiki?curid=66890", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "People’s Liberations Army", "context_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased. Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (", "context_right": ") with APT1. With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "_context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (", "_context_right": ") with APT1.", "sentence_left": "Since in 2013 the US cybersecurity consultancy Mandiant published its famous report about APT1, showing its links with different agencies presumably associated with the Chinese government, the news about its actions in cyberspace has been significantly increased.", "sentence_right": "With the permission of Russia and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "label": "The Chinese People's Liberation Army (PLA) is the armed forces of the People's Republic of China (PRC) and its founding and ruling political party, the Communist Party of China (CPC). The PLA consists of five professional service branches: the Ground Force, Navy, Air Force, Rocket Force, and the Strategic Support Force. Units around the country are assigned to one of five theater commands by geographical location. The PLA is the world's largest military force and constitutes the second largest defence budget in the world. It is one of the fastest modernising military powers in the world and has been termed as a potential military superpower, with significant regional defense and rising global power projection capabilities.  The PLA is under the command of the Central Military Commission (CMC) of the CPC. It is legally obliged to follow the principle of civilian control of the military, although in practical terms this principle has been implemented in such a way as to ensure the PLA is under the absolute control of the Communist Party. Its commander in chief is the Chairman of the Central Military Commission (usually the General Secretary of the Communist Party of China). Since 1949, China has used nine different military strategies, which the PLA calls \"strategic guidelines\". The most important came in 1956, 1980, and 1993. In times of national emergency, the People's Armed Police and the People's Liberation Army militia act as a reserve and support element for the PLAGF.", "label_id": 33243, "label_title": "People's Liberation Army", "label_link": "https://en.wikipedia.org/wiki?curid=66890", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Russia", "context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of", "context_right": "and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations. Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "_context_left": "With the permission of ", "_context_right": " and its popular operation against the DNC, China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "sentence_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_right": "Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "DNC", "context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the", "context_right": ", China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations. Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "_context_left": "With the permission of Russia and its popular operation against the ", "_context_right": ", China has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "sentence_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_right": "Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "label": "The Democratic National Committee (DNC) is the formal governing body for the United States Democratic Party. The committee coordinates strategy to support Democratic Party candidates throughout the country for local, state, and national office. It organizes the Democratic National Convention held every four years to nominate and confirm a candidate for president, and to formulate the party platform. While it provides support for party candidates, it does not have direct authority over elected officials.  The DNC is composed of the chairs and vice-chairs of each state Democratic Party committee and more than 200 members elected by Democrats in all 50 states and the territories. Its chair is elected by the committee. It conducts fundraising to support its activities.  The DNC was established at the 1848 Democratic National Convention. The DNC's main counterpart is the Republican National Committee.", "label_id": 100826, "label_title": "Democratic National Committee", "label_link": "https://en.wikipedia.org/wiki?curid=182450", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1. With the permission of Russia and its popular operation against the DNC,", "context_right": "has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations. Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "_context_left": "With the permission of Russia and its popular operation against the DNC, ", "_context_right": " has become the main actor in cyberspace, developing an uncountable number of operations against all kind of sectors as: IT, military or naval industries and different governmental organizations.", "sentence_left": "Among others, we find APT15, APT27 or Winnti Group (APT41); the US DoJ’s allegations of cyber espionage towards five Chinese military members associated with the APT1 group; the links that the FBI has established between Zhu Hua and Zhang Shilong and APT10; or the alleged link of PLA unit 61398 (People’s Liberations Army) with APT1.", "sentence_right": "Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition. According to traditional ancient texts,", "context_right": "civilization dates back more than 4,000 years with the first Xia dynasty. Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the Chinese Empire is considered the oldest empire that exists.", "_context_left": "According to traditional ancient texts, ", "_context_right": " civilization dates back more than 4,000 years with the first Xia dynasty.", "sentence_left": "Sometimes using more sophisticated malware, and sometimes less, but more and more with its own seal linked to its extensive tradition.", "sentence_right": "Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the Chinese Empire is considered the oldest empire that exists.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "According to traditional ancient texts, Chinese civilization dates back more than 4,000 years with the first Xia dynasty. Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the", "context_right": "Empire is considered the oldest empire that exists. The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion.", "_context_left": "Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the ", "_context_right": " Empire is considered the oldest empire that exists.", "sentence_left": "According to traditional ancient texts, Chinese civilization dates back more than 4,000 years with the first Xia dynasty.", "sentence_right": "The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the Chinese Empire is considered the oldest empire that exists. The historical endurance of the", "context_right": "empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion. As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though.", "_context_left": "The historical endurance of the ", "_context_right": " empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion.", "sentence_left": "Due to the continuity and strength of its political and social structure, the protection of its historical and cultural legacy and the practically null western influence until the 19th century, the Chinese Empire is considered the oldest empire that exists.", "sentence_right": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion. As an example, the Qing Dynasty, the last", "context_right": "dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though. Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "_context_left": "As an example, the Qing Dynasty, the last ", "_context_right": " dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though.", "sentence_left": "The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion.", "sentence_right": "Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion. As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the", "context_right": "population as it could be though. Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "_context_left": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the ", "_context_right": " population as it could be though.", "sentence_left": "The historical endurance of the Chinese empire has not been based solely on military victories, but on its peculiar way of understanding resistance to foreign invasion.", "sentence_right": "Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Yuan dynasty", "context_left": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though. Similarly, the", "context_right": "(1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan. Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "_context_left": "Similarly, the ", "_context_right": " (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "sentence_left": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though.", "sentence_right": "Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "label": "The Yuan dynasty (; ), officially the Great Yuan (; Middle Mongolian: , , literally \"Great Yuan State\"), was the empire or ruling dynasty of China established by Kublai Khan, leader of the Mongolian Borjigin clan. It followed the Song dynasty and preceded the Ming dynasty. Although the Mongols had ruled territories including modern-day North China for decades, it was not until 1271 that Kublai Khan officially proclaimed the dynasty in the traditional Chinese style, and the conquest was not complete until 1279 when the Southern Song dynasty was defeated in the Battle of Yamen. His realm was, by this point, isolated from the other Mongol khanates and controlled most of modern-day China and its surrounding areas, including modern Mongolia. It was the first non-Han Chinese dynasty to rule all of China and lasted until 1368 when the Ming dynasty defeated the Yuan forces. Following that, the rebuked Genghisid rulers retreated to their Mongolian homeland and continued to rule as the Northern Yuan dynasty. Some of the Mongolian Emperors of the Yuan mastered the Chinese language, while others only used their native language (i.e. Mongolian) and the 'Phags-pa script.  The Yuan dynasty was the khanate ruled by the successors of Mongke Khan after the division of the Mongol Empire. In official Chinese histories, the Yuan dynasty bore the Mandate of Heaven. The dynasty was established by Kublai Khan, yet he placed his grandfather Genghis Khan on the imperial records as the official founder of the dynasty as Taizu. In the Proclamation of the Dynastic", "label_id": 2406179, "label_title": "Yuan dynasty", "label_link": "https://en.wikipedia.org/wiki?curid=19606306", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Mongol", "context_left": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though. Similarly, the Yuan dynasty (1279-1368) was founded by", "context_right": "invaders, heirs to the legacy of Genghis Khan. Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "_context_left": "Similarly, the Yuan dynasty (1279-1368) was founded by ", "_context_right": " invaders, heirs to the legacy of Genghis Khan.", "sentence_left": "As an example, the Qing Dynasty, the last Chinese dynasty that ruled between 1644 and 1912, was founded by the Aisin-Gioro clan of Manchuria (the Manchus are currently an ethnic minority) and not by the Chinese population as it could be though.", "sentence_right": "Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "label": "Mongolia (; in Mongolian Cyrillic; [transliterated] in Mongolian script) is a landlocked country in East Asia. Its area is roughly equivalent with the historical territory of Outer Mongolia, and that term is sometimes used to refer to the current state. It is sandwiched between Russia to the north and China to the south, where it neighbours the Inner Mongolia Autonomous Region. Mongolia does not share a border with Kazakhstan, although only separates them.  At , Mongolia is the 18th-largest and the most sparsely populated sovereign state in the world, with a population of around three million people. It is also the world's second-largest landlocked country behind Kazakhstan and the largest landlocked country that does not border a closed sea. The country contains very little arable land, as much of its area is covered by grassy steppe, with mountains to the north and west and the Gobi Desert to the south. Ulaanbaatar, the capital and largest city, is home to about 45% of the country's population. Ulaanbaatar also shares the rank of the world's coldest capital city with Moscow, Ottawa, and Nur-Sultan.  Approximately 30% of the population is nomadic or semi-nomadic; horse culture is still integral. The majority of its population are Buddhists. The non-religious population is the second largest group. Islam is the dominant religion among ethnic Kazakhs. The majority of the state's citizens are of Mongol ethnicity, although Kazakhs, Tuvans, and other minorities also live in the country, especially in the west. Mongolia joined the World Trade Organization in 1997 and seeks", "label_id": 9412, "label_title": "Mongolia", "label_link": "https://en.wikipedia.org/wiki?curid=19271", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan. Despite this, the language, customs and tradition remained unchanged thanks to the", "context_right": "bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language. Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending China’s national interests.", "_context_left": "Despite this, the language, customs and tradition remained unchanged thanks to the ", "_context_right": " bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "sentence_left": "Similarly, the Yuan dynasty (1279-1368) was founded by Mongol invaders, heirs to the legacy of Genghis Khan.", "sentence_right": "Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending China’s national interests.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language. Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending", "context_right": "’s national interests. ![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "_context_left": "Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending ", "_context_right": "’s national interests.", "sentence_left": "Despite this, the language, customs and tradition remained unchanged thanks to the Chinese bureaucratic elites, who offered their services to the invaders with the excuse of the difficulty that would supposed to control a country with such dimensions, and making the only condition to maintain their methods and language.", "sentence_right": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "lab52", "context_left": "Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending China’s national interests. ![](https://", "context_right": ".io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg) The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of Huawei.", "_context_left": "![](https://", "_context_right": ".io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "sentence_left": "Because of this, the second-generation of invaders would assimilate the culture, coming to be seen as outsiders by their home territories, and finally, ending up defending China’s national interests.", "sentence_right": "The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of Huawei.", "label": "A company, abbreviated as co., is a legal entity made up of an association of people, be they natural, legal, or a mixture of both, for carrying on a commercial or industrial enterprise. Company members share a common purpose, and unite to focus their various talents and organize their collectively available skills or resources to achieve specific, declared goals. Companies take various forms, such as:   A company or association of persons can be created at law as a legal person so that the company in itself can accept limited liability for civil responsibility and taxation incurred as members perform (or fail to discharge) their duty within the publicly declared \"\"birth certificate\"\" or published policy.  Companies as legal persons may associate and register themselves collectively as other companies – often known as a corporate group. When a company closes, it may need a \"\"death certificate\"\" to avoid further legal obligations.", "label_id": 986634, "label_title": "Company", "label_link": "https://en.wikipedia.org/wiki?curid=4918223", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg) The resistance and adaptability typical of the", "context_right": "character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of Huawei. Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "_context_left": "The resistance and adaptability typical of the ", "_context_right": " character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of Huawei.", "sentence_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "sentence_right": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "United States", "context_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg) The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the", "context_right": "as well, leading the deployment of 5G by the hand of Huawei. Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "_context_left": "The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the ", "_context_right": " as well, leading the deployment of 5G by the hand of Huawei.", "sentence_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "sentence_right": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Huawei", "context_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg) The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of", "context_right": ". Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "_context_left": "The resistance and adaptability typical of the Chinese character towards the invader is still present, and we have witnessed the transformation of a society that in 1984 was fundamentally agricultural (40% of its GDP), and that just 35 years later dominates the technological world scenario with to the United States as well, leading the deployment of 5G by the hand of ", "_context_right": ".", "sentence_left": "![](https://lab52.io/blog/wp-content/uploads/2020/04/mountain-3022908_1920-1024x682.jpg)", "sentence_right": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "label": "Huawei Technologies Co. Ltd. (; ) is a Chinese multinational technology company that provides telecommunications equipment and sells consumer electronics, including smartphonesand is headquartered in Shenzhen, Guangdong province.  The company was founded in 1987 by Ren Zhengfei. Initially focused on manufacturing phone switches, Huawei has expanded its business to include building telecommunications networks, providing operational and consulting services and equipment to enterprises inside and outside of China, and manufacturing communications devices for the consumer market. Huawei had over 188,000 employees , around 76,000 of them engaged in Research & Development (R&D). It has 21 R&D institutes around the world, and in the late 2010s, opened the dedicated Ox Horn Campus. , the company invested US$13.8 billion in R&D.  Huawei has deployed its products and services in more than 170 countries, and it served 45 of the 50 largest telecom operators. Its networks, numbering over 1,500, reach one third of the world's population. Huawei overtook Ericsson in 2012 as the largest telecommunications-equipment manufacturer in the world, and overtook Apple in 2018 as the second-largest manufacturer of smartphones in the world, behind Samsung Electronics. It ranks 72nd on the \"Fortune\" Global 500 list. In December 2018, Huawei reported that its annual revenue had risen to US$108.5 billion in 2018 (a 21% increase over 2017).  Although successful internationally, Huawei has faced difficulties in some markets, due to cybersecurity allegations—primarily from the United States government—that Huawei's infrastructure equipment may enable surveillance by the Chinese government. Especially with the development of 5G wireless networks (which China has aggressively promoted),", "label_id": 135679, "label_title": "Huawei", "label_link": "https://en.wikipedia.org/wiki?curid=290909", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Canadian Intelligence and Security Service", "context_left": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest. As the comparison mentioned by the former head of the", "context_right": "for Asia-Pacific, Michel Juneau-Katsua, if Western intelligence had to steal a beach, he would go at night and wait for nobody to see him to steal it. On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "_context_left": "As the comparison mentioned by the former head of the ", "_context_right": " for Asia-Pacific, Michel Juneau-Katsua, if Western intelligence had to steal a beach, he would go at night and wait for nobody to see him to steal it.", "sentence_left": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "sentence_right": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "label": "The Canadian Security Intelligence Service (CSIS, ; , \"SCRS\") is Canada's primary national intelligence service. It is responsible for collecting, analysing, reporting and disseminating intelligence on threats to Canada's national security, and conducting operations, covert and overt, within Canada and abroad. It also reports to and advises the Government of Canada on national security issues and situations that threaten the security of the nation.  Its headquarters are located in Ottawa in a purpose-built facility completed in 1995. CSIS is responsible to Parliament through the Minister of Public Safety, but is also overseen by the Federal Court and the National Security and Intelligence Review Agency.", "label_id": 146723, "label_title": "Canadian Security Intelligence Service", "label_link": "https://en.wikipedia.org/wiki?curid=323656", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Asia-Pacific", "context_left": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest. As the comparison mentioned by the former head of the Canadian Intelligence and Security Service for", "context_right": ", Michel Juneau-Katsua, if Western intelligence had to steal a beach, he would go at night and wait for nobody to see him to steal it. On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "_context_left": "As the comparison mentioned by the former head of the Canadian Intelligence and Security Service for ", "_context_right": ", Michel Juneau-Katsua, if Western intelligence had to steal a beach, he would go at night and wait for nobody to see him to steal it.", "sentence_left": "Such achievement has occurred not only in terms of competitiveness, but also by making its technology an intrinsic part of its legacy and by putting technological development at the service of the national interest.", "sentence_right": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "label": "Asia-Pacific or Asia Pacific (abbreviated as APAC, Asia-Pac, AsPac, APJ, JAPA or JAPAC) is the part of the world in or near the Western Pacific Ocean. The region varies in area depending on which context, but it typically includes much of East Asia, South Asia, Southeast Asia, and Oceania.  The term may also include parts of Russia (on the North Pacific) and countries in the Americas which are on the coast of the Eastern Pacific Ocean; the Asia-Pacific Economic Cooperation, for example, includes Canada, Chile, Russia, Mexico, Peru, and the United States. Alternatively, the term sometimes comprises all of Asia and Australasia as well as Pacific island nations (Asia Pacific and Australian continent)—for example when dividing the world into large regions for commercial purposes (e.g. into the Americas, EMEA and Asia Pacific). Western Asia is almost never included.  On the whole there is no clear-cut definition of \"Asia Pacific\" and the regions included change per context. The term has become popular since the late 1980s in commerce, finance and politics. Despite the heterogeneity of the regions' economies, most individual nations within the zone are emerging markets experiencing rapid growth. (Compare the concept/acronym APEJ or APeJ—Asia-Pacific excluding Japan.)", "label_id": 435943, "label_title": "Asia-Pacific", "label_link": "https://en.wikipedia.org/wiki?curid=1496582", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Xiaomi", "context_left": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day. Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as", "context_right": "or Huawei and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet. It is not uncommon to find binaries with Mandarin language resources or drivers signed by Chinese companies, which could potentially facilitate a campaign directed against any organization.", "_context_left": "Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as ", "_context_right": " or Huawei and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet.", "sentence_left": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "sentence_right": "It is not uncommon to find binaries with Mandarin language resources or drivers signed by Chinese companies, which could potentially facilitate a campaign directed against any organization.", "label": "Xiaomi Corporation (; ) is a Chinese electronics company founded in 2010 and headquartered in Beijing. Xiaomi makes and invests in smartphones, mobile apps, laptops, bags, trimmers, earphones, MI Television, Shoes, fitness bands, and many other products. Ranked 468th, Xiaomi is the youngest company on Fortune Global 500 List for 2019.  Xiaomi released its first smartphone in August 2011 and rapidly gained market share in China to become the country's largest smartphone company in 2014. At the start of second quarter of 2018, Xiaomi was the world's fourth-largest smartphone manufacturer, leading in both the largest market, China, and the second-largest market, India. Xiaomi later developed a wider range of consumer electronics, including a smart home (IoT) device ecosystem.  Xiaomi has 15,000 employees in China, India, Malaysia, Singapore and is expanding to other countries including Indonesia, the Philippines, and South Africa. According to \"Forbes\" magazine, Lei Jun, the founder and CEO, has an estimated net worth of US$12.5 billion. He is China's 11th richest person and 118th in the world. Xiaomi is the world's 4th most valuable technology start-up after receiving US$1.1 billion funding from investors, making Xiaomi's valuation more than US$46 billion.", "label_id": 3650110, "label_title": "Xiaomi", "label_link": "https://en.wikipedia.org/wiki?curid=33454300", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Huawei", "context_left": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day. Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as Xiaomi or", "context_right": "and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet. It is not uncommon to find binaries with Mandarin language resources or drivers signed by Chinese companies, which could potentially facilitate a campaign directed against any organization.", "_context_left": "Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as Xiaomi or ", "_context_right": " and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet.", "sentence_left": "On the other hand, if Chinese intelligence had to do it, it would send a thousand tourists and on the way back they would shake their towels, day by day.", "sentence_right": "It is not uncommon to find binaries with Mandarin language resources or drivers signed by Chinese companies, which could potentially facilitate a campaign directed against any organization.", "label": "Huawei Technologies Co. Ltd. (; ) is a Chinese multinational technology company that provides telecommunications equipment and sells consumer electronics, including smartphonesand is headquartered in Shenzhen, Guangdong province.  The company was founded in 1987 by Ren Zhengfei. Initially focused on manufacturing phone switches, Huawei has expanded its business to include building telecommunications networks, providing operational and consulting services and equipment to enterprises inside and outside of China, and manufacturing communications devices for the consumer market. Huawei had over 188,000 employees , around 76,000 of them engaged in Research & Development (R&D). It has 21 R&D institutes around the world, and in the late 2010s, opened the dedicated Ox Horn Campus. , the company invested US$13.8 billion in R&D.  Huawei has deployed its products and services in more than 170 countries, and it served 45 of the 50 largest telecom operators. Its networks, numbering over 1,500, reach one third of the world's population. Huawei overtook Ericsson in 2012 as the largest telecommunications-equipment manufacturer in the world, and overtook Apple in 2018 as the second-largest manufacturer of smartphones in the world, behind Samsung Electronics. It ranks 72nd on the \"Fortune\" Global 500 list. In December 2018, Huawei reported that its annual revenue had risen to US$108.5 billion in 2018 (a 21% increase over 2017).  Although successful internationally, Huawei has faced difficulties in some markets, due to cybersecurity allegations—primarily from the United States government—that Huawei's infrastructure equipment may enable surveillance by the Chinese government. Especially with the development of 5G wireless networks (which China has aggressively promoted),", "label_id": 135679, "label_title": "Huawei", "label_link": "https://en.wikipedia.org/wiki?curid=290909", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as Xiaomi or Huawei and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet. It is not uncommon to find binaries with Mandarin language resources or drivers signed by", "context_right": "companies, which could potentially facilitate a campaign directed against any organization. We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands.", "_context_left": "It is not uncommon to find binaries with Mandarin language resources or drivers signed by ", "_context_right": " companies, which could potentially facilitate a campaign directed against any organization.", "sentence_left": "Hiding in broad daylight is a concept associated with Eastern culture, because, even leaving aside large corporations such as Xiaomi or Huawei and the obvious possibility of controlling “their” devices, they have managed to install software of all kind on any computer on the planet.", "sentence_right": "We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Google", "context_left": "We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands. Meanwhile, it competes with", "context_right": "and Amazon for the control of the information at home. However, China is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "_context_left": "Meanwhile, it competes with ", "_context_right": " and Amazon for the control of the information at home.", "sentence_left": "We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands.", "sentence_right": "However, China is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Amazon", "context_left": "We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands. Meanwhile, it competes with Google and", "context_right": "for the control of the information at home. However, China is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "_context_left": "Meanwhile, it competes with Google and ", "_context_right": " for the control of the information at home.", "sentence_left": "We also have the issue of electronic devices, the global massive sale which has allowed the worldwide deployment of a potentially vulnerable network of video surveillance cameras, loudspeakers or smartbands.", "sentence_right": "However, China is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "label": "Amazon.com, Inc. (), is an American multinational technology company based in Seattle, Washington that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is considered one of the Big Four technology companies along with Google, Apple, and Facebook.  Amazon is known for its disruption of well-established industries through technological innovation and mass scale. It is the world's largest e-commerce marketplace, AI assistant provider, and cloud computing platform as measured by revenue and market capitalization. Amazon is the largest Internet company by revenue in the world. It is the second largest private employer in the United States and one of the world's most valuable companies. Amazon is the second largest technology company by revenue.  Amazon was founded by Jeff Bezos on July 5, 1994, in Bellevue, Washington. The company initially started as an online marketplace for books but later expanded to sell electronics, software, video games, apparel, furniture, food, toys, and jewelry. In 2015, Amazon surpassed Walmart as the most valuable retailer in the United States by market capitalization. In 2017, Amazon acquired Whole Foods Market for $13.4 billion, which vastly increased Amazon's presence as a brick-and-mortar retailer. In 2018, Bezos announced that its two-day delivery service, Amazon Prime, had surpassed 100 million subscribers worldwide.  Amazon distributes downloads and streaming of video, music, audiobook through its Amazon Prime Video, Amazon Music, and Audible subsidiaries. Amazon also has a publishing arm, Amazon Publishing, a film and television studio, Amazon Studios, and a cloud computing subsidiary, Amazon Web Services. It produces consumer electronics", "label_id": 42542, "label_title": "Amazon (company)", "label_link": "https://en.wikipedia.org/wiki?curid=90451", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "Meanwhile, it competes with Google and Amazon for the control of the information at home. However,", "context_right": "is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes. *If you use the enemy to defeat the enemy, you will be powerful wherever you go.*", "_context_left": "However, ", "_context_right": " is not interested in entering the Thucydides trap through a direct confrontation against the United States, but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "sentence_left": "Meanwhile, it competes with Google and Amazon for the control of the information at home.", "sentence_right": "*If you use the enemy to defeat the enemy, you will be powerful wherever you go.*", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "United States", "context_left": "Meanwhile, it competes with Google and Amazon for the control of the information at home. However, China is not interested in entering the Thucydides trap through a direct confrontation against the", "context_right": ", but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes. *If you use the enemy to defeat the enemy, you will be powerful wherever you go.*", "_context_left": "However, China is not interested in entering the Thucydides trap through a direct confrontation against the ", "_context_right": ", but will use, as it has done in the past, the multipolar geopolitical scenario to achieve its purposes.", "sentence_left": "Meanwhile, it competes with Google and Amazon for the control of the information at home.", "sentence_right": "*If you use the enemy to defeat the enemy, you will be powerful wherever you go.*", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Korean", "context_left": "*If you use the enemy to defeat the enemy, you will be powerful wherever you go.* About to end the", "context_right": "War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu. In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals.", "_context_left": "About to end the ", "_context_right": " War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu.", "sentence_left": "*If you use the enemy to defeat the enemy, you will be powerful wherever you go.*", "sentence_right": "In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals.", "label": "Korea is a region in East Asia. Since 1948 it has been divided between two distinct sovereign states, North Korea and South Korea. Korea consists of the Korean Peninsula, Jeju Island, and several minor islands near the peninsula. Korea is bordered by Russia to the northeast, China to the northwest, and neighbours Japan to the east via the Korea Strait and the Sea of Japan (East Sea).  During the first half of the 1st millennium, Korea was divided between the three competing states of Goguryeo, Baekje, and Silla, together known as the \"Three Kingdoms of Korea\". In the second half of the 1st millennium, Silla defeated and conquered Baekje and Goguryeo, leading to the \"Unified Silla\" period. Meanwhile, Balhae formed in the north, superseding former Goguryeo. Unified Silla eventually collapsed into three separate states due to civil war, ushering in the Later Three Kingdoms. Toward the end of the 1st millennium, Goguryeo was resurrected as Goryeo, which defeated the two other states and unified the Korean Peninsula as a single sovereign state. Around the same time, Balhae collapsed and its last crown prince fled south to Goryeo. Goryeo (also spelled as \"Koryo\"), whose name developed into the modern exonym \"Korea\", was a highly cultured state that created the world's first metal movable type in 1234. However, multiple incursions by the Mongol Empire during the 13th century greatly weakened the nation, which eventually agreed to become a vassal state after decades of fighting. Following military resistance under King Gongmin which ended Mongol political influence in", "label_id": 8089, "label_title": "Korea", "label_link": "https://en.wikipedia.org/wiki?curid=16749", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "United States", "context_left": "About to end the Korean War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu. In a world in which two great superpowers, the", "context_right": "and the Soviet Union, fought for world hegemony, he managed to see them as equals. It faced the United States in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "_context_left": "In a world in which two great superpowers, the ", "_context_right": " and the Soviet Union, fought for world hegemony, he managed to see them as equals.", "sentence_left": "About to end the Korean War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu.", "sentence_right": "It faced the United States in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Soviet Union", "context_left": "About to end the Korean War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu. In a world in which two great superpowers, the United States and the", "context_right": ", fought for world hegemony, he managed to see them as equals. It faced the United States in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "_context_left": "In a world in which two great superpowers, the United States and the ", "_context_right": ", fought for world hegemony, he managed to see them as equals.", "sentence_left": "About to end the Korean War, Mao managed to gain a foothold on the international scene through a strategy very much in the line with the classic strategist Sun Tzu.", "sentence_right": "It faced the United States in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "label": "The Soviet Union, officially the Union of Soviet Socialist Republics (USSR), was a Marxist-Leninist sovereign state in Eurasia that existed from 1922 to 1991. Nominally a union of multiple national Soviet republics, its government and economy were highly centralized. The country was a one-party state, governed by the Communist Party with Moscow as its capital in its largest republic, the Russian Soviet Federative Socialist Republic (Russian SFSR). Other major urban centres were Leningrad, Kiev, Minsk, Tashkent, Alma-Ata, and Novosibirsk. It spanned over 10,000 kilometres (6,200 mi) east to west across 11 time zones, and over 7,200 kilometres (4,500 mi) north to south. It had five climate zones: tundra, taiga, steppes, desert and mountains.  The Soviet Union had its roots in the 1917 October Revolution, when the Bolsheviks, led by Vladimir Lenin, overthrew the Russian Provisional Government which had replaced Tsar Nicholas II during World War I. In 1922, the Soviet Union was formed by a treaty which legalized the unification of the Russian, Transcaucasian, Ukrainian and Byelorussian republics that had occurred from 1918. Following Lenin's death in 1924 and a brief power struggle, Joseph Stalin came to power in the mid-1920s. Stalin committed the state's ideology to Marxism–Leninism and constructed a command economy which led to a period of rapid industrialization and collectivization. During his rule, political paranoia fermented and the Great Purge removed Stalin's opponents within and outside of the party via arbitrary arrests and persecutions of many people, resulting in at least 600,000 deaths. In 1933, a major famine struck the country, causing the", "label_id": 13233, "label_title": "Soviet Union", "label_link": "https://en.wikipedia.org/wiki?curid=26779", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "United States", "context_left": "In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals. It faced the", "context_right": "in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc. This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons.", "_context_left": "It faced the ", "_context_right": " in the Taiwan Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "sentence_left": "In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals.", "sentence_right": "This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Taiwan", "context_left": "In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals. It faced the United States in the", "context_right": "Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc. This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons.", "_context_left": "It faced the United States in the ", "_context_right": " Strait conflict and, almost at the same time, ideologically and geopolitically dissociated itself from the communist bloc.", "sentence_left": "In a world in which two great superpowers, the United States and the Soviet Union, fought for world hegemony, he managed to see them as equals.", "sentence_right": "This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons.", "label": "Taiwan, officially the Republic of China (ROC), is a state in East Asia. Neighbouring states include the People's Republic of China (PRC) to the west, Japan to the north-east, and the Philippines to the south. The island of Taiwan has an area of , with mountain ranges dominating the eastern two thirds and plains in the western third, where its highly urbanised population is concentrated. Taipei is the capital and largest metropolitan area. Other major cities include Kaohsiung, Taichung, Tainan and Taoyuan. With 23.7 million inhabitants, Taiwan is among the most densely populated states, and is the most populous state and largest economy that is not a member of the United Nations (UN).  Taiwanese indigenous peoples settled the island of Taiwan around 6,000 years ago. In the 17th century, Dutch rule opened the island to mass Han immigration. After a brief rule by the Kingdom of Tungning, the island was annexed in 1683 by the Qing dynasty of China, and ceded to the Empire of Japan in 1895. Following the surrender of Japan in 1945, the Republic of China, which had overthrown and succeeded the Qing in 1911, took control of Taiwan on behalf of the World War II Allies. The resumption of the Chinese Civil War led to the loss of the mainland to the Communist Party of China and the flight of the ROC government to Taiwan in 1949. Although the ROC government continued to claim to be the legitimate representative of China, since 1950 its effective jurisdiction has been limited to", "label_id": 12748, "label_title": "Taiwan", "label_link": "https://en.wikipedia.org/wiki?curid=25734", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons. As Mao himself stated, “", "context_right": "has 600 million inhabitants in an area of ​​9.6 million square kilometers. The United States cannot annihilate China with a simple pile of atomic bombs.", "_context_left": "As Mao himself stated, “", "_context_right": " has 600 million inhabitants in an area of ​​9.6 million square kilometers.", "sentence_left": "This position was based on the fact that none of the powers would allow the launching of nuclear weapons on Mandarin territory, and the maintenance of a public position that claimed to have no fear of such weapons.", "sentence_right": "The United States cannot annihilate China with a simple pile of atomic bombs.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "United States", "context_left": "As Mao himself stated, “China has 600 million inhabitants in an area of ​​9.6 million square kilometers. The", "context_right": "cannot annihilate China with a simple pile of atomic bombs. “ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War.", "_context_left": "The ", "_context_right": " cannot annihilate China with a simple pile of atomic bombs.", "sentence_left": "As Mao himself stated, “China has 600 million inhabitants in an area of ​​9.6 million square kilometers.", "sentence_right": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War.", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "As Mao himself stated, “China has 600 million inhabitants in an area of ​​9.6 million square kilometers. The United States cannot annihilate", "context_right": "with a simple pile of atomic bombs. “ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War.", "_context_left": "The United States cannot annihilate ", "_context_right": " with a simple pile of atomic bombs.", "sentence_left": "As Mao himself stated, “China has 600 million inhabitants in an area of ​​9.6 million square kilometers.", "sentence_right": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Taiwan", "context_left": "The United States cannot annihilate China with a simple pile of atomic bombs. “ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the", "context_right": "Strait and his intervention in the Vietnam War. The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer.", "_context_left": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the ", "_context_right": " Strait and his intervention in the Vietnam War.", "sentence_left": "The United States cannot annihilate China with a simple pile of atomic bombs.", "sentence_right": "The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer.", "label": "Taiwan, officially the Republic of China (ROC), is a state in East Asia. Neighbouring states include the People's Republic of China (PRC) to the west, Japan to the north-east, and the Philippines to the south. The island of Taiwan has an area of , with mountain ranges dominating the eastern two thirds and plains in the western third, where its highly urbanised population is concentrated. Taipei is the capital and largest metropolitan area. Other major cities include Kaohsiung, Taichung, Tainan and Taoyuan. With 23.7 million inhabitants, Taiwan is among the most densely populated states, and is the most populous state and largest economy that is not a member of the United Nations (UN).  Taiwanese indigenous peoples settled the island of Taiwan around 6,000 years ago. In the 17th century, Dutch rule opened the island to mass Han immigration. After a brief rule by the Kingdom of Tungning, the island was annexed in 1683 by the Qing dynasty of China, and ceded to the Empire of Japan in 1895. Following the surrender of Japan in 1945, the Republic of China, which had overthrown and succeeded the Qing in 1911, took control of Taiwan on behalf of the World War II Allies. The resumption of the Chinese Civil War led to the loss of the mainland to the Communist Party of China and the flight of the ROC government to Taiwan in 1949. Although the ROC government continued to claim to be the legitimate representative of China, since 1950 its effective jurisdiction has been limited to", "label_id": 12748, "label_title": "Taiwan", "label_link": "https://en.wikipedia.org/wiki?curid=25734", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Vietnam", "context_left": "The United States cannot annihilate China with a simple pile of atomic bombs. “ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the", "context_right": "War. The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer.", "_context_left": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the ", "_context_right": " War.", "sentence_left": "The United States cannot annihilate China with a simple pile of atomic bombs.", "sentence_right": "The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer.", "label": "Vietnam ( ), officially the Socialist Republic of Vietnam (), is the easternmost country on the Indochina Peninsula. With an estimated /1e6 round 1 million inhabitants , it is the 15th most populous country in the world. Vietnam shares its land borders with China to the north, and Laos and Cambodia to the west. It shares its maritime borders with Thailand through the Gulf of Thailand, and the Philippines, Indonesia and Malaysia through the South China Sea. Its capital city is Hanoi, while its most populous city is Ho Chi Minh City.  Archaeological excavations indicate that Vietnam was inhabited as early as the Paleolithic age. Ancient Vietnamese nation was annexed by China in the 2nd century BC, which subsequently made Vietnam a division of China for over a millennium. The first independent monarchy emerged in the 10th century AD, paving the way for successive imperial dynasties as the nation expanded geographically southward until the Indochina Peninsula was colonised by the French in the mid-19th century. Modern Vietnam's age was marked upon the declaration of independence from France in 1945. Following Vietnamese victory against the French in the First Indochina War, which ended in 1954, the nation was divided into two rival states: communist North and anti-communist South. Conflicts intensified in the Vietnam War, which saw extensive US intervention in support of South Vietnam and ended with North Vietnamese victory in 1975.  After North and South Vietnam were reunified under a unitary socialist government in 1976, the country became economically and politically isolated until", "label_id": 107947, "label_title": "Vietnam", "label_link": "https://en.wikipedia.org/wiki?curid=202354", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Kaspersky", "context_left": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War. The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by", "context_right": "on OlympicDestroyer. During the 2018 South Korea Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites.", "_context_left": "The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by ", "_context_right": " on OlympicDestroyer.", "sentence_left": "“ Exercising an active position, Mao ended up being part of the international balance with an independent voice, exerting psychological pressure on both sides through the conflicts in the Taiwan Strait and his intervention in the Vietnam War.", "sentence_right": "During the 2018 South Korea Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites.", "label": "Kaspersky Lab (; Russian: Лаборатория Касперского, \"Laboratoriya Kasperskogo\") is a multinational cybersecurity and anti-virus provider headquartered in Moscow, Russia and operated by a holding company in the United Kingdom. It was founded in 1997 by Eugene Kaspersky, Natalya Kaspersky, and Alexey De-Monderik; Eugene Kaspersky is currently the CEO. Kaspersky Lab develops and sells antivirus, internet security, password management, endpoint security, and other cybersecurity products and services.  Kaspersky expanded abroad from 2005–2010 and grew to $698 million in annual revenues by 2017, up 8% from 2016, though annual revenues were down 8% in North America due to U.S. government security concerns. As of 2016, the software has about 400 million users and has the largest market-share of cybersecurity software vendors in Europe. Kaspersky Lab ranks fourth in the global ranking of antivirus vendors by revenue. It was the first Russian company to be included into the rating of the world's leading software companies, called the Software Top 100 (79th on the list, as of 6/29/2012). Kaspersky Lab is ranked 4th in Endpoint Security segment according to IDC data for 2010. According to Gartner, Kaspersky Lab is currently the third largest vendor of consumer IT security software worldwide and the fifth largest vendor of Enterprise Endpoint Protection. Kaspersky Lab has been named a \"Leader\" in the Gartner Magic Quadrant for Endpoint Protection Platforms.  The Kaspersky Global Research and Analysis Team (GReAT) has led the discovery of sophisticated espionage platforms conducted by nations, such as Equation Group and the Stuxnet worm. Various covert government-sponsored cyber-espionage efforts", "label_id": 2647511, "label_title": "Kaspersky Lab", "label_link": "https://en.wikipedia.org/wiki?curid=22172878", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "South Korea", "context_left": "The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer. During the 2018", "context_right": "Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites. What is relevant about these actions is that, as detailed in the report, the tactics, techniques and procedures (TTP) were those commonly used by the Lazarous group, associated with North Korea.", "_context_left": "During the 2018 ", "_context_right": " Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites.", "sentence_left": "The current world offers very good opportunities for these puppeteer performances, as the attribution of a hostile act in cyberspace is truly complex, as evidenced by the false flag operation reported by Kaspersky on OlympicDestroyer.", "sentence_right": "What is relevant about these actions is that, as detailed in the report, the tactics, techniques and procedures (TTP) were those commonly used by the Lazarous group, associated with North Korea.", "label": "South Korea (Korean: ; RR: \"Hanguk\" or literally ; RR: \"Namhan\"; officially the Republic of Korea ; RR: \"Daehan Minguk\") is a country in East Asia, constituting the southern part of the Korean Peninsula and sharing a land border with North Korea. The name \"Korea\" is derived from Goguryeo which was one of the great powers in East Asia during its time, ruling most of the Korean Peninsula, Manchuria, parts of the Russian Far East and Inner Mongolia under Gwanggaeto the Great. Its capital, Seoul, is a major global city and half of South Korea's over 51 million people live in the Seoul Capital Area, the fourth largest metropolitan economy in the world.  The Korean Peninsula was inhabited as early as the Lower Paleolithic period. Its first kingdom was noted in Chinese records in the early 7th century BC. Following the unification of the Three Kingdoms of Korea into Silla and Balhae in the late 7th century, Korea was ruled by the Goryeo dynasty (918–1392) and the Joseon dynasty (1392–1897). The succeeding Korean Empire was annexed into the Empire of Japan in 1910. After World War II, Korea was divided into Soviet and U.S.-administered zones, with the latter becoming the Republic of Korea in August 1948. In 1950, a North Korean invasion began the Korean War and after its end in 1953, the country's economy began to soar, recording the fastest rise in average GDP per capita in the world between 1980 and 1990. Authoritarian rule ended in 1987 and the country is now", "label_id": 13374, "label_title": "South Korea", "label_link": "https://en.wikipedia.org/wiki?curid=27019", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "North Korea", "context_left": "During the 2018 South Korea Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites. What is relevant about these actions is that, as detailed in the report, the tactics, techniques and procedures (TTP) were those commonly used by the Lazarous group, associated with", "context_right": ". However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones.", "_context_left": "What is relevant about these actions is that, as detailed in the report, the tactics, techniques and procedures (TTP) were those commonly used by the Lazarous group, associated with ", "_context_right": ".", "sentence_left": "During the 2018 South Korea Winter Olympics, the OlympicDestroyer malware paralyzed IT systems, caused outages, and brought down the organization’s websites.", "sentence_right": "However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones.", "label": "North Korea (Korean: ; MR: \"Choson\" or literally ; MR: \"Pukchoson\"), officially the Democratic People's Republic of Korea (DPRK or DPR Korea; Korean: , \"Choson Minjujuui Inmin Konghwaguk\"), is a country in East Asia constituting the northern part of the Korean Peninsula, with Pyongyang the capital and the largest city in the country. To the north and northwest, the country is bordered by China and by Russia along the Amnok (known as the Yalu in Chinese) and Tumen rivers and to the south it is bordered by South Korea, with the heavily fortified Korean Demilitarized Zone (DMZ) separating the two. Nevertheless, North Korea, like its southern counterpart, claims to be the legitimate government of the entire peninsula and adjacent islands.  In 1910, Korea was annexed by Imperial Japan. After the Japanese surrender at the end of World War II in 1945, Korea was divided into two zones, with the north occupied by the Soviet Union and the south occupied by the United States. Negotiations on reunification failed, and in 1948, separate governments were formed: the socialist Democratic People's Republic of Korea in the north, and the capitalist Republic of Korea in the south. An invasion initiated by North Korea led to the Korean War (1950–1953). The Korean Armistice Agreement brought about a ceasefire, but no peace treaty was signed.  North Korea officially describes itself as a \"self-reliant\" socialist state, and formally holds elections, though said elections have been described by outside observers as sham elections. Outside observers also generally view North Korea as", "label_id": 10400, "label_title": "North Korea", "label_link": "https://en.wikipedia.org/wiki?curid=21255", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "North Korea", "context_left": "However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones. This makes more sense if we take into account that in February 2018", "context_right": "was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with China. Looking to the future, everything indicates that China will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes.", "_context_left": "This makes more sense if we take into account that in February 2018 ", "_context_right": " was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with China.", "sentence_left": "However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones.", "sentence_right": "Looking to the future, everything indicates that China will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes.", "label": "North Korea (Korean: ; MR: \"Choson\" or literally ; MR: \"Pukchoson\"), officially the Democratic People's Republic of Korea (DPRK or DPR Korea; Korean: , \"Choson Minjujuui Inmin Konghwaguk\"), is a country in East Asia constituting the northern part of the Korean Peninsula, with Pyongyang the capital and the largest city in the country. To the north and northwest, the country is bordered by China and by Russia along the Amnok (known as the Yalu in Chinese) and Tumen rivers and to the south it is bordered by South Korea, with the heavily fortified Korean Demilitarized Zone (DMZ) separating the two. Nevertheless, North Korea, like its southern counterpart, claims to be the legitimate government of the entire peninsula and adjacent islands.  In 1910, Korea was annexed by Imperial Japan. After the Japanese surrender at the end of World War II in 1945, Korea was divided into two zones, with the north occupied by the Soviet Union and the south occupied by the United States. Negotiations on reunification failed, and in 1948, separate governments were formed: the socialist Democratic People's Republic of Korea in the north, and the capitalist Republic of Korea in the south. An invasion initiated by North Korea led to the Korean War (1950–1953). The Korean Armistice Agreement brought about a ceasefire, but no peace treaty was signed.  North Korea officially describes itself as a \"self-reliant\" socialist state, and formally holds elections, though said elections have been described by outside observers as sham elections. Outside observers also generally view North Korea as", "label_id": 10400, "label_title": "North Korea", "label_link": "https://en.wikipedia.org/wiki?curid=21255", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones. This makes more sense if we take into account that in February 2018 North Korea was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with", "context_right": ". Looking to the future, everything indicates that China will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes.", "_context_left": "This makes more sense if we take into account that in February 2018 North Korea was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with ", "_context_right": ".", "sentence_left": "However, everything indicated that intentional errors had been made in order to facilitate the detection of such TTPs, stirring the international stage with a campaign with mediatic overtones.", "sentence_right": "Looking to the future, everything indicates that China will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "This makes more sense if we take into account that in February 2018 North Korea was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with China. Looking to the future, everything indicates that", "context_right": "will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes. The conflict in cyberspace allows, to a certain extent, to abandon Clausewitz’s theses and the understanding of confrontation as battles that begin and end, and where the enemies are defined and tangible units.", "_context_left": "Looking to the future, everything indicates that ", "_context_right": " will continue to bet on conflict resolution through operations in cyberspace, limiting its military interventions to what is strictly necessary or for propaganda purposes.", "sentence_left": "This makes more sense if we take into account that in February 2018 North Korea was surrounded by sanctions derived from its nuclear plan, specifically resolutions 2371, 2375 and 2397 adopted in 2017, which fundamentally damaged its relationship with China.", "sentence_right": "The conflict in cyberspace allows, to a certain extent, to abandon Clausewitz’s theses and the understanding of confrontation as battles that begin and end, and where the enemies are defined and tangible units.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "Chinese", "context_left": "The new era embraces Suntzunian theses, promoting flexibility in battle or the use of time as a weapon, concepts that are rather foreign to Western tradition. While tradition in the West has fostered heroism and the coup in the decisive moment,", "context_right": "ideals are based on patience, subtle harm and the accumulation of advantages in a gradual way, concepts that matches perfectly in a conflict in Internet. Thus, China is comfortable with the new approach to the multinational conflict, a world whose rules play in favor of concealment, indefiniteness and confusion.", "_context_left": "While tradition in the West has fostered heroism and the coup in the decisive moment, ", "_context_right": " ideals are based on patience, subtle harm and the accumulation of advantages in a gradual way, concepts that matches perfectly in a conflict in Internet.", "sentence_left": "The new era embraces Suntzunian theses, promoting flexibility in battle or the use of time as a weapon, concepts that are rather foreign to Western tradition.", "sentence_right": "Thus, China is comfortable with the new approach to the multinational conflict, a world whose rules play in favor of concealment, indefiniteness and confusion.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "While tradition in the West has fostered heroism and the coup in the decisive moment, Chinese ideals are based on patience, subtle harm and the accumulation of advantages in a gradual way, concepts that matches perfectly in a conflict in Internet. Thus,", "context_right": "is comfortable with the new approach to the multinational conflict, a world whose rules play in favor of concealment, indefiniteness and confusion. Actually, its rules.", "_context_left": "Thus, ", "_context_right": " is comfortable with the new approach to the multinational conflict, a world whose rules play in favor of concealment, indefiniteness and confusion.", "sentence_left": "While tradition in the West has fostered heroism and the coup in the decisive moment, Chinese ideals are based on patience, subtle harm and the accumulation of advantages in a gradual way, concepts that matches perfectly in a conflict in Internet.", "sentence_right": "Actually, its rules.", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}
{"mention": "China", "context_left": "<https://www.elmundo.es/internacional/2015/11/25/5654c172268e3eaa7e8b460f.html> On", "context_right": "–Henry Kissinger Principles of War for Cyberspace – Steven E. Cahanin <https://www.kaspersky.com/about/press-releases/2018_the-olympic-false-flag>", "_context_left": "On ", "_context_right": " –Henry Kissinger Principles of War for Cyberspace – Steven E. Cahanin", "sentence_left": "<https://www.elmundo.es/internacional/2015/11/25/5654c172268e3eaa7e8b460f.html>", "sentence_right": "<https://www.kaspersky.com/about/press-releases/2018_the-olympic-false-flag>", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-04-14_china-from-culture-to-conflict"}