{"mention": "Malware", "context_left": "June 09, 2020", "context_right": "that works at Ring0, generally known as rootkit, is one of the most concerning in many environments because it shares privileges and capabilities with antivirus and EDR solutions, which greatly complicates its detection as far as they can tamper and/or hide the data that allows its detection with relative ease. One of these examples is a threat Known FK\\_Undead, which among its multiple stages of infection and modules, has at least 3 different Rootkit modules.", "_context_left": "", "_context_right": " that works at Ring0, generally known as rootkit, is one of the most concerning in many environments because it shares privileges and capabilities with antivirus and EDR solutions, which greatly complicates its detection as far as they can tamper and/or hide the data that allows its detection with relative ease.", "sentence_left": "June 09, 2020", "sentence_right": "One of these examples is a threat Known FK\\_Undead, which among its multiple stages of infection and modules, has at least 3 different Rootkit modules.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}
{"mention": "dropper", "context_left": "This malware family [was detected](https://www.freebuf.com/articles/system/198869.html) for the first time in November 2018 and has remained active and in continuous evolution. Regarding it’s infecction chain, from what has been observed to date, the first element with which it infects a system is a", "context_right": "that renames itself as “ntprint.exe” and copies itself to the %TEMP% folder. It check’s the victim’s location by contacting to “http://pv.sohu.]com/cityjson” after which downloads an executable protected with VMProtect that is stored in the %programdata% folder with a random name and executes it.", "_context_left": "Regarding it’s infecction chain, from what has been observed to date, the first element with which it infects a system is a ", "_context_right": " that renames itself as “ntprint.exe” and copies itself to the %TEMP% folder.", "sentence_left": "This malware family [was detected](https://www.freebuf.com/articles/system/198869.html) for the first time in November 2018 and has remained active and in continuous evolution.", "sentence_right": "It check’s the victim’s location by contacting to “http://pv.sohu.]com/cityjson” after which downloads an executable protected with VMProtect that is stored in the %programdata% folder with a random name and executes it.", "label": "A dropper is a kind of Trojan that has been designed to \"install\" some sort of malware (virus, backdoor, etc.) to a target system. The malware code can be contained within the dropper (single-stage) in such a way as to avoid detection by virus scanners or the dropper may download the malware to the target machine once activated (two stage).", "label_id": 362086, "label_title": "Dropper (malware)", "label_link": "https://en.wikipedia.org/wiki?curid=1149440", "entity_class": "CE", "entity_type": "CON", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}
{"mention": "CHENGDU YIWO Tech Development Co., Ltd", "context_left": "| Yuchengxian Feiwu service Co.,ltd | |", "context_right": ". | | Chengdu Xiongdichuang Trading Co., Ltd. |", "_context_left": "| ", "_context_right": ". |", "sentence_left": "| Yuchengxian Feiwu service Co.,ltd |", "sentence_right": "| Chengdu Xiongdichuang Trading Co., Ltd. |", "label": "EaseUS Data Recovery Wizard is a data recovery program that utilizes a Wizard (software) user interface to guide users through the data recovery process. There are free and paid versions of the software on both Windows and macOS.", "label_id": 5700318, "label_title": "EaseUS Data Recovery Wizard", "label_link": "https://en.wikipedia.org/wiki?curid=58506548", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}
{"mention": "China", "context_left": "It should be noted that these are the modules currently known, but they probably have more modules from which no information has been obtained to date as this threat has been active for over a year and has a lot of new activity. The majority of the downloads related to this malware are done over HTTP directly against IP addresses generally located in", "context_right": "and using relatively high ports. Some of the names of the threats at the time of download are as follows:", "_context_left": "The majority of the downloads related to this malware are done over HTTP directly against IP addresses generally located in ", "_context_right": " and using relatively high ports.", "sentence_left": "It should be noted that these are the modules currently known, but they probably have more modules from which no information has been obtained to date as this threat has been active for over a year and has a lot of new activity.", "sentence_right": "Some of the names of the threats at the time of download are as follows:", "label": "China (; lit. \"Middle Kingdom\"), officially the People's Republic of China (PRC), is a country in East Asia and the world's most populous country, with a population of around /1e9 round 3 billion. Covering approximately , it is the fourth largest country by total area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau.  China emerged as one of the world's earliest civilizations, in the fertile basin of the Yellow River in the North China Plain. For millennia, China's political system was based on hereditary monarchies, or dynasties, beginning with the semi-legendary Xia dynasty in 21st century BCE. Since then, China has expanded, fractured, and re-unified numerous times. In the 3rd century BCE, the Qin reunited core China and established the first Chinese empire. The succeeding Han dynasty, which ruled from 206 BC until 220 AD, saw some of the most advanced technology at that time, including papermaking and the compass, along with agricultural and medical improvements. The invention of gunpowder and movable type in the Tang dynasty (618–907) and Northern Song (960–1127) completed the Four Great Inventions. Tang culture spread widely in Asia, as the new Silk Route brought traders to as far as Mesopotamia and the Horn of Africa. Dynastic rule ended in 1912 with the Xinhai Revolution, when the republic replaced the Qing dynasty. China as a whole was ravaged by Japan during World War II,", "label_id": 2397, "label_title": "China", "label_link": "https://en.wikipedia.org/wiki?curid=5405", "entity_class": "NE", "entity_type": "LOC", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}
{"mention": "lab52", "context_left": "All the drivers developed by this group to date use the same “PoolTags” for allocating memory in the kernel space “fktg” and “fkhs”. ![](https://", "context_right": ".io/blog/wp-content/uploads/2020/06/iamge.png) During a forensic analysis, this data can be very interesting to take into account as IOC, because some tools like Volatility allow scanning the memory for these memory pools.", "_context_left": "![](https://", "_context_right": ".io/blog/wp-content/uploads/2020/06/iamge.png)", "sentence_left": "All the drivers developed by this group to date use the same “PoolTags” for allocating memory in the kernel space “fktg” and “fkhs”.", "sentence_right": "During a forensic analysis, this data can be very interesting to take into account as IOC, because some tools like Volatility allow scanning the memory for these memory pools.", "label": "A company, abbreviated as co., is a legal entity made up of an association of people, be they natural, legal, or a mixture of both, for carrying on a commercial or industrial enterprise. Company members share a common purpose, and unite to focus their various talents and organize their collectively available skills or resources to achieve specific, declared goals. Companies take various forms, such as:   A company or association of persons can be created at law as a legal person so that the company in itself can accept limited liability for civil responsibility and taxation incurred as members perform (or fail to discharge) their duty within the publicly declared \"\"birth certificate\"\" or published policy.  Companies as legal persons may associate and register themselves collectively as other companies – often known as a corporate group. When a company closes, it may need a \"\"death certificate\"\" to avoid further legal obligations.", "label_id": 986634, "label_title": "Company", "label_link": "https://en.wikipedia.org/wiki?curid=4918223", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}
{"mention": "lab52", "context_left": "During a forensic analysis, this data can be very interesting to take into account as IOC, because some tools like Volatility allow scanning the memory for these memory pools. ![](https://", "context_right": ".io/blog/wp-content/uploads/2020/06/Captura-de-pantalla-de-2020-06-09-09-17-34.png) Specifically, the volatility plugin in charge of doing this is “poolpeek” and requires as a parameter this PoolTag but reversed, since in memory, it is stored this way:", "_context_left": "![](https://", "_context_right": ".io/blog/wp-content/uploads/2020/06/Captura-de-pantalla-de-2020-06-09-09-17-34.png)", "sentence_left": "During a forensic analysis, this data can be very interesting to take into account as IOC, because some tools like Volatility allow scanning the memory for these memory pools.", "sentence_right": "Specifically, the volatility plugin in charge of doing this is “poolpeek” and requires as a parameter this PoolTag but reversed, since in memory, it is stored this way:", "label": "A company, abbreviated as co., is a legal entity made up of an association of people, be they natural, legal, or a mixture of both, for carrying on a commercial or industrial enterprise. Company members share a common purpose, and unite to focus their various talents and organize their collectively available skills or resources to achieve specific, declared goals. Companies take various forms, such as:   A company or association of persons can be created at law as a legal person so that the company in itself can accept limited liability for civil responsibility and taxation incurred as members perform (or fail to discharge) their duty within the publicly declared \"\"birth certificate\"\" or published policy.  Companies as legal persons may associate and register themselves collectively as other companies – often known as a corporate group. When a company closes, it may need a \"\"death certificate\"\" to avoid further legal obligations.", "label_id": 986634, "label_title": "Company", "label_link": "https://en.wikipedia.org/wiki?curid=4918223", "entity_class": "NE", "entity_type": "ORG", "document": "lab52_2020-06-09_recent-fk-undead-rootkit-samples"}