{"mention": "CISA", "context_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry.", "context_right": ", the FBI and HHS have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.” 1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "_context_left": "", "_context_right": ", the FBI and HHS have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.”", "sentence_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry.", "sentence_right": "1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "label": "The Cybersecurity and Infrastructure Security Agency (CISA) was established on 16 November 2018 when President Donald Trump signed into law the Cybersecurity and Infrastructure Security Agency Act of 2018. CISA is a standalone United States federal agency, an operational component under Department of Homeland Security (DHS) oversight. Its activities are a continuation of the National Protection and Programs Directorate (NPPD).  CISA subcomponents include the:   Former NPPD Under Secretary Christopher Krebs is CISA's first Director, and former Deputy Under Secretary Matthew Travis is its first Deputy Director. The expected role of CISA is to improve cybersecurity across all levels of government, coordinate cybersecurity programs with states, and improve the government's cybersecurity protections against private and nation-state hackers.  On January 22, 2019, CISA issued its first-ever Emergency Directive (Mitigate DNS Infrastructure Tampering; 19-01) warning that \"an active attacker is targeting government organizations\" using DNS spoofing techniques to perform man-in-the-middle attacks. Research group FireEye stated that \"initial research suggests the actor or actors responsible have a nexus to Iran.\"", "label_id": 5755404, "label_title": "Cybersecurity and Infrastructure Security Agency", "label_link": "https://en.wikipedia.org/wiki?curid=59407369", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "FBI", "context_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry. CISA, the", "context_right": "and HHS have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.” 1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "_context_left": "CISA, the ", "_context_right": " and HHS have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.”", "sentence_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry.", "sentence_right": "1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "label": "The Federal Bureau of Investigation (FBI) is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. Operating under the jurisdiction of the United States Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.  Although many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in smaller cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.  Despite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in U.S. embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. The FBI can and does at times carry out secret activities overseas, just as the CIA has a limited", "label_id": 5289, "label_title": "Federal Bureau of Investigation", "label_link": "https://en.wikipedia.org/wiki?curid=11127", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "HHS", "context_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry. CISA, the FBI and", "context_right": "have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.” 1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "_context_left": "CISA, the FBI and ", "_context_right": " have warned against of “an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.”", "sentence_left": "In recent weeks there has been an increase of reported Ryuk ransomware attacks across the healthcare industry.", "sentence_right": "1 While ransomware actors have leveraged a number of different initial compromise vectors, the primary concern for the wave of recent activity is email threats.", "label": "The United States Department of Health & Human Services (HHS), also known as the Health Department, is a cabinet-level department of the U.S. federal government with the goal of protecting the health of all Americans and providing essential human services. Its motto is \"Improving the health, safety, and well-being of America\". Before the separate federal Department of Education was created in 1979, it was called the Department of Health, Education, and Welfare (HEW).  HHS is administered by the Secretary of Health and Human Services, who is appointed by the President with the advice and consent of the Senate. The United States Public Health Service (PHS) is the main division of the HHS and is led by the Assistant Secretary for Health. The current Secretary, Alex Azar, assumed office on January 29, 2018, upon his appointment by President Trump and confirmation by the Senate.  The United States Public Health Service Commissioned Corps, the uniformed service of the PHS, is led by the Surgeon General who is responsible for addressing matters concerning public health as authorized by the Secretary or by the Assistant Secretary of Health in addition to his or her primary mission of administering the Commissioned Corps.", "label_id": 29294, "label_title": "United States Department of Health and Human Services", "label_link": "https://en.wikipedia.org/wiki?curid=58250", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Proofpoint", "context_left": "In this example, the final payload is Ryuk ransomware (although other variants have been seen, including Conti ransomware) with Cobalt Strike and other tools often being used to escalate privileges within the network as an intermediate step.", "context_right": "has seen a spike in the last month from Emotet, BazaLoader and The Trick campaigns across all our Healthcare customers, with campaigns sending tens of thousands of daily malicious messages. ![screenshot2](/sites/default/files/inline-images/Blog2.png)", "_context_left": "", "_context_right": " has seen a spike in the last month from Emotet, BazaLoader and The Trick campaigns across all our Healthcare customers, with campaigns sending tens of thousands of daily malicious messages.", "sentence_left": "In this example, the final payload is Ryuk ransomware (although other variants have been seen, including Conti ransomware) with Cobalt Strike and other tools often being used to escalate privileges within the network as an intermediate step.", "sentence_right": "![screenshot2](/sites/default/files/inline-images/Blog2.png)", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Google", "context_left": "![4](/sites/default/files/inline-images/Blog4.png) By contrast, BazaLoader campaigns have used messages that contain links to a landing page hosted on", "context_right": "Docs or PDFs hosted on Constant Contact. The landing page or PDF contains a link to the download of BazaLoader, typically hosted on a compromised website.", "_context_left": "By contrast, BazaLoader campaigns have used messages that contain links to a landing page hosted on ", "_context_right": " Docs or PDFs hosted on Constant Contact.", "sentence_left": "![4](/sites/default/files/inline-images/Blog4.png)", "sentence_right": "The landing page or PDF contains a link to the download of BazaLoader, typically hosted on a compromised website.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Proofpoint", "context_left": "**Protection and Visibility into these Threats**", "context_right": "has been protecting customers against email-delivered threats for years. Customers running Proofpoint’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk).", "_context_left": "", "_context_right": " has been protecting customers against email-delivered threats for years.", "sentence_left": "**Protection and Visibility into these Threats**", "sentence_right": "Customers running Proofpoint’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk).", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Proofpoint", "context_left": "Proofpoint has been protecting customers against email-delivered threats for years. Customers running", "context_right": "’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk). While detection and blocking of these threats by TAP has been excellent, as a best practice, Proofpoint recommends careful inspection and remediation of delivered messages that associated with Emotet, BazaLoader and The Trick/Trickbot.", "_context_left": "Customers running ", "_context_right": "’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk).", "sentence_left": "Proofpoint has been protecting customers against email-delivered threats for years.", "sentence_right": "While detection and blocking of these threats by TAP has been excellent, as a best practice, Proofpoint recommends careful inspection and remediation of delivered messages that associated with Emotet, BazaLoader and The Trick/Trickbot.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Proofpoint", "context_left": "Customers running Proofpoint’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk). While detection and blocking of these threats by TAP has been excellent, as a best practice,", "context_right": "recommends careful inspection and remediation of delivered messages that associated with Emotet, BazaLoader and The Trick/Trickbot. Below is a simple three-step process to help you gain visibility into these first stage downloader malware targeting people in your organization:", "_context_left": "While detection and blocking of these threats by TAP has been excellent, as a best practice, ", "_context_right": " recommends careful inspection and remediation of delivered messages that associated with Emotet, BazaLoader and The Trick/Trickbot.", "sentence_left": "Customers running Proofpoint’s [Targeted Attack Protection (TAP)](https://www.proofpoint.com/us/products/advanced-threat-protection/targeted-attack-protection) not only blocks single-stage threats (I.e. macros, executables, URLs) but also multi-stage threats (i.e. downloader / droppers like BazaLoader, Emotet and The Trick, which can pull in secondary/tertiary payloads like Ryuk).", "sentence_right": "Below is a simple three-step process to help you gain visibility into these first stage downloader malware targeting people in your organization:", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Microsoft", "context_left": "In this campaign, you can see that almost 150 messages targeting the organization were blocked. The threat actor used a URL that led to a malicious", "context_right": "Word Doc for the targets to open and run. The target geography for this campaign was spread across several countries.", "_context_left": "The threat actor used a URL that led to a malicious ", "_context_right": " Word Doc for the targets to open and run.", "sentence_left": "In this campaign, you can see that almost 150 messages targeting the organization were blocked.", "sentence_right": "The target geography for this campaign was spread across several countries.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}
{"mention": "Proofpoint", "context_left": "We also recommended providing [Security Awareness Training](https://www.proofpoint.com/us/products/security-awareness-training) regarding ransomware and the aforementioned tactics of these actors to help end users recognize these threats.", "context_right": "threat researchers continue to closely track these actors and campaigns, and publish frequent updates via the TAP dashboard, TAP APIs, and our Threat Insight blog/social media feeds. Sources - 1:  <https://us-cert.cisa.gov/ncas/alerts/aa20-302a>", "_context_left": "", "_context_right": " threat researchers continue to closely track these actors and campaigns, and publish frequent updates via the TAP dashboard, TAP APIs, and our Threat Insight blog/social media feeds.", "sentence_left": "We also recommended providing [Security Awareness Training](https://www.proofpoint.com/us/products/security-awareness-training) regarding ransomware and the aforementioned tactics of these actors to help end users recognize these threats.", "sentence_right": "Sources - 1:  <https://us-cert.cisa.gov/ncas/alerts/aa20-302a>", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2020-11-02_providing-healthcare-organizations-visibility-latest"}