{"mention": "Proofpoint", "context_left": "### Key Findings *", "context_right": "researchers have tracked a persistent cybercrime threat actor targeting aviation, aerospace, transportation, manufacturing, and defense industries for years. * The threat actor consistently uses remote access trojans (RATs) that can be used to remotely control compromised machines.", "_context_left": "* ", "_context_right": " researchers have tracked a persistent cybercrime threat actor targeting aviation, aerospace, transportation, manufacturing, and defense industries for years.", "sentence_left": "### Key Findings", "sentence_right": "* The threat actor consistently uses remote access trojans (RATs) that can be used to remotely control compromised machines.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "The threat actor has used similar themes and targeting since 2017. *", "context_right": "calls this actor TA2541. ### Overview", "_context_left": "* ", "_context_right": " calls this actor TA2541.", "sentence_left": "The threat actor has used similar themes and targeting since 2017.", "sentence_right": "### Overview", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "TA2541 is a persistent cybercriminal actor that distributes various remote access trojans (RATs) targeting the aviation, aerospace, transportation, and defense industries, among others.", "context_right": "has tracked this threat actor since 2017, and it has used consistent tactics, techniques, and procedures (TTPs) in that time. Entities in the targeted sectors should be aware of the actor's TTPs and use the information provided for hunting and detection.", "_context_left": "", "_context_right": " has tracked this threat actor since 2017, and it has used consistent tactics, techniques, and procedures (TTPs) in that time.", "sentence_left": "TA2541 is a persistent cybercriminal actor that distributes various remote access trojans (RATs) targeting the aviation, aerospace, transportation, and defense industries, among others.", "sentence_right": "Entities in the targeted sectors should be aware of the actor's TTPs and use the information provided for hunting and detection.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "TA2541 uses themes related to aviation, transportation, and travel. When", "context_right": "first started tracking this actor, the group sent macro-laden Microsoft Word attachments that downloaded the RAT payload. The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "_context_left": "When ", "_context_right": " first started tracking this actor, the group sent macro-laden Microsoft Word attachments that downloaded the RAT payload.", "sentence_left": "TA2541 uses themes related to aviation, transportation, and travel.", "sentence_right": "The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Microsoft", "context_left": "TA2541 uses themes related to aviation, transportation, and travel. When Proofpoint first started tracking this actor, the group sent macro-laden", "context_right": "Word attachments that downloaded the RAT payload. The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "_context_left": "When Proofpoint first started tracking this actor, the group sent macro-laden ", "_context_right": " Word attachments that downloaded the RAT payload.", "sentence_left": "TA2541 uses themes related to aviation, transportation, and travel.", "sentence_right": "The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Google", "context_left": "When Proofpoint first started tracking this actor, the group sent macro-laden Microsoft Word attachments that downloaded the RAT payload. The group pivoted, and now they more frequently send messages with links to cloud services such as", "context_right": "Drive hosting the payload. Proofpoint assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure.", "_context_left": "The group pivoted, and now they more frequently send messages with links to cloud services such as ", "_context_right": " Drive hosting the payload.", "sentence_left": "When Proofpoint first started tracking this actor, the group sent macro-laden Microsoft Word attachments that downloaded the RAT payload.", "sentence_right": "Proofpoint assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "context_right": "assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure. While public reporting detailing similar threat activities exists since at least 2019, this is the first time Proofpoint is sharing comprehensive details linking public and private data under one threat activity cluster we call TA2541.", "_context_left": "", "_context_right": " assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure.", "sentence_left": "The group pivoted, and now they more frequently send messages with links to cloud services such as Google Drive hosting the payload.", "sentence_right": "While public reporting detailing similar threat activities exists since at least 2019, this is the first time Proofpoint is sharing comprehensive details linking public and private data under one threat activity cluster we call TA2541.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "Proofpoint assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure. While public reporting detailing similar threat activities exists since at least 2019, this is the first time", "context_right": "is sharing comprehensive details linking public and private data under one threat activity cluster we call TA2541. ### Campaign Details", "_context_left": "While public reporting detailing similar threat activities exists since at least 2019, this is the first time ", "_context_right": " is sharing comprehensive details linking public and private data under one threat activity cluster we call TA2541.", "sentence_left": "Proofpoint assesses TA2541 is a cybercriminal threat actor due to its use of specific commodity malware, broad targeting with high volume messages, and command and control infrastructure.", "sentence_right": "### Campaign Details", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "North America", "context_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time. Campaigns impact hundreds of organizations globally, with recurring targets in", "context_right": ", Europe, and the Middle East. Messages are nearly always in English.", "_context_left": "Campaigns impact hundreds of organizations globally, with recurring targets in ", "_context_right": ", Europe, and the Middle East.", "sentence_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time.", "sentence_right": "Messages are nearly always in English.", "label": "North America is a continent entirely within the Northern Hemisphere and almost all within the Western Hemisphere. It is also considered by some to be a northern subcontinent of the Americas. It is bordered to the north by the Arctic Ocean, to the east by the Atlantic Ocean, to the west and south by the Pacific Ocean, and to the southeast by South America and the Caribbean Sea.  North America covers an area of about 24,709,000 square kilometers (9,540,000 square miles), about 16.5% of the earth's land area and about 4.8% of its total surface. North America is the third largest continent by area, following Asia and Africa, and the fourth by population after Asia, Africa, and Europe. In 2013, its population was estimated at nearly 579 million people in 23 independent states, or about 7.5% of the world's population, if nearby islands (most notably the Caribbean) are included.  North America was reached by its first human populations during the last glacial period, via crossing the Bering land bridge approximately 40,000 to 17,000 years ago. The so-called Paleo-Indian period is taken to have lasted until about 10,000 years ago (the beginning of the Archaic or Meso-Indian period). The Classic stage spans roughly the 6th to 13th centuries. The Pre-Columbian era ended in 1492, with the beginning of the transatlantic migrations—the arrival of European settlers during the Age of Discovery and the Early Modern period. Present-day cultural and ethnic patterns reflect interactions between European colonists, indigenous peoples, African slaves and their descendants.  Owing", "label_id": 10343, "label_title": "North America", "label_link": "https://en.wikipedia.org/wiki?curid=21139", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Europe", "context_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time. Campaigns impact hundreds of organizations globally, with recurring targets in North America,", "context_right": ", and the Middle East. Messages are nearly always in English.", "_context_left": "Campaigns impact hundreds of organizations globally, with recurring targets in North America, ", "_context_right": ", and the Middle East.", "sentence_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time.", "sentence_right": "Messages are nearly always in English.", "label": "Europe is a continent located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is bordered by the Arctic Ocean to the north, the Atlantic Ocean to the west, Asia to the east, and the Mediterranean Sea to the south. It comprises the westernmost part of Eurasia.  Since around 1850, Europe is most commonly considered to be separated from Asia by the watershed divides of the Ural and Caucasus Mountains, the Ural River, the Caspian and Black Seas and the waterways of the Turkish Straits. Although the term \"continent\" implies physical geography, the land border is somewhat arbitrary and has been redefined several times since its first conception in classical antiquity. The division of Eurasia into two continents reflects East-West cultural, linguistic and ethnic differences which vary on a spectrum rather than with a sharp dividing line. The geographic border between Europe and Asia does not follow any state boundaries: Turkey, Russia, Azerbaijan, Georgia and Kazakhstan are transcontinental countries. Spain is also transcontinental in that its main portion is on the Iberian peninsula (Europe) while pockets of Spanish territory are located across the Strait of Gibraltar on North African territory (i.e. mainly Melilla, Ceuta, and the Canary Islands in the Atlantic Ocean).  Europe covers about , or 2% of the Earth's surface (6.8% of land area). Politically, Europe is divided into about fifty sovereign states of which the Russian Federation is the largest and most populous, spanning 39% of the continent and comprising 15% of its population. Europe had a", "label_id": 4280, "label_title": "Europe", "label_link": "https://en.wikipedia.org/wiki?curid=9239", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Middle East", "context_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time. Campaigns impact hundreds of organizations globally, with recurring targets in North America, Europe, and the", "context_right": ". Messages are nearly always in English.", "_context_left": "Campaigns impact hundreds of organizations globally, with recurring targets in North America, Europe, and the ", "_context_right": ".", "sentence_left": "Typically, its malware campaigns include hundreds to thousands of messages, although it is rare to see TA2541 send more than 10,000 messages at one time.", "sentence_right": "Messages are nearly always in English.", "label": "The Middle East is a transcontinental region centered on Western Asia, Turkey (both Asian and European), and Egypt (which is mostly in North Africa). Saudi Arabia is geographically the largest Middle Eastern nation while Bahrain is the smallest. The corresponding adjective is \"Middle Eastern\" and the derived noun is \"Middle Easterner\". The term has come into wider usage as a replacement of the term Near East (as opposed to the Far East) beginning in the early 20th century.  Arabs, Turks, Persians, Kurds, and Azeris (excluding Azerbaijan) constitute the largest ethnic groups in the region by population. Arabs constitute the largest ethnic group in the region by a clear margin. Indigenous minorities of the Middle East include Jews, Baloch, Assyrians, Berbers (who primarily live in North Africa), Copts, Druze, Lurs, Mandaeans, Samaritans, Shabaks, Tats, and Zazas. European ethnic groups that form a diaspora in the region include Albanians, Bosniaks, Circassians (including Kabardians), Crimean Tatars, Greeks, Franco-Levantines, and Italo-Levantines. Among other migrant populations are Chinese, Filipinos, Indians, Indonesians, Pakistanis, Pashtuns, Romani, and sub-Saharan Africans.  The history of the Middle East dates back to ancient times, with the (geopolitical) importance of the region being recognized for millennia. Several major religions have their origins in the Middle East, including Judaism, Christianity, and Islam; the Baha'i faith, Mandaeism, Unitarian Druze, and numerous other belief systems were also established within the region.  The Middle East generally has a hot, arid climate, with several major rivers providing irrigation to support agriculture in limited areas such as the Nile Delta", "label_id": 9453, "label_title": "Middle East", "label_link": "https://en.wikipedia.org/wiki?curid=19323", "entity_class": "NE", "entity_type": "LOC", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Microsoft", "context_left": "[Morphisec](https://blog.morphisec.com/revealing-the-snip3-crypter-a-highly-evasive-rat-loader), [", "context_right": "](https://twitter.com/MsftSecIntel/status/1392219299696152578),  [Mandiant](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html).", "_context_left": "[", "_context_right": "](https://twitter.com/MsftSecIntel/status/1392219299696152578), ", "sentence_left": "[Morphisec](https://blog.morphisec.com/revealing-the-snip3-crypter-a-highly-evasive-rat-loader),", "sentence_right": "[Mandiant](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html).", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Mandiant", "context_left": "[Microsoft](https://twitter.com/MsftSecIntel/status/1392219299696152578), [", "context_right": "](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html). Proofpoint can confirm the activities in these reports overlap with the threat actor tracked as TA2541.", "_context_left": "[", "_context_right": "](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html).", "sentence_left": "[Microsoft](https://twitter.com/MsftSecIntel/status/1392219299696152578),", "sentence_right": "Proofpoint can confirm the activities in these reports overlap with the threat actor tracked as TA2541.", "label": "Mandiant is an American cybersecurity firm. It rose to prominence in February 2013 when it released a report directly implicating China in cyber espionage. On December 30, 2013, Mandiant was acquired by FireEye in a stock and cash deal worth in excess of $1 billion.", "label_id": 4096704, "label_title": "Mandiant", "label_link": "https://en.wikipedia.org/wiki?curid=38573495", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "[Mandiant](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html).", "context_right": "can confirm the activities in these reports overlap with the threat actor tracked as TA2541. ### Delivery and Installation", "_context_left": "", "_context_right": " can confirm the activities in these reports overlap with the threat actor tracked as TA2541.", "sentence_left": "[Mandiant](https://www.mandiant.com/resources/dissecting-netwire-phishing-campaigns-usage-process-hollowing), and independent [researchers](https://blog.bushidotoken.net/2021/01/analysis-of-netwire-rat-campaign.html).", "sentence_right": "### Delivery and Installation", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "### Delivery and Installation In recent campaigns,", "context_right": "observed this group using Google Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file. If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and GitHub.", "_context_left": "In recent campaigns, ", "_context_right": " observed this group using Google Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file.", "sentence_left": "### Delivery and Installation", "sentence_right": "If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and GitHub.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Google", "context_left": "### Delivery and Installation In recent campaigns, Proofpoint observed this group using", "context_right": "Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file. If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and GitHub.", "_context_left": "In recent campaigns, Proofpoint observed this group using ", "_context_right": " Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file.", "sentence_left": "### Delivery and Installation", "sentence_right": "If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and GitHub.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "GitHub", "context_left": "In recent campaigns, Proofpoint observed this group using Google Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file. If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and", "context_right": ". The threat actor executes PowerShell into various Windows processes and queries Windows Management Instrumentation (WMI) for security products such as antivirus and firewall software, and attempts to disable built-in security protections.", "_context_left": "If executed, PowerShell pulls an executable from a text file hosted on various platforms such as Pastetext, Sharetext, and ", "_context_right": ".", "sentence_left": "In recent campaigns, Proofpoint observed this group using Google Drive URLs in emails that lead to an obfuscated Visual Basic Script (VBS) file.", "sentence_right": "The threat actor executes PowerShell into various Windows processes and queries Windows Management Instrumentation (WMI) for security products such as antivirus and firewall software, and attempts to disable built-in security protections.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Google", "context_left": "*Figure 4: Example attack chain.* While TA2541 consistently uses", "context_right": "Drive, and occasionally OneDrive, to host the malicious VBS files, beginning in late 2021, Proofpoint observed this group begin using DiscordApp URLs linking to a compressed file which led to either AgentTesla or Imminent Monitor. Discord is an increasingly popular content delivery network (CDN) used by threat actors.", "_context_left": "While TA2541 consistently uses ", "_context_right": " Drive, and occasionally OneDrive, to host the malicious VBS files, beginning in late 2021, Proofpoint observed this group begin using DiscordApp URLs linking to a compressed file which led to either AgentTesla or Imminent Monitor.", "sentence_left": "*Figure 4: Example attack chain.*", "sentence_right": "Discord is an increasingly popular content delivery network (CDN) used by threat actors.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "*Figure 4: Example attack chain.* While TA2541 consistently uses Google Drive, and occasionally OneDrive, to host the malicious VBS files, beginning in late 2021,", "context_right": "observed this group begin using DiscordApp URLs linking to a compressed file which led to either AgentTesla or Imminent Monitor. Discord is an increasingly popular content delivery network (CDN) used by threat actors.", "_context_left": "While TA2541 consistently uses Google Drive, and occasionally OneDrive, to host the malicious VBS files, beginning in late 2021, ", "_context_right": " observed this group begin using DiscordApp URLs linking to a compressed file which led to either AgentTesla or Imminent Monitor.", "sentence_left": "*Figure 4: Example attack chain.*", "sentence_right": "Discord is an increasingly popular content delivery network (CDN) used by threat actors.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "Discord is an increasingly popular content delivery network (CDN) used by threat actors. Although TA2541 typically uses URLs as part of the delivery,", "context_right": "has also observed this actor leverage attachments in emails. For example, the threat actor may send compressed executables such as RAR attachments with an embedded executable containing URL to CDNs hosting the malware payload.", "_context_left": "Although TA2541 typically uses URLs as part of the delivery, ", "_context_right": " has also observed this actor leverage attachments in emails.", "sentence_left": "Discord is an increasingly popular content delivery network (CDN) used by threat actors.", "sentence_right": "For example, the threat actor may send compressed executables such as RAR attachments with an embedded executable containing URL to CDNs hosting the malware payload.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "### Malware", "context_right": "has observed TA2541 using over a dozen different malware payloads since 2017. The threat actor uses commodity malware available for purchase on criminal forums or available in open-source repositories.", "_context_left": "", "_context_right": " has observed TA2541 using over a dozen different malware payloads since 2017.", "sentence_left": "### Malware", "sentence_right": "The threat actor uses commodity malware available for purchase on criminal forums or available in open-source repositories.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "All the malware used by TA2541 can be used for information gathering purposes and to gain remote control of an infected machine. At this time,", "context_right": "does not know what the threat actor’s ultimate goals and objectives are once it achieves initial compromise. While AsyncRAT is the current malware of choice, TA2541 has varied its malware use each year since 2017.", "_context_left": "At this time, ", "_context_right": " does not know what the threat actor’s ultimate goals and objectives are once it achieves initial compromise.", "sentence_left": "All the malware used by TA2541 can be used for information gathering purposes and to gain remote control of an infected machine.", "sentence_right": "While AsyncRAT is the current malware of choice, TA2541 has varied its malware use each year since 2017.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "The threat actor will typically use just one or a handful of RATs in observed campaigns, however in 2020,", "context_right": "observed TA2541 distributing over 10 different types of malware, all using the same initial infection chain. ![Distribution of TA2541 malware ](/sites/default/files/inline-images/Screen%20Shot%202022-02-09%20at%209.19.03%20AM.png)", "_context_left": "", "_context_right": " observed TA2541 distributing over 10 different types of malware, all using the same initial infection chain.", "sentence_left": "The threat actor will typically use just one or a handful of RATs in observed campaigns, however in 2020,", "sentence_right": "![Distribution of TA2541 malware ](/sites/default/files/inline-images/Screen%20Shot%202022-02-09%20at%209.19.03%20AM.png)", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "Often, campaigns contained several hundred to several thousand email messages to dozens of different organizations. Although", "context_right": "has observed TA2541 targeting thousands of organizations, multiple entities across aviation, aerospace, transportation, manufacturing, and defense industries appear regularly as targets of its campaigns. There appears to be a wide distribution across recipients, indicating TA2541 does not target people with specific roles and functions.", "_context_left": "Although ", "_context_right": " has observed TA2541 targeting thousands of organizations, multiple entities across aviation, aerospace, transportation, manufacturing, and defense industries appear regularly as targets of its campaigns.", "sentence_left": "Often, campaigns contained several hundred to several thousand email messages to dozens of different organizations.", "sentence_right": "There appears to be a wide distribution across recipients, indicating TA2541 does not target people with specific roles and functions.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}
{"mention": "Proofpoint", "context_left": "TA2541 remains a consistent, active cybercrime threat, especially to entities in its most frequently targeted sectors.", "context_right": "assesses with high confidence this threat actor will continue using the same TTPs observed in historic activity with minimal change to its lure themes, delivery, and installation. It is likely TA2541 will continue using AsyncRAT and vjw0rm in future campaigns and will likely use other commodity malware to support its objectives.", "_context_left": "", "_context_right": " assesses with high confidence this threat actor will continue using the same TTPs observed in historic activity with minimal change to its lure themes, delivery, and installation.", "sentence_left": "TA2541 remains a consistent, active cybercrime threat, especially to entities in its most frequently targeted sectors.", "sentence_right": "It is likely TA2541 will continue using AsyncRAT and vjw0rm in future campaigns and will likely use other commodity malware to support its objectives.", "label": "Proofpoint is an enterprise security company based in Sunnyvale, California that provides software as a service and products for inbound email security, outbound data loss prevention, social media, mobile devices, digital risk, email encryption, electronic discovery (\"eDiscovery”), and email archiving. It claims over half of the Fortune 100 as users of its solutions.", "label_id": 2228289, "label_title": "Proofpoint, Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=17815480", "entity_class": "NE", "entity_type": "ORG", "document": "proofpoint_2022-02-15_charting-ta2541s-flight"}