{"mention": "Chile", "context_left": "New Evidence Might Link Lazarus Tool Found in", "context_right": "RedBanc Intrusion to Previous Attacks in Pakistan Jan 21, 2019", "_context_left": "New Evidence Might Link Lazarus Tool Found in ", "_context_right": " RedBanc Intrusion to Previous Attacks in Pakistan", "sentence_left": "", "sentence_right": "Jan 21, 2019", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "New Evidence Might Link Lazarus Tool Found in Chile", "context_right": "Intrusion to Previous Attacks in Pakistan Jan 21, 2019", "_context_left": "New Evidence Might Link Lazarus Tool Found in Chile ", "_context_right": " Intrusion to Previous Attacks in Pakistan", "sentence_left": "", "sentence_right": "Jan 21, 2019", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "New Evidence Might Link Lazarus Tool Found in Chile RedBanc Intrusion to Previous Attacks in", "context_right": "Jan 21, 2019", "_context_left": "New Evidence Might Link Lazarus Tool Found in Chile RedBanc Intrusion to Previous Attacks in ", "_context_right": "", "sentence_left": "", "sentence_right": "Jan 21, 2019", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Redbanc", "context_left": "===================== QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network", "context_right": "[linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific North Korea-linked Advanced Persistent Threat (APT) group Lazarus (also known as HIDDEN COBRA). Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "_context_left": "QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network ", "_context_right": " [linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific North Korea-linked Advanced Persistent Threat (APT) group Lazarus (also known as HIDDEN COBRA).", "sentence_left": "=====================", "sentence_right": "Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "North Korea-linked", "context_left": "===================== QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network Redbanc [linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific", "context_right": "Advanced Persistent Threat (APT) group Lazarus (also known as HIDDEN COBRA). Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "_context_left": "QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network Redbanc [linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific ", "_context_right": " Advanced Persistent Threat (APT) group Lazarus (also known as HIDDEN COBRA).", "sentence_left": "=====================", "sentence_right": "Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "label": "North Korea (Korean: ; MR: \"Choson\" or literally ; MR: \"Pukchoson\"), officially the Democratic People's Republic of Korea (DPRK or DPR Korea; Korean: , \"Choson Minjujuui Inmin Konghwaguk\"), is a country in East Asia constituting the northern part of the Korean Peninsula, with Pyongyang the capital and the largest city in the country. To the north and northwest, the country is bordered by China and by Russia along the Amnok (known as the Yalu in Chinese) and Tumen rivers and to the south it is bordered by South Korea, with the heavily fortified Korean Demilitarized Zone (DMZ) separating the two. Nevertheless, North Korea, like its southern counterpart, claims to be the legitimate government of the entire peninsula and adjacent islands.  In 1910, Korea was annexed by Imperial Japan. After the Japanese surrender at the end of World War II in 1945, Korea was divided into two zones, with the north occupied by the Soviet Union and the south occupied by the United States. Negotiations on reunification failed, and in 1948, separate governments were formed: the socialist Democratic People's Republic of Korea in the north, and the capitalist Republic of Korea in the south. An invasion initiated by North Korea led to the Korean War (1950–1953). The Korean Armistice Agreement brought about a ceasefire, but no peace treaty was signed.  North Korea officially describes itself as a \"self-reliant\" socialist state, and formally holds elections, though said elections have been described by outside observers as sham elections. Outside observers also generally view North Korea as", "label_id": 10400, "label_title": "North Korea", "label_link": "https://en.wikipedia.org/wiki?curid=21255", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "APT", "context_left": "===================== QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network Redbanc [linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific North Korea-linked Advanced Persistent Threat (", "context_right": ") group Lazarus (also known as HIDDEN COBRA). Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "_context_left": "QuoINT has uncovered an attack against a Pakistani financial service provider’s employee that highly matched the Tactics, Techniques, and Procedures (TTPs) [reported](http://www.trendtic.cl/2019/01/exclusivo-asi-fue-el-intento-de-ciberataque-a-redbanc-en-diciembre/) in a recent intrusion at the Chilean interbank network Redbanc [linked by Flashpoint](https://www.flashpoint-intel.com/blog/disclosure-chilean-redbanc-intrusion-lazarus-ties/) to the prolific North Korea-linked Advanced Persistent Threat (", "_context_right": ") group Lazarus (also known as HIDDEN COBRA).", "sentence_left": "=====================", "sentence_right": "Further, we uncovered new evidence that might link the November 2018 attacks against multiple Pakistani banks to Lazarus.", "label": "An advanced persistent threat (APT) is a stealthy computer network attack in which a person or group gains unauthorized access to a network and remains undetected for an extended period. The term's definition was traditionally associated with state sponsorship, but over the last few years there have been multiple examples of non-state sponsored groups conducting large-scale targeted intrusions for specific goals.  An APT may have either business or political motives. APT processes require a high degree of covertness over a long period of time. The \"advanced\" process signifies sophisticated techniques using malware to exploit vulnerabilities in systems. The \"persistent\" process suggests that an external command and control system is continuously monitoring and extracting data from a specific target. The \"threat\" process indicates human involvement in orchestrating the attack.  APT usually refers to a group, such as a government, with both the capability and the intent to target, persistently and effectively, a specific entity. The term is commonly used to refer to cyber threats, in particular that of Internet-enabled espionage using a variety of intelligence gathering techniques to access sensitive information, but applies equally to other threats such as that of traditional espionage or attacks. Other recognized attack vectors include infected media, supply chain compromise, and human intelligence and deception. The purpose of these attacks is to place custom malicious code on one or multiple computers for specific tasks and to remain undetected for the longest possible period. Knowing the attacker artifacts, such as file names, can help a professional make a network-wide search", "label_id": 3008833, "label_title": "Advanced persistent threat", "label_link": "https://en.wikipedia.org/wiki?curid=25874360", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Redbanc", "context_left": "---------------- On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution", "context_right": "in late December 2018. The sample, named ApplicationPDF.exe, was uploaded from Pakistan to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "_context_left": "On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution ", "_context_right": " in late December 2018.", "sentence_left": "----------------", "sentence_right": "The sample, named ApplicationPDF.exe, was uploaded from Pakistan to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "VirusTotal", "context_left": "---------------- On 16 January 2019, we identified a sample on", "context_right": "which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018. The sample, named ApplicationPDF.exe, was uploaded from Pakistan to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "_context_left": "On 16 January 2019, we identified a sample on ", "_context_right": " which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018.", "sentence_left": "----------------", "sentence_right": "The sample, named ApplicationPDF.exe, was uploaded from Pakistan to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "label": "VirusTotal is a website created by the Spanish security company Hispasec Sistemas. Launched in June 2004, it was acquired by Google Inc. in September 2012. The company's ownership switched in January 2018 to Chronicle, a subsidiary of Alphabet Inc..  VirusTotal aggregates many antivirus products and online scan engines to check for viruses that the user's own antivirus may have missed, or to verify against any false positives. Files up to 550 MB can be uploaded to the website or sent via email. Anti-virus software vendors can receive copies of files that were flagged by other scans but passed by their own engine, to help improve their software and, by extension, VirusTotal's own capability. Users can also scan suspect URLs and search through the VirusTotal dataset. VirusTotal for dynamic analysis of malware uses Cuckoo sandbox. VirusTotal was selected by \"PC World\" as one of the best 100 products of 2007.", "label_id": 2031721, "label_title": "VirusTotal", "label_link": "https://en.wikipedia.org/wiki?curid=15472369", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018. The sample, named ApplicationPDF.exe, was uploaded from", "context_right": "to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution. The PDF contains what is highly likely the personal information of the targeted victim.[1]", "_context_left": "The sample, named ApplicationPDF.exe, was uploaded from ", "_context_right": " to VirusTotal on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "sentence_left": "On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018.", "sentence_right": "The PDF contains what is highly likely the personal information of the targeted victim.[1]", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "VirusTotal", "context_left": "On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018. The sample, named ApplicationPDF.exe, was uploaded from Pakistan to", "context_right": "on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution. The PDF contains what is highly likely the personal information of the targeted victim.[1]", "_context_left": "The sample, named ApplicationPDF.exe, was uploaded from Pakistan to ", "_context_right": " on January 16 as a part of a ZIP archive, which also contained a generated PDF and the Windows DLL required for its execution.", "sentence_left": "On 16 January 2019, we identified a sample on VirusTotal which is almost identical to the one reportedly used to attack the Chilean financial institution Redbanc in late December 2018.", "sentence_right": "The PDF contains what is highly likely the personal information of the targeted victim.[1]", "label": "VirusTotal is a website created by the Spanish security company Hispasec Sistemas. Launched in June 2004, it was acquired by Google Inc. in September 2012. The company's ownership switched in January 2018 to Chronicle, a subsidiary of Alphabet Inc..  VirusTotal aggregates many antivirus products and online scan engines to check for viruses that the user's own antivirus may have missed, or to verify against any false positives. Files up to 550 MB can be uploaded to the website or sent via email. Anti-virus software vendors can receive copies of files that were flagged by other scans but passed by their own engine, to help improve their software and, by extension, VirusTotal's own capability. Users can also scan suspect URLs and search through the VirusTotal dataset. VirusTotal for dynamic analysis of malware uses Cuckoo sandbox. VirusTotal was selected by \"PC World\" as one of the best 100 products of 2007.", "label_id": 2031721, "label_title": "VirusTotal", "label_link": "https://en.wikipedia.org/wiki?curid=15472369", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "The PDF contains what is highly likely the personal information of the targeted victim.[1] Further OSINT analysis revealed the victim being an employee at a financial services provider in", "context_right": "and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs). The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc.", "_context_left": "Further OSINT analysis revealed the victim being an employee at a financial services provider in ", "_context_right": " and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs).", "sentence_left": "The PDF contains what is highly likely the personal information of the targeted victim.[1]", "sentence_right": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chilean", "context_left": "Further OSINT analysis revealed the victim being an employee at a financial services provider in Pakistan and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs). The targeted profile matches the one described by", "context_right": "newspapers while detailing the attack against RedBanc. The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "_context_left": "The targeted profile matches the one described by ", "_context_right": " newspapers while detailing the attack against RedBanc.", "sentence_left": "Further OSINT analysis revealed the victim being an employee at a financial services provider in Pakistan and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs).", "sentence_right": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "Further OSINT analysis revealed the victim being an employee at a financial services provider in Pakistan and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs). The targeted profile matches the one described by Chilean newspapers while detailing the attack against", "context_right": ". The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "_context_left": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against ", "_context_right": ".", "sentence_left": "Further OSINT analysis revealed the victim being an employee at a financial services provider in Pakistan and knowledgeable in financial systems and technologies including Point-of-Sales (POS) and Automated Teller Machine (ATMs).", "sentence_right": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistani", "context_left": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc. The timestamps obtained from analyzing the artifacts place this incident within a period where multiple", "context_right": "sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million. Figure 1 highlights the timeline of malicious activity targeting both Pakistan and Chile.", "_context_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple ", "_context_right": " sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "sentence_left": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc.", "sentence_right": "Figure 1 highlights the timeline of malicious activity targeting both Pakistan and Chile.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "BankIslami", "context_left": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc. The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of", "context_right": "that reportedly resulted in the loss of RS 2.6 million. Figure 1 highlights the timeline of malicious activity targeting both Pakistan and Chile.", "_context_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of ", "_context_right": " that reportedly resulted in the loss of RS 2.6 million.", "sentence_left": "The targeted profile matches the one described by Chilean newspapers while detailing the attack against RedBanc.", "sentence_right": "Figure 1 highlights the timeline of malicious activity targeting both Pakistan and Chile.", "label": "BankIslami Pakistan is a Pakistani bank based in Karachi, Pakistan.  It was the first Islamic commercial bank to receive the Islamic banking license under the Islamic banking policy of 2003 from State Bank of Pakistan on March 31, 2005. The bank started its operations from 7 April 2006 and offers shariah compliant retail banking, investment banking, consumer banking and trade finance products. The bank intends to focus on wealth management as the core area of business and plans to soon launch proprietary products, and integrated financial planning services.  The bank has a nationwide presence, its branch network consists of 213 branches and sub branches spread over 80 cities of Pakistan. With the amalgamation of KASB on May 7, 2015, all 104 branches of KASB have become part of BankIslami’s branch network. BankIslami is now the 11th largest banking network in the country with 317 branches in 93 cities nationwide.  The idea of BankIslami was conceptualized by Jahangir Siddiqui & Company Limited and Randeree family in late 2003. Mr. Hasan A. Bilgrami was appointed as adviser to the sponsors on 16 March 2004 to formalize the idea. He presented the concept paper of BankIslami to sponsors on 24 March 2004. A detailed business plan was then prepared and a formal application was submitted to the State Bank of Pakistan on 26 May 2004. On 26 September 2005, Dubai Bank joined the sponsors and became one of the founding shareholders of BankIslami by investing 18.75% in the total capital.", "label_id": 617056, "label_title": "BankIslami Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=2419370", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million. Figure 1 highlights the timeline of malicious activity targeting both", "context_right": "and Chile. More specifically, the timeline highlights:", "_context_left": "Figure 1 highlights the timeline of malicious activity targeting both ", "_context_right": " and Chile.", "sentence_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "sentence_right": "More specifically, the timeline highlights:", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chile", "context_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million. Figure 1 highlights the timeline of malicious activity targeting both Pakistan and", "context_right": ". More specifically, the timeline highlights:", "_context_left": "Figure 1 highlights the timeline of malicious activity targeting both Pakistan and ", "_context_right": ".", "sentence_left": "The timestamps obtained from analyzing the artifacts place this incident within a period where multiple Pakistani sources reported incidents against the local banking sector, such as the compromise of BankIslami that reportedly resulted in the loss of RS 2.6 million.", "sentence_right": "More specifically, the timeline highlights:", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "BankIslami", "context_left": "* 21 total banks notifying their customers of multiple credit card dumps for sale on the dark web (26 and 31 October); *", "context_right": "reporting suspicious transactions resulting in RS 2.6 of losses (27 October); * The date an unknown user located in Chile uploaded the alleged malware sample used to target RedBanc (13 December); and", "_context_left": "* ", "_context_right": " reporting suspicious transactions resulting in RS 2.6 of losses (27 October);", "sentence_left": "* 21 total banks notifying their customers of multiple credit card dumps for sale on the dark web (26 and 31 October);", "sentence_right": "* The date an unknown user located in Chile uploaded the alleged malware sample used to target RedBanc (13 December); and", "label": "BankIslami Pakistan is a Pakistani bank based in Karachi, Pakistan.  It was the first Islamic commercial bank to receive the Islamic banking license under the Islamic banking policy of 2003 from State Bank of Pakistan on March 31, 2005. The bank started its operations from 7 April 2006 and offers shariah compliant retail banking, investment banking, consumer banking and trade finance products. The bank intends to focus on wealth management as the core area of business and plans to soon launch proprietary products, and integrated financial planning services.  The bank has a nationwide presence, its branch network consists of 213 branches and sub branches spread over 80 cities of Pakistan. With the amalgamation of KASB on May 7, 2015, all 104 branches of KASB have become part of BankIslami’s branch network. BankIslami is now the 11th largest banking network in the country with 317 branches in 93 cities nationwide.  The idea of BankIslami was conceptualized by Jahangir Siddiqui & Company Limited and Randeree family in late 2003. Mr. Hasan A. Bilgrami was appointed as adviser to the sponsors on 16 March 2004 to formalize the idea. He presented the concept paper of BankIslami to sponsors on 24 March 2004. A detailed business plan was then prepared and a formal application was submitted to the State Bank of Pakistan on 26 May 2004. On 26 September 2005, Dubai Bank joined the sponsors and became one of the founding shareholders of BankIslami by investing 18.75% in the total capital.", "label_id": 617056, "label_title": "BankIslami Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=2419370", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chile", "context_left": "* BankIslami reporting suspicious transactions resulting in RS 2.6 of losses (27 October); * The date an unknown user located in", "context_right": "uploaded the alleged malware sample used to target RedBanc (13 December); and * The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January).", "_context_left": "* The date an unknown user located in ", "_context_right": " uploaded the alleged malware sample used to target RedBanc (13 December); and", "sentence_left": "* BankIslami reporting suspicious transactions resulting in RS 2.6 of losses (27 October);", "sentence_right": "* The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January).", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "* BankIslami reporting suspicious transactions resulting in RS 2.6 of losses (27 October); * The date an unknown user located in Chile uploaded the alleged malware sample used to target", "context_right": "(13 December); and * The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January).", "_context_left": "* The date an unknown user located in Chile uploaded the alleged malware sample used to target ", "_context_right": " (13 December); and", "sentence_left": "* BankIslami reporting suspicious transactions resulting in RS 2.6 of losses (27 October);", "sentence_right": "* The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January).", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "* The date an unknown user located in Chile uploaded the alleged malware sample used to target RedBanc (13 December); and * The date the highly likely compromised user in", "context_right": "submitted the malware sample used to target him (16 January). It is unknown, however, if this newly discovered activity is related to any of the publicly reported Pakistani incidents", "_context_left": "* The date the highly likely compromised user in ", "_context_right": " submitted the malware sample used to target him (16 January).", "sentence_left": "* The date an unknown user located in Chile uploaded the alleged malware sample used to target RedBanc (13 December); and", "sentence_right": "It is unknown, however, if this newly discovered activity is related to any of the publicly reported Pakistani incidents", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistani", "context_left": "* The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January). It is unknown, however, if this newly discovered activity is related to any of the publicly reported", "context_right": "incidents ![](data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==)", "_context_left": "It is unknown, however, if this newly discovered activity is related to any of the publicly reported ", "_context_right": " incidents", "sentence_left": "* The date the highly likely compromised user in Pakistan submitted the malware sample used to target him (16 January).", "sentence_right": "![](data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==)", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "------------------ According to the reported disclosure of the", "context_right": "intrusion, the lure begins with a job offer posted to a social media network (LinkedIn). After clicking to apply, attackers contact the person inquiring and an interview conversation occurs, in an attempt to validate the scheme and build trust.", "_context_left": "According to the reported disclosure of the ", "_context_right": " intrusion, the lure begins with a job offer posted to a social media network (LinkedIn).", "sentence_left": "------------------", "sentence_right": "After clicking to apply, attackers contact the person inquiring and an interview conversation occurs, in an attempt to validate the scheme and build trust.", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "VirusTotal", "context_left": "Figure 2 — ApplicationPDF.exe variants Shortly after, we identified a compressed archive also uploaded to", "context_right": "containing the exact same sample, along with two additional non-malicious files, one of which is interesting for our victimology efforts.[2] ![](data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==)", "_context_left": "Shortly after, we identified a compressed archive also uploaded to ", "_context_right": " containing the exact same sample, along with two additional non-malicious files, one of which is interesting for our victimology efforts.[2]", "sentence_left": "Figure 2 — ApplicationPDF.exe variants", "sentence_right": "![](data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==)", "label": "VirusTotal is a website created by the Spanish security company Hispasec Sistemas. Launched in June 2004, it was acquired by Google Inc. in September 2012. The company's ownership switched in January 2018 to Chronicle, a subsidiary of Alphabet Inc..  VirusTotal aggregates many antivirus products and online scan engines to check for viruses that the user's own antivirus may have missed, or to verify against any false positives. Files up to 550 MB can be uploaded to the website or sent via email. Anti-virus software vendors can receive copies of files that were flagged by other scans but passed by their own engine, to help improve their software and, by extension, VirusTotal's own capability. Users can also scan suspect URLs and search through the VirusTotal dataset. VirusTotal for dynamic analysis of malware uses Cuckoo sandbox. VirusTotal was selected by \"PC World\" as one of the best 100 products of 2007.", "label_id": 2031721, "label_title": "VirusTotal", "label_link": "https://en.wikipedia.org/wiki?curid=15472369", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chile", "context_left": "![](https://miro.medium.com/max/690/1*noZvzBWg_MdP5CAnhB8awg.png) **Figure 3** — QuoLab screenshot of the similarity in the kill-chain between tool variants used in", "context_right": "and Pakistan **AppplicationPDF.exe**", "_context_left": "**Figure 3** — QuoLab screenshot of the similarity in the kill-chain between tool variants used in ", "_context_right": " and Pakistan", "sentence_left": "![](https://miro.medium.com/max/690/1*noZvzBWg_MdP5CAnhB8awg.png)", "sentence_right": "**AppplicationPDF.exe**", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "![](https://miro.medium.com/max/690/1*noZvzBWg_MdP5CAnhB8awg.png) **Figure 3** — QuoLab screenshot of the similarity in the kill-chain between tool variants used in Chile and", "context_right": "**AppplicationPDF.exe**", "_context_left": "**Figure 3** — QuoLab screenshot of the similarity in the kill-chain between tool variants used in Chile and ", "_context_right": "", "sentence_left": "![](https://miro.medium.com/max/690/1*noZvzBWg_MdP5CAnhB8awg.png)", "sentence_right": "**AppplicationPDF.exe**", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chilean", "context_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1) Similar to the dropper used in the", "context_right": "RedBanc attack, this tool is a GUI program (Figure 4) faking an application form. Besides the compilation timestamp, the two variants are virtually the same.", "_context_left": "Similar to the dropper used in the ", "_context_right": " RedBanc attack, this tool is a GUI program (Figure 4) faking an application form.", "sentence_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1)", "sentence_right": "Besides the compilation timestamp, the two variants are virtually the same.", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1) Similar to the dropper used in the Chilean", "context_right": "attack, this tool is a GUI program (Figure 4) faking an application form. Besides the compilation timestamp, the two variants are virtually the same.", "_context_left": "Similar to the dropper used in the Chilean ", "_context_right": " attack, this tool is a GUI program (Figure 4) faking an application form.", "sentence_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1)", "sentence_right": "Besides the compilation timestamp, the two variants are virtually the same.", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "dropper", "context_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1) Similar to the", "context_right": "used in the Chilean RedBanc attack, this tool is a GUI program (Figure 4) faking an application form. Besides the compilation timestamp, the two variants are virtually the same.", "_context_left": "Similar to the ", "_context_right": " used in the Chilean RedBanc attack, this tool is a GUI program (Figure 4) faking an application form.", "sentence_left": "**SHA-256:** 0e3552c8232e007f421f241ea4188ea941f4d34eab311a5c2341488749d892c7 (Variant #1)", "sentence_right": "Besides the compilation timestamp, the two variants are virtually the same.", "label": "A dropper is a kind of Trojan that has been designed to \"install\" some sort of malware (virus, backdoor, etc.) to a target system. The malware code can be contained within the dropper (single-stage) in such a way as to avoid detection by virus scanners or the dropper may download the malware to the target machine once activated (two stage).", "label_id": 362086, "label_title": "Dropper (malware)", "label_link": "https://en.wikipedia.org/wiki?curid=1149440", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chile", "context_left": "PowerRatankba is a PowerShell based reconnaissance tool that conducts initial information gathering from the victim’s system and functions as a backdoor. In both", "context_right": "and Pakistan, the same variant is delivered, thus, accepts the same six commands, contains the same hardcoded C2 URL (hxxps://ecombox[.]store/tbl\\_add.php) and commented out C2 (hxxps://bodyshoppechiropractic[.]com/tbl\\_add.php). The backdoor functionality provided by the toolkit could enable the actor to deploy further stages of the attack if the victim’s system is deemed interesting.", "_context_left": "In both ", "_context_right": " and Pakistan, the same variant is delivered, thus, accepts the same six commands, contains the same hardcoded C2 URL (hxxps://ecombox[.]store/tbl\\_add.php) and commented out C2 (hxxps://bodyshoppechiropractic[.]com/tbl\\_add.php).", "sentence_left": "PowerRatankba is a PowerShell based reconnaissance tool that conducts initial information gathering from the victim’s system and functions as a backdoor.", "sentence_right": "The backdoor functionality provided by the toolkit could enable the actor to deploy further stages of the attack if the victim’s system is deemed interesting.", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Pakistan", "context_left": "PowerRatankba is a PowerShell based reconnaissance tool that conducts initial information gathering from the victim’s system and functions as a backdoor. In both Chile and", "context_right": ", the same variant is delivered, thus, accepts the same six commands, contains the same hardcoded C2 URL (hxxps://ecombox[.]store/tbl\\_add.php) and commented out C2 (hxxps://bodyshoppechiropractic[.]com/tbl\\_add.php). The backdoor functionality provided by the toolkit could enable the actor to deploy further stages of the attack if the victim’s system is deemed interesting.", "_context_left": "In both Chile and ", "_context_right": ", the same variant is delivered, thus, accepts the same six commands, contains the same hardcoded C2 URL (hxxps://ecombox[.]store/tbl\\_add.php) and commented out C2 (hxxps://bodyshoppechiropractic[.]com/tbl\\_add.php).", "sentence_left": "PowerRatankba is a PowerShell based reconnaissance tool that conducts initial information gathering from the victim’s system and functions as a backdoor.", "sentence_right": "The backdoor functionality provided by the toolkit could enable the actor to deploy further stages of the attack if the victim’s system is deemed interesting.", "label": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the world’s sixth-most populous country with a population exceeding 212,742,631 people. In area, it is the 33rd-largest country, spanning . Pakistan has a coastline along the Arabian Sea and Gulf of Oman in the south and is bordered by India to the east, Afghanistan to the west, Iran to the southwest, and China in the northeast. It is separated narrowly from Tajikistan by Afghanistan's Wakhan Corridor in the northwest, and also shares a maritime border with Oman.  The territory that now constitutes Pakistan was the site of several ancient cultures and intertwined with the history of the broader Indian subcontinent. The ancient history involves the Neolithic site of Mehrgarh and the Bronze Age Indus Valley Civilisation, and was later home to kingdoms ruled by people of different faiths and cultures, including Hindus, Indo-Greeks, Muslims, Turco-Mongols, Afghans and Sikhs. The area has been ruled by numerous empires and dynasties, including the Persian Achaemenid Empire, Alexander III of Macedon, the Seleucid Empire, the Indian Maurya Empire, the Gupta Empire, the Arab Umayyad Caliphate, the Delhi Sultanate, the Mongol Empire, the Mughal Empire, the Afghan Durrani Empire, the Sikh Empire (partially) and, most recently, the British Indian Empire. Pakistan is the only country to have been created in the name of Islam. It is an ethnically and linguistically diverse country, with a similarly diverse geography and wildlife. Initially a dominion, Pakistan adopted a constitution in 1956, becoming an Islamic republic. An ethnic", "label_id": 11352, "label_title": "Pakistan", "label_link": "https://en.wikipedia.org/wiki?curid=23235", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "Chile", "context_left": "Secondly, OSINT analysis revealed the identity of the targeted individual on social media and his current employment, directly or as a contractor, as an IT professional by an entity within the financial services industry. Considering the initial attack vector used in", "context_right": "also targeted an IT staff member at RedBanc, it is highly likely that the same threat actors would target the above described individual. **Conclusion**", "_context_left": "Considering the initial attack vector used in ", "_context_right": " also targeted an IT staff member at RedBanc, it is highly likely that the same threat actors would target the above described individual.", "sentence_left": "Secondly, OSINT analysis revealed the identity of the targeted individual on social media and his current employment, directly or as a contractor, as an IT professional by an entity within the financial services industry.", "sentence_right": "**Conclusion**", "label": "Chile (, ; ), officially the Republic of Chile (), is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernandez, Salas y Gomez, Desventuradas, and Easter Island in Oceania. Chile also claims about of Antarctica, although all claims are suspended under the Antarctic Treaty.  The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands.  Spain conquered and colonized the region in the mid-16th century, replacing Inca rule in the north and centre, but failing to conquer the independent Mapuche who inhabited what is now south-central Chile. After declaring its independence from Spain in 1818, Chile emerged in the 1830s as a relatively stable authoritarian republic. In the 19th century, Chile saw significant economic and territorial growth, ending Mapuche resistance in the 1880s and gaining its current northern territory in the War of the Pacific", "label_id": 2456, "label_title": "Chile", "label_link": "https://en.wikipedia.org/wiki?curid=5489", "entity_class": "NE", "entity_type": "LOC", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "RedBanc", "context_left": "Secondly, OSINT analysis revealed the identity of the targeted individual on social media and his current employment, directly or as a contractor, as an IT professional by an entity within the financial services industry. Considering the initial attack vector used in Chile also targeted an IT staff member at", "context_right": ", it is highly likely that the same threat actors would target the above described individual. **Conclusion**", "_context_left": "Considering the initial attack vector used in Chile also targeted an IT staff member at ", "_context_right": ", it is highly likely that the same threat actors would target the above described individual.", "sentence_left": "Secondly, OSINT analysis revealed the identity of the targeted individual on social media and his current employment, directly or as a contractor, as an IT professional by an entity within the financial services industry.", "sentence_right": "**Conclusion**", "label": "Redbanc is an interbank network in Chile connecting the ATMs of all the banks in Chile. ATMs are available all over Chile and Redbanc ATMs work with any Cirrus, MasterCard, or Visa card.", "label_id": 1175482, "label_title": "Redbanc", "label_link": "https://en.wikipedia.org/wiki?curid=6465907", "entity_class": "NE", "entity_type": "SECTOR", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}
{"mention": "APT", "context_left": "============== Lazarus is an", "context_right": "threat actor group that has operated since at least 2009, and attributed to a variety attacks across multiple sectors including financials, and entertainment. While we have evidence to support that this latest activity occurred during the timeframe where multiple Pakistani banks were heavily targeted by cyber criminals, we still cannot confirm that all those attacks were committed by the same threat actor.", "_context_left": "Lazarus is an ", "_context_right": " threat actor group that has operated since at least 2009, and attributed to a variety attacks across multiple sectors including financials, and entertainment.", "sentence_left": "==============", "sentence_right": "While we have evidence to support that this latest activity occurred during the timeframe where multiple Pakistani banks were heavily targeted by cyber criminals, we still cannot confirm that all those attacks were committed by the same threat actor.", "label": "An advanced persistent threat (APT) is a stealthy computer network attack in which a person or group gains unauthorized access to a network and remains undetected for an extended period. The term's definition was traditionally associated with state sponsorship, but over the last few years there have been multiple examples of non-state sponsored groups conducting large-scale targeted intrusions for specific goals.  An APT may have either business or political motives. APT processes require a high degree of covertness over a long period of time. The \"advanced\" process signifies sophisticated techniques using malware to exploit vulnerabilities in systems. The \"persistent\" process suggests that an external command and control system is continuously monitoring and extracting data from a specific target. The \"threat\" process indicates human involvement in orchestrating the attack.  APT usually refers to a group, such as a government, with both the capability and the intent to target, persistently and effectively, a specific entity. The term is commonly used to refer to cyber threats, in particular that of Internet-enabled espionage using a variety of intelligence gathering techniques to access sensitive information, but applies equally to other threats such as that of traditional espionage or attacks. Other recognized attack vectors include infected media, supply chain compromise, and human intelligence and deception. The purpose of these attacks is to place custom malicious code on one or multiple computers for specific tasks and to remain undetected for the longest possible period. Knowing the attacker artifacts, such as file names, can help a professional make a network-wide search", "label_id": 3008833, "label_title": "Advanced persistent threat", "label_link": "https://en.wikipedia.org/wiki?curid=25874360", "entity_class": "CE", "entity_type": "CON", "document": "quoteintelligence_2019-01-21_new-evidence-might-link-lazarus"}