{"mention": "U.S. Justice department", "context_left": "In June 2014, the", "context_right": "launched an international law enforcement operation dubbed '[Operation Tovar](http://www.justice.gov/opa/gameover-zeus.html)'  to take control of the Gameover Zeus P2P Botnet.", "_context_left": "In June 2014, the ", "_context_right": " launched an international law enforcement operation dubbed '[Operation Tovar](http://www.justice.gov/opa/gameover-zeus.html)'  to take control of the Gameover Zeus P2P Botnet.", "sentence_left": "* Mobile Zeus, also known as Zeus in the mobile (Zitmo)", "sentence_right": "This operation turned out to be a success with the shutdown of the Botnet activity and related Cryptolocker infection cycle.", "label": "The United States Department of Justice (DOJ), also known as the Justice Department, is a federal executive department of the U.S. government, responsible for the enforcement of the law and administration of justice in the United States, equivalent to the justice or interior ministries of other countries. The department was formed in 1870 during the Ulysses S. Grant administration.  The Department of Justice administers several federal law enforcement agencies including the Federal Bureau of Investigation (FBI), the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), and the Drug Enforcement Administration (DEA). The department is responsible for investigating instances of financial fraud, representing the United States government in legal matters (such as in cases before the Supreme Court), and running the federal prison system. The department is also responsible for reviewing the conduct of local law enforcement as directed by the Violent Crime Control and Law Enforcement Act of 1994.  The department is headed by the United States Attorney General, who is nominated by the President and confirmed by the Senate and is a member of the Cabinet. The current Attorney General is William Barr.", "label_id": 26676, "label_title": "United States Department of Justice", "label_link": "https://en.wikipedia.org/wiki?curid=52563", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-08-30_look-new-gameover-zeus-variant"}
{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ will continue to monitor the activities of this Botnet family in the coming months for active C2 servers as well as any feature updates and will ensure protection for customers.", "_context_left": "", "_context_right": " ThreatLabZ will continue to monitor the activities of this Botnet family in the coming months for active C2 servers as well as any feature updates and will ensure protection for customers.", "sentence_left": "The number of infections are still very low and it has a long way to go to reach the infection rates observed prior to the Government takedown.", "sentence_right": "- [Deepen Desai](https://plus.google.com/104799054674960248904)", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-08-30_look-new-gameover-zeus-variant"}