{"mention": "GitHub", "context_left": "The above script is sourced from a script that is published on MoneroOcean's", "context_right": "account with two minor modifications.", "_context_left": "The above script is sourced from a script that is published on MoneroOcean's ", "_context_right": " account with two minor modifications.", "sentence_left": "Execution flow and Batch file executed by malware", "sentence_right": "The malware author has modified the *DownloadFile* URL to point to a copy of official miner batch file that is hosted on the malware author's site.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-08-16_anti-coinminer-mining-campaign"}
{"mention": "Facebook", "context_left": "*run.bat* will run *c:\\ProgramData\\playersclub\\player.exe* and *share.bat* will open xmrminingpro[.]com/share.html in an attempt to convince the user to share this website on social media sites - Twitter,", "context_right": "and Google Plus - resulting in further infections.", "_context_left": "*run.bat* will run *c:\\ProgramData\\playersclub\\player.exe* and *share.bat* will open xmrminingpro[.]com/share.html in an attempt to convince the user to share this website on social media sites - Twitter, ", "_context_right": " and Google Plus - resulting in further infections.", "sentence_left": "Batch files are just one-line scripts in this case as seen below;", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Aug2018_anticoinminer_blog/4.%20bat%20files.png)", "label": "Meta Platforms, Inc., doing business as Meta and formerly named Facebook, Inc., and TheFacebook, Inc., is an American multinational technology conglomerate based in Menlo Park, California. The company owns Facebook, Instagram, and WhatsApp, among other products and services. Meta is one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Apple, and Microsoft. Meta's products and services include Facebook, Messenger, Facebook Watch, and Meta Portal. It has also acquired Oculus, Giphy, Mapillary, Kustomer, Presize and has a 9.99% stake in Jio Platforms. In 2021, the company generated 97.5% of its revenue from the sale of advertising.In October 2021, the parent company of Facebook changed its name from Facebook, Inc., to Meta Platforms, Inc., to \"reflect its focus on building the metaverse\". According to Meta, the \"metaverse\" refers to the integrated environment that links all of the company's products and services.", "label_id": 5903534, "label_title": "Meta Platforms", "label_link": "https://en.wikipedia.org/wiki?curid=62420226", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-08-16_anti-coinminer-mining-campaign"}
{"mention": "Google", "context_left": "*run.bat* will run *c:\\ProgramData\\playersclub\\player.exe* and *share.bat* will open xmrminingpro[.]com/share.html in an attempt to convince the user to share this website on social media sites - Twitter, Facebook and", "context_right": "Plus - resulting in further infections.", "_context_left": "*run.bat* will run *c:\\ProgramData\\playersclub\\player.exe* and *share.bat* will open xmrminingpro[.]com/share.html in an attempt to convince the user to share this website on social media sites - Twitter, Facebook and ", "_context_right": " Plus - resulting in further infections.", "sentence_left": "Batch files are just one-line scripts in this case as seen below;", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Aug2018_anticoinminer_blog/4.%20bat%20files.png)", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-08-16_anti-coinminer-mining-campaign"}
{"mention": "Zscaler", "context_left": "", "context_right": "ThreatLabZ is actively monitoring for threats like these and will continue to ensure coverage for Zscaler customers.", "_context_left": "", "_context_right": " ThreatLabZ is actively monitoring for threats like these and will continue to ensure coverage for Zscaler customers.", "sentence_left": "The malware operator is using an off-the-shelf cryptominer malware for this campaign; however the original cryptominer malware author has a backdoor functionality embedded in the code which deceives the second level malware operator by stealing large portion of CPU cycles from the infected machines to mine coins for the original author.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Aug2018_anticoinminer_blog/ba_report.png)", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-08-16_anti-coinminer-mining-campaign"}
{"mention": "Zscaler", "context_left": "Zscaler ThreatLabZ is actively monitoring for threats like these and will continue to ensure coverage for", "context_right": "customers.", "_context_left": "Zscaler ThreatLabZ is actively monitoring for threats like these and will continue to ensure coverage for ", "_context_right": " customers.", "sentence_left": "The malware operator is using an off-the-shelf cryptominer malware for this campaign; however the original cryptominer malware author has a backdoor functionality embedded in the code which deceives the second level malware operator by stealing large portion of CPU cycles from the infected machines to mine coins for the original author.", "sentence_right": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Aug2018_anticoinminer_blog/ba_report.png)", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2018-08-16_anti-coinminer-mining-campaign"}