{"mention": "cybercriminals", "context_left": "A sandbox is a valuable tool in the ongoing battle against", "context_right": "and bad actors are continually looking for ways to avoid detection.", "_context_left": "A sandbox is a valuable tool in the ongoing battle against ", "_context_right": " and bad actors are continually looking for ways to avoid detection.", "sentence_left": "June 26, 2020", "sentence_right": "One of the newest ones we observed, Taurus, includes techniques to evade sandbox detection.", "label": "Cybercrime, or computer-oriented crime, is a crime that involves a computer and a network. The computer may have been used in the commission of a crime, or it may be the target. Cybercrimes can be defined as: \"Offences that are committed against individuals or groups of individuals with a criminal motive to intentionally harm the reputation of the victim or cause physical or mental harm, or loss, to the victim directly or indirectly, using modern telecommunication networks such as Internet (networks including chat rooms, emails, notice boards and groups) and mobile phones (Bluetooth/SMS/MMS)\". Cybercrime may threaten a person or a nation's security and financial health. Issues surrounding these types of crimes have become high-profile, particularly those surrounding hacking, copyright infringement, unwarranted mass-surveillance, sextortion, child pornography, and child grooming.  There are also problems of privacy when confidential information is intercepted or disclosed, lawfully or otherwise. Debarati Halder and K. Jaishankar further define cybercrime from the perspective of gender and defined 'cybercrime against women' as \"Crimes targeted against women with a motive to intentionally harm the victim psychologically and physically, using modern telecommunication networks such as internet and mobile phones\". Internationally, both governmental and non-state actors engage in cybercrimes, including espionage, financial theft, and other cross-border crimes. Cybercrimes crossing international borders and involving the actions of at least one nation-state is sometimes referred to as cyberwarfare.  A report (sponsored by McAfee), published in 2014, estimated that the annual damage to the global economy was $445 billion. Approximately $1.5 billion was lost in 2012 to online", "label_id": 152809, "label_title": "Cybercrime", "label_link": "https://en.wikipedia.org/wiki?curid=341598", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Zscaler", "context_left": "Was this new malware able to go undetected by the [", "context_right": "Cloud Sandbox](/products/sandboxing).", "_context_left": "Was this new malware able to go undetected by the [", "_context_right": " Cloud Sandbox](/products/sandboxing).", "sentence_left": "One of the newest ones we observed, Taurus, includes techniques to evade sandbox detection.", "sentence_right": "(Spoiler alert: It wasn't.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "Was this new", "context_right": "able to go undetected by the [Zscaler Cloud Sandbox](/products/sandboxing).", "_context_left": "Was this new ", "_context_right": " able to go undetected by the [Zscaler Cloud Sandbox](/products/sandboxing).", "sentence_left": "One of the newest ones we observed, Taurus, includes techniques to evade sandbox detection.", "sentence_right": "(Spoiler alert: It wasn't.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "In early June 2020, we observed and began tracking a new", "context_right": "campaign.", "_context_left": "In early June 2020, we observed and began tracking a new ", "_context_right": " campaign.", "sentence_left": "Let's take a closer look at the Taurus stealer.", "sentence_right": "During our research, we observed that the \"Predator the Thief\" cybercriminal group is behind the development of this stealer, named Taurus, and is selling it on dark forums for $100 or rebuilt with a new domain for $20.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Commonwealth of Independent States", "context_left": "Taurus is designed to not execute in countries within the", "context_right": "(CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the ", "_context_right": " (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "The Commonwealth of Independent States (CIS) is a regional intergovernmental organization of ten post-Soviet republics in Eurasia formed following the dissolution of the Soviet Union. It has an area of 20,368,759 km² (8,097,484 sq mi) and has an estimated population of 239,796,010. The CIS encourages cooperation in economical, political and military affairs and has certain powers to coordinate trade, finance, lawmaking and security. It has also promoted cooperation on cross-border crime prevention.  The CIS has its origins in the Soviet Union (USSR), which in turn replaced the old Russian Empire in 1917 when it was established by the 1922 Treaty and Declaration of the Creation of the USSR by the Russian SFSR, Byelorussian SSR and Ukrainian SSR. When the USSR began to fall in 1991, the founding republics signed the Belavezha Accords on 8 December 1991, declaring that the Soviet Union would cease to exist and proclaimed the CIS in its place. A few days later the Alma-Ata Protocol was signed, which declared that Soviet Union was dissolved and that the Russian Federation was to be its successor state. The Baltic states (Estonia, Latvia and Lithuania), which regard their membership in the Soviet Union as an illegal occupation, chose not to participate. Georgia withdrew its membership in 2008. Ukraine, which participated as an associate member, ended its participation in CIS statutory bodies on 19 May 2018.  Eight of the nine CIS member states participate in the CIS Free Trade Area. Three organizations are under the overview of the CIS, namely the Collective Security Treaty", "label_id": 18674, "label_title": "Commonwealth of Independent States", "label_link": "https://en.wikipedia.org/wiki?curid=36870", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "CIS", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (", "context_right": "), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (", "_context_right": "), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "The Commonwealth of Independent States (CIS) is a regional intergovernmental organization of ten post-Soviet republics in Eurasia formed following the dissolution of the Soviet Union. It has an area of 20,368,759 km² (8,097,484 sq mi) and has an estimated population of 239,796,010. The CIS encourages cooperation in economical, political and military affairs and has certain powers to coordinate trade, finance, lawmaking and security. It has also promoted cooperation on cross-border crime prevention.  The CIS has its origins in the Soviet Union (USSR), which in turn replaced the old Russian Empire in 1917 when it was established by the 1922 Treaty and Declaration of the Creation of the USSR by the Russian SFSR, Byelorussian SSR and Ukrainian SSR. When the USSR began to fall in 1991, the founding republics signed the Belavezha Accords on 8 December 1991, declaring that the Soviet Union would cease to exist and proclaimed the CIS in its place. A few days later the Alma-Ata Protocol was signed, which declared that Soviet Union was dissolved and that the Russian Federation was to be its successor state. The Baltic states (Estonia, Latvia and Lithuania), which regard their membership in the Soviet Union as an illegal occupation, chose not to participate. Georgia withdrew its membership in 2008. Ukraine, which participated as an associate member, ended its participation in CIS statutory bodies on 19 May 2018.  Eight of the nine CIS member states participate in the CIS Free Trade Area. Three organizations are under the overview of the CIS, namely the Collective Security Treaty", "label_id": 18674, "label_title": "Commonwealth of Independent States", "label_link": "https://en.wikipedia.org/wiki?curid=36870", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Azerbaijan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes", "context_right": ", Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes ", "_context_right": ", Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Azerbaijan (, ; ), officially the Republic of Azerbaijan ( ), is a country in the South Caucasus region of Eurasia at the crossroads of Eastern Europe and Western Asia. It is bounded by the Caspian Sea to the east, Russia to the north, Georgia to the northwest, Armenia to the west and Iran to the south. The exclave of Nakhchivan is bounded by Armenia to the north and east, Iran to the south and west, and has an long border with Turkey in the northwest.  The Azerbaijan Democratic Republic proclaimed its independence in 1918 and became the first secular democratic Muslim-majority state. In 1920 the country was incorporated into the Soviet Union as the Azerbaijan Soviet Socialist Republic. The modern Republic of Azerbaijan proclaimed its independence on 30 August 1991, shortly before the dissolution of the USSR in the same year. In September 1991, the Armenian majority of the disputed Nagorno-Karabakh region seceded to form the Republic of Artsakh. The region and seven adjacent districts outside it became \"de facto\" independent with the end of the Nagorno-Karabakh War in 1994. These regions are internationally recognized as part of Azerbaijan pending a solution to the status of the Nagorno-Karabakh through negotiations facilitated by the OSCE.  Azerbaijan is a unitary semi-presidential republic. It is one of six independent Turkic states and an active member of the Turkic Council and the TURKSOY community. Azerbaijan has diplomatic relations with 158 countries and holds membership in 38 international organizations, including the United Nations (since 1992), the Council", "label_id": 95, "label_title": "Azerbaijan", "label_link": "https://en.wikipedia.org/wiki?curid=746", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Armenia", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan,", "context_right": ", Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, ", "_context_right": ", Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Armenia (; , ), officially the Republic of Armenia (, ), is a country in the South Caucasus region of Eurasia. Located in Western Asia on the Armenian Highlands, it is bordered by Turkey to the west, Georgia to the north, the \"de facto\" independent Republic of Artsakh and Azerbaijan to the east, and Iran and Azerbaijan's exclave of Nakhchivan to the south.  Armenia is a unitary, multi-party, democratic nation-state with an ancient cultural heritage. Urartu was established in 860 BC and by the 6th century BC it was replaced by the Satrapy of Armenia. The Kingdom of Armenia reached its height under Tigranes the Great in the 1st century BC and became the first state in the world to adopt Christianity as its official religion in the late 3rd or early 4th century AD. The official date of state adoption of Christianity is 301. The ancient Armenian kingdom was split between the Byzantine and Sasanian Empires around the early 5th century. Under the Bagratuni dynasty, the Bagratid Kingdom of Armenia was restored in the 9th century. Declining due to the wars against the Byzantines, the kingdom fell in 1045 and Armenia was soon after invaded by the Seljuk Turks. An Armenian principality and later a kingdom Cilician Armenia was located on the coast of the Mediterranean Sea between the 11th and 14th centuries.  Between the 16th and 19th centuries, the traditional Armenian homeland composed of Eastern Armenia and Western Armenia came under the rule of the Ottoman and Iranian empires, repeatedly ruled", "label_id": 1584643, "label_title": "Armenia", "label_link": "https://en.wikipedia.org/wiki?curid=10918072", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Belarus", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia,", "context_right": ", Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, ", "_context_right": ", Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Belarus (; , ), officially the Republic of Belarus (, ), formerly known by its Russian name Byelorussia or Belorussia (), is a landlocked country in Eastern Europe bordered by Russia to the northeast, Ukraine to the south, Poland to the west, and Lithuania and Latvia to the northwest. Its capital and most populous city is Minsk. Over 40% of its is forested. Its major economic sectors are service industries and manufacturing. Until the 20th century, different states at various times controlled the lands of modern-day Belarus, including the Principality of Polotsk (11th to 14th centuries), the Grand Duchy of Lithuania, the Polish–Lithuanian Commonwealth, and the Russian Empire.  In the aftermath of the 1917 Russian Revolution, Belarus declared independence as the Belarusian People's Republic, which was conquered by Soviet Russia. The Socialist Soviet Republic of Byelorussia became a founding constituent republic of the Soviet Union in 1922 and was renamed as the Byelorussian Soviet Socialist Republic (Byelorussian SSR). Belarus lost almost half of its territory to Poland after the Polish–Soviet War of 1919–1921. Much of the borders of Belarus took their modern shape in 1939, when some lands of the Second Polish Republic were reintegrated into it after the Soviet invasion of Poland, and were finalized after World War II. During WWII, military operations devastated Belarus, which lost about a third of its population and more than half of its economic resources. The republic was redeveloped in the post-war years. In 1945 the Byelorussian SSR became a founding member of the United Nations, along with", "label_id": 1482, "label_title": "Belarus", "label_link": "https://en.wikipedia.org/wiki?curid=3457", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Georgia", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus,", "context_right": ", Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, ", "_context_right": ", Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Georgia (, ), known until 1995 as the Republic of Georgia (), is a country in the Caucasus region of Eurasia. Located at the crossroads of Western Asia and Eastern Europe, it is bounded to the west by the Black Sea, to the north by Russia, to the south by Turkey and Armenia, and to the southeast by Azerbaijan. The capital and largest city is Tbilisi. Georgia covers a territory of , and its 2017 population is about 3.718 million. Georgia is a unitary parliamentary republic, with the government elected through a representative democracy.  During the classical era, several independent kingdoms became established in what is now Georgia, such as Colchis and Iberia. The Georgians officially adopted Christianity in the early 4th century. The Eastern Orthodox Church had enormous importance for spiritual and political unification of early Georgian states. A unified Kingdom of Georgia reached its Golden Age during the reign of King David the Builder and Queen Tamar the Great in the 12th and early 13th centuries. Thereafter, the kingdom declined and eventually disintegrated under hegemony of various regional powers, including the Mongols, the Ottoman Empire, and successive dynasties of Iran. In the late 18th century, the eastern Georgian Kingdom of Kartli-Kakheti forged an alliance with the Russian Empire, which directly annexed the kingdom in 1801 and conquered the western Kingdom of Imereti in 1810. Russian rule over Georgia was eventually acknowledged in various peace treaties with Iran and the Ottomans and the remaining Georgian territories were absorbed by the Russian Empire in a", "label_id": 24934, "label_title": "Georgia (country)", "label_link": "https://en.wikipedia.org/wiki?curid=48768", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Kazakhstan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia,", "context_right": ", Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, ", "_context_right": ", Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Kazakhstan (, ), officially the Republic of Kazakhstan (; ), is the world's largest landlocked country, and the ninth largest in the world, with an area of . It is a transcontinental country largely located in Asia; the most western parts are in Europe. Kazakhstan is the dominant nation of Central Asia economically, generating 60% of the region's GDP, primarily through its oil and gas industry. It also has vast mineral resources.  Kazakhstan is officially a democratic, secular, unitary, constitutional republic with a diverse cultural heritage. Kazakhstan shares borders with Russia, China, Kyrgyzstan, Uzbekistan, and Turkmenistan, and also adjoins a large part of the Caspian Sea. The terrain of Kazakhstan includes flatlands, steppe, taiga, rock canyons, hills, deltas, snow-capped mountains, and deserts. Kazakhstan has an estimated 18.3 million people . Given its large land area, its population density is among the lowest, at less than 6 people per square kilometre (15 people per sq mi). The capital is Nur-Sultan (until 2019 Astana), where it was moved in 1997 from Almaty, the country's largest city.  The territory of Kazakhstan has historically been inhabited by nomadic groups and empires. In antiquity, the nomadic Scythians have inhabited the land and the Persian Achaemenid Empire expanded towards the southern territory of the modern country. Turkic nomads who trace their ancestry to many Turkic states such as Turkic Khaganate etc have inhabited the country throughout the country's history. In the 13th century, the territory joined the Mongolian Empire under Genghis Khan. By the 16th century, the Kazakh emerged", "label_id": 8023, "label_title": "Kazakhstan", "label_link": "https://en.wikipedia.org/wiki?curid=16642", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Kyrgyzstan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan,", "context_right": ", Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, ", "_context_right": ", Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Kyrgyzstan ( ; \"Kırgızstan\" ()), officially the Kyrgyz Republic (; ), and also known as Kirghizia ( ), is a country in Central Asia. Kyrgyzstan is a landlocked country with mountainous terrain. It is bordered by Kazakhstan to the north, Uzbekistan to the west and southwest, Tajikistan to the southwest and China to the east. Its capital and largest city is Bishkek.  Kyrgyzstan's recorded history spans over 2,000 years, encompassing a variety of cultures and empires. Although geographically isolated by its highly mountainous terrain, which has helped preserve its ancient culture, Kyrgyzstan has been at the crossroads of several great civilizations as part of the Silk Road and other commercial and cultural routes. Though long inhabited by a succession of independent tribes and clans, Kyrgyzstan has periodically fallen under foreign domination and attained sovereignty as a nation-state only after the breakup of the Soviet Union in 1991.  Since independence, the sovereign state has officially been a unitary parliamentary republic, although it continues to endure ethnic conflicts, revolts, economic troubles, transitional governments and political conflict. Kyrgyzstan is a member of the Commonwealth of Independent States, the Eurasian Economic Union, the Collective Security Treaty Organization, the Shanghai Cooperation Organisation, the Organisation of Islamic Cooperation, the Turkic Council, the Turksoy community and the United Nations.  Ethnic Kyrgyz make up the majority of the country's 6 million people, followed by significant minorities of Uzbeks and Russians. Kyrgyz is closely related to other Turkic languages, although Russian remains widely spoken and is an official language, a legacy", "label_id": 95597, "label_title": "Kyrgyzstan", "label_link": "https://en.wikipedia.org/wiki?curid=170131", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Moldova", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan,", "context_right": ", Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, ", "_context_right": ", Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Moldova (, ), officially the Republic of Moldova (), is a landlocked country in Eastern Europe, bordered by Romania to the west and Ukraine to the north, east, and south. The capital city is Chisinau.  Most of the Moldovan territory was a part of the Principality of Moldavia from the 14th century until 1812, when it was ceded to the Russian Empire by the Ottoman Empire (to which Moldavia was a vassal state) and became known as Bessarabia. In 1856, southern Bessarabia was returned to Moldavia, which three years later united with Wallachia to form Romania, but Russian rule was restored over the whole of the region in 1878. During the 1917 Russian Revolution, Bessarabia briefly became an autonomous state within the Russian Republic, known as the Moldavian Democratic Republic. In February 1918, the Moldavian Democratic Republic declared independence and then integrated into Romania later that year following a vote of its assembly. The decision was disputed by Soviet Russia, which in 1924 established, within the Ukrainian SSR, a Moldavian autonomous republic (MASSR) on partially Moldovan-inhabited territories to the east of Bessarabia. In 1940, as a consequence of the Molotov–Ribbentrop Pact, Romania was compelled to cede Bessarabia to the Soviet Union, leading to the creation of the Moldavian Soviet Socialist Republic (Moldavian SSR), which included the greater part of Bessarabia and the westernmost strip of the former MASSR (east of the Dniester River).  On 27 August 1991, as the dissolution of the Soviet Union was underway, the Moldavian SSR declared independence and took", "label_id": 9403, "label_title": "Moldova", "label_link": "https://en.wikipedia.org/wiki?curid=19260", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Russia", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova,", "context_right": ", Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, ", "_context_right": ", Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Tajikistan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia,", "context_right": ", Turkmenistan, Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, ", "_context_right": ", Turkmenistan, Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Tajikistan (, ; ), officially the Republic of Tajikistan (, Jumhuriyi Tojikiston), is a mountainous, landlocked country in Central Asia with an area of and an estimated population of 9,275,828 people. It is bordered by Afghanistan to the south, Uzbekistan to the west, Kyrgyzstan to the north, and China to the east. The traditional homelands of the Tajik people include present-day Tajikistan as well as parts of Afghanistan and Uzbekistan.  The territory that now constitutes Tajikistan was previously home to several ancient cultures, including the city of Sarazm of the Neolithic and the Bronze Age, and was later home to kingdoms ruled by people of different faiths and cultures, including the Oxus civilisation, Andronovo culture, Buddhism, Nestorian Christianity, Zoroastrianism, Manichaeism and Islam. The area has been ruled by numerous empires and dynasties, including the Achaemenid Empire, Sasanian Empire, Hephthalite Empire, Samanid Empire, Mongol Empire, Timurid dynasty, the Khanate of Bukhara, the Russian Empire, and subsequently the Soviet Union. Within the Soviet Union, the country's modern borders were drawn when it was part of Uzbekistan as an autonomous republic before becoming a full-fledged Soviet republic in 1929.  On 9 September 1991, Tajikistan became an independent sovereign nation when the Soviet Union disintegrated. A civil war was fought almost immediately after independence, lasting from 1992 to 1997. Since the end of the war, newly established political stability and foreign aid have allowed the country's economy to grow. Like all other Central Asian neighbouring states, the country, led by President Emomali Rahmon since 1994, has been", "label_id": 14914, "label_title": "Tajikistan", "label_link": "https://en.wikipedia.org/wiki?curid=30108", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Turkmenistan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan,", "context_right": ", Uzbekistan, and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, ", "_context_right": ", Uzbekistan, and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Turkmenistan ( or ; , ), officially the Republic of Turkmenistan (), is a country in Central Asia, bordered by Kazakhstan to the northwest, Uzbekistan to the north and east, Afghanistan to the southeast, Iran to the south and southwest, and the Caspian Sea to the west. Ashgabat is the capital and largest city. The population of the country is 5.6 million, the lowest of the Central Asian republics and one of the most sparsely populated in Asia.  Turkmenistan has been at the crossroads of civilizations for centuries. In medieval times, Merv was one of the great cities of the Islamic world and an important stop on the Silk Road, a caravan route used for trade with China until the mid-15th century. Annexed by the Russian Empire in 1881, Turkmenistan later figured prominently in the anti-Bolshevik movement in Central Asia. In 1925, Turkmenistan became a constituent republic of the Soviet Union, Turkmen Soviet Socialist Republic (Turkmen SSR); it became independent upon the dissolution of the Soviet Union in 1991.  Turkmenistan possesses the world's sixth largest reserves of natural gas resources. Most of the country is covered by the Karakum (Black Sand) Desert. From 1993 to 2017, citizens received government-provided electricity, water and natural gas free of charge.  The sovereign state of Turkmenistan was ruled by President for Life Saparmurat Niyazov (also known as \"Turkmenbashi\") until his death in 2006. Gurbanguly Berdimuhamedow was elected president in 2007. According to Human Rights Watch, \"Turkmenistan remains one of the world’s most repressive countries. The country", "label_id": 106471, "label_title": "Turkmenistan", "label_link": "https://en.wikipedia.org/wiki?curid=198149", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Uzbekistan", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan,", "context_right": ", and Ukraine.", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, ", "_context_right": ", and Ukraine.", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Uzbekistan (, ; ), officially the Republic of Uzbekistan (), is a landlocked country in Central Asia. The sovereign state is a secular, unitary constitutional republic, comprising 12 provinces, one autonomous republic, and a capital city. Uzbekistan is bordered by five landlocked countries: Kazakhstan to the north; Kyrgyzstan to the northeast; Tajikistan to the southeast; Afghanistan to the south; and Turkmenistan to the southwest. Along with Liechtenstein, it is one of the world's only two doubly landlocked countries.  What is now Uzbekistan was in ancient times part of the Iranian-speaking region of Transoxiana and Turan. The first recorded settlers were Eastern Iranian nomads, known as Scythians, who founded kingdoms in Khwarezm (8th–6th centuries BC), Bactria (8th–6th centuries BC), Sogdia (8th–6th centuries BC), Fergana (3rd century BC – 6th century AD), and Margiana (3rd century BC – 6th century AD). The area was incorporated into the Iranian Achaemenid Empire and, after a period of Macedonian Greek rule, was ruled by the Iranian Parthian Empire and later by the Sasanian Empire, until the Arab conquest of Iran in the 7th century. The Muslim conquest in the 7th century converted the majority of the population, including the local ruling classes, into adherents of Islam. During this period, cities such as Samarkand, Khiva and Bukhara began to grow rich from the Silk Road. The local Khwarezmian dynasty, and Central Asia as a whole, were decimated by the Mongol invasion in the 13th century. After the Mongol Conquests, the area became increasingly dominated by Turkic peoples. The city of", "label_id": 15817, "label_title": "Uzbekistan", "label_link": "https://en.wikipedia.org/wiki?curid=31853", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Ukraine", "context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and", "context_right": ".", "_context_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and ", "_context_right": ".", "sentence_left": "This stealer also collects information, such as installed software and system configuration, and sends that information back to the attacker.", "sentence_right": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Turkmenistan", "context_left": "(", "context_right": "and Ukraine are both unofficial members of the organization.", "_context_left": "(", "_context_right": " and Ukraine are both unofficial members of the organization.", "sentence_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_right": "Georgia was a member of the CIS but left the group in 2008.", "label": "Turkmenistan ( or ; , ), officially the Republic of Turkmenistan (), is a country in Central Asia, bordered by Kazakhstan to the northwest, Uzbekistan to the north and east, Afghanistan to the southeast, Iran to the south and southwest, and the Caspian Sea to the west. Ashgabat is the capital and largest city. The population of the country is 5.6 million, the lowest of the Central Asian republics and one of the most sparsely populated in Asia.  Turkmenistan has been at the crossroads of civilizations for centuries. In medieval times, Merv was one of the great cities of the Islamic world and an important stop on the Silk Road, a caravan route used for trade with China until the mid-15th century. Annexed by the Russian Empire in 1881, Turkmenistan later figured prominently in the anti-Bolshevik movement in Central Asia. In 1925, Turkmenistan became a constituent republic of the Soviet Union, Turkmen Soviet Socialist Republic (Turkmen SSR); it became independent upon the dissolution of the Soviet Union in 1991.  Turkmenistan possesses the world's sixth largest reserves of natural gas resources. Most of the country is covered by the Karakum (Black Sand) Desert. From 1993 to 2017, citizens received government-provided electricity, water and natural gas free of charge.  The sovereign state of Turkmenistan was ruled by President for Life Saparmurat Niyazov (also known as \"Turkmenbashi\") until his death in 2006. Gurbanguly Berdimuhamedow was elected president in 2007. According to Human Rights Watch, \"Turkmenistan remains one of the world’s most repressive countries. The country", "label_id": 106471, "label_title": "Turkmenistan", "label_link": "https://en.wikipedia.org/wiki?curid=198149", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Ukraine", "context_left": "(Turkmenistan and", "context_right": "are both unofficial members of the organization.", "_context_left": "(Turkmenistan and ", "_context_right": " are both unofficial members of the organization.", "sentence_left": "Taurus is designed to not execute in countries within the Commonwealth of Independent States (CIS), which includes Azerbaijan, Armenia, Belarus, Georgia, Kazakhstan, Kyrgyzstan, Moldova, Russia, Tajikistan, Turkmenistan, Uzbekistan, and Ukraine.", "sentence_right": "Georgia was a member of the CIS but left the group in 2008.", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Georgia", "context_left": "", "context_right": "was a member of the CIS but left the group in 2008.", "_context_left": "", "_context_right": " was a member of the CIS but left the group in 2008.", "sentence_left": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "sentence_right": "**Infection cycle**", "label": "Georgia (, ), known until 1995 as the Republic of Georgia (), is a country in the Caucasus region of Eurasia. Located at the crossroads of Western Asia and Eastern Europe, it is bounded to the west by the Black Sea, to the north by Russia, to the south by Turkey and Armenia, and to the southeast by Azerbaijan. The capital and largest city is Tbilisi. Georgia covers a territory of , and its 2017 population is about 3.718 million. Georgia is a unitary parliamentary republic, with the government elected through a representative democracy.  During the classical era, several independent kingdoms became established in what is now Georgia, such as Colchis and Iberia. The Georgians officially adopted Christianity in the early 4th century. The Eastern Orthodox Church had enormous importance for spiritual and political unification of early Georgian states. A unified Kingdom of Georgia reached its Golden Age during the reign of King David the Builder and Queen Tamar the Great in the 12th and early 13th centuries. Thereafter, the kingdom declined and eventually disintegrated under hegemony of various regional powers, including the Mongols, the Ottoman Empire, and successive dynasties of Iran. In the late 18th century, the eastern Georgian Kingdom of Kartli-Kakheti forged an alliance with the Russian Empire, which directly annexed the kingdom in 1801 and conquered the western Kingdom of Imereti in 1810. Russian rule over Georgia was eventually acknowledged in various peace treaties with Iran and the Ottomans and the remaining Georgian territories were absorbed by the Russian Empire in a", "label_id": 24934, "label_title": "Georgia (country)", "label_link": "https://en.wikipedia.org/wiki?curid=48768", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "CIS", "context_left": "Georgia was a member of the", "context_right": "but left the group in 2008.", "_context_left": "Georgia was a member of the ", "_context_right": " but left the group in 2008.", "sentence_left": "(Turkmenistan and Ukraine are both unofficial members of the organization.", "sentence_right": "**Infection cycle**", "label": "The Commonwealth of Independent States (CIS) is a regional intergovernmental organization of ten post-Soviet republics in Eurasia formed following the dissolution of the Soviet Union. It has an area of 20,368,759 km² (8,097,484 sq mi) and has an estimated population of 239,796,010. The CIS encourages cooperation in economical, political and military affairs and has certain powers to coordinate trade, finance, lawmaking and security. It has also promoted cooperation on cross-border crime prevention.  The CIS has its origins in the Soviet Union (USSR), which in turn replaced the old Russian Empire in 1917 when it was established by the 1922 Treaty and Declaration of the Creation of the USSR by the Russian SFSR, Byelorussian SSR and Ukrainian SSR. When the USSR began to fall in 1991, the founding republics signed the Belavezha Accords on 8 December 1991, declaring that the Soviet Union would cease to exist and proclaimed the CIS in its place. A few days later the Alma-Ata Protocol was signed, which declared that Soviet Union was dissolved and that the Russian Federation was to be its successor state. The Baltic states (Estonia, Latvia and Lithuania), which regard their membership in the Soviet Union as an illegal occupation, chose not to participate. Georgia withdrew its membership in 2008. Ukraine, which participated as an associate member, ended its participation in CIS statutory bodies on 19 May 2018.  Eight of the nine CIS member states participate in the CIS Free Trade Area. Three organizations are under the overview of the CIS, namely the Collective Security Treaty", "label_id": 18674, "label_title": "Commonwealth of Independent States", "label_link": "https://en.wikipedia.org/wiki?curid=36870", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Github", "context_left": "Once the content is enabled, an AutoOpen() subroutine is called, which will run the malicious Visual Basic for Applications (VBA) macro wherein a PowerShell script is executed via BitsTransfer, downloads three different files of the **Taurus Project** from the", "context_right": "site, then saves them in a Temp folder with predefined names.", "_context_left": "Once the content is enabled, an AutoOpen() subroutine is called, which will run the malicious Visual Basic for Applications (VBA) macro wherein a PowerShell script is executed via BitsTransfer, downloads three different files of the **Taurus Project** from the ", "_context_right": " site, then saves them in a Temp folder with predefined names.", "sentence_left": "Once the document is opened, it prompts the user to enables the macro.", "sentence_right": "![obfuscated macro](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/Obfuscated%20macro%20code.PNG)", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "payload", "context_left": "*Figure 4: The decrypted PowerShell script used to download the", "context_right": ".*", "_context_left": "*Figure 4: The decrypted PowerShell script used to download the ", "_context_right": ".*", "sentence_left": "![Decypted powershell](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/decryptd%20powershell.PNG)", "sentence_right": "Further, these three files get downloaded from Github and dropped in the %Temp% directory.", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Github", "context_left": "Further, these three files get downloaded from", "context_right": "and dropped in the %Temp% directory.", "_context_left": "Further, these three files get downloaded from ", "_context_right": " and dropped in the %Temp% directory.", "sentence_left": "*Figure 4: The decrypted PowerShell script used to download the payload.*", "sentence_right": "The three files are:", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "payload", "context_left": "Here, PowerShell is using the Certutil.exe command to decode the", "context_right": "and execute it on the victim's machine.", "_context_left": "Here, PowerShell is using the Certutil.exe command to decode the ", "_context_right": " and execute it on the victim's machine.", "sentence_left": "3.**wsNcf.com** → saved with the name **“wsNcf.com”** → Taurus Stealer", "sentence_right": "The Twitter handle [@3xp0rt](https://twitter.com/3xp0rtblog/status/1254079067810336768), which exposes documents from a Russian hacking forum, shows some of the claims of the Taurus project.", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Russian", "context_left": "The Twitter handle [@3xp0rt](https://twitter.com/3xp0rtblog/status/1254079067810336768), which exposes documents from a", "context_right": "hacking forum, shows some of the claims of the Taurus project.", "_context_left": "The Twitter handle [@3xp0rt](https://twitter.com/3xp0rtblog/status/1254079067810336768), which exposes documents from a ", "_context_right": " hacking forum, shows some of the claims of the Taurus project.", "sentence_left": "Here, PowerShell is using the Certutil.exe command to decode the payload and execute it on the victim's machine.", "sentence_right": "![Tauras Project claim about stealing ability of malware](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/taurus%20project%20message.PNG)", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "![Tauras Project claim about stealing ability of", "context_right": "](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/taurus%20project%20message.PNG)", "_context_left": "![Tauras Project claim about stealing ability of ", "_context_right": "](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/taurus%20project%20message.PNG)", "sentence_left": "The Twitter handle [@3xp0rt](https://twitter.com/3xp0rtblog/status/1254079067810336768), which exposes documents from a Russian hacking forum, shows some of the claims of the Taurus project.", "sentence_right": "*Figure 5: The Taurus project claims to have the stealing ability of malware.*", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "*Figure 5: The Taurus project claims to have the stealing ability of", "context_right": ".*", "_context_left": "*Figure 5: The Taurus project claims to have the stealing ability of ", "_context_right": ".*", "sentence_left": "![Tauras Project claim about stealing ability of malware](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/taurus%20project%20message.PNG)", "sentence_right": "The author claims that Taurus has the following stealing capabilities:", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Microsoft", "context_left": "* Cookies and passwords from", "context_right": "Edge browsers.", "_context_left": "* Cookies and passwords from ", "_context_right": " Edge browsers.", "sentence_left": "* Stealing cookies, Auto-form details, browsing history, and credit card information from Chromium- and Gecko-based browsers.", "sentence_right": "* Credential stealing of some cryptocurrency wallets, including Electrum, MultiBit, Ethereum, Jaxx Liberty, Bytecoin, Atomic, and Exodus", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Telegram", "context_left": "* Stealing session files from applications, including Discord, Steam,", "context_right": ", and Authy", "_context_left": "* Stealing session files from applications, including Discord, Steam, ", "_context_right": ", and Authy", "sentence_left": "* Stealing credential of FTP clients, including FileZilla, WinFTP, and WinSCP", "sentence_right": "* Stealing account information of the Battle.Net service", "label": "Telegram is a cloud-based instant messaging and voice over IP service. Telegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.  Telegram's client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. The service also provides APIs to independent developers. In March 2018, Telegram stated that it had 200 million monthly active users.  Messages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted \"secret\" chats between two online users, yet not for groups or channels.  Telegram's security model has received notable criticism by cryptography experts. They criticized the general security model of permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. Pavel Durov has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device. Cryptography experts have furthermore criticized Telegram's use of a custom-designed encryption protocol that has not been proven reliable and secure.", "label_id": 4365920, "label_title": "Telegram (software)", "label_link": "https://en.wikipedia.org/wiki?curid=41501305", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Discord", "context_left": "* Stealing session files from applications, including", "context_right": ", Steam, Telegram, and Authy", "_context_left": "* Stealing session files from applications, including ", "_context_right": ", Steam, Telegram, and Authy", "sentence_left": "* Stealing credential of FTP clients, including FileZilla, WinFTP, and WinSCP", "sentence_right": "* Stealing account information of the Battle.Net service", "label": "Discord is a proprietary freeware VoIP application and digital distribution platform—designed initially for the video gaming community—that specializes in text, image, video and audio communication between users in a chat channel. Discord runs on Windows, macOS, Android, iOS, Linux, and in web browsers. , there are over 250 million unique users of the software.", "label_id": 4992747, "label_title": "Discord (software)", "label_link": "https://en.wikipedia.org/wiki?curid=49271581", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "payload", "context_left": "**Technical analysis of the", "context_right": "**", "_context_left": "**Technical analysis of the ", "_context_right": "**", "sentence_left": "*Figure 8: The attacker can update the configuration of Taurus in the [dashboard](https://twitter.com/3xp0rtblog/status/1254079343581675525/photo/2).*", "sentence_right": "Once PowerShell downloads the three different files from the GitHub repository, it uses the utility “Certutil.exe” to decode the payload.", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "GitHub", "context_left": "Once PowerShell downloads the three different files from the", "context_right": "repository, it uses the utility “Certutil.exe” to decode the payload.", "_context_left": "Once PowerShell downloads the three different files from the ", "_context_right": " repository, it uses the utility “Certutil.exe” to decode the payload.", "sentence_left": "**Technical analysis of the payload**", "sentence_right": "Out of three downloaded files, the first one is an AutoIT interpreter that is used to run the decoded AutoIT script.", "label": "GitHub is an American company that provides hosting for software development version control using Git. It is a subsidiary of Microsoft, which acquired the company in 2018 for $7.5 billion. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project.  GitHub offers plans for free, professional, and enterprise accounts. Free GitHub accounts are commonly used to host open source projects. As of January 2019, GitHub offers unlimited private repositories to all plans, including free accounts. As of May 2019, GitHub reports having over 37 million users and more than 100 million repositories (including at least 28 million public repositories), making it the largest host of source code in the world.", "label_id": 2294705, "label_title": "GitHub", "label_link": "https://en.wikipedia.org/wiki?curid=18545292", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "payload", "context_left": "Once PowerShell downloads the three different files from the GitHub repository, it uses the utility “Certutil.exe” to decode the", "context_right": ".", "_context_left": "Once PowerShell downloads the three different files from the GitHub repository, it uses the utility “Certutil.exe” to decode the ", "_context_right": ".", "sentence_left": "**Technical analysis of the payload**", "sentence_right": "Out of three downloaded files, the first one is an AutoIT interpreter that is used to run the decoded AutoIT script.", "label": "Payload is the carrying capacity of an aircraft or launch vehicle, usually measured in terms of weight. Depending on the nature of the flight or mission, the payload of a vehicle may include cargo, passengers, flight crew, munitions, scientific instruments or experiments, or other equipment. Extra fuel, when optionally carried, is also considered part of the payload. In a commercial context (i.e., an airline or air freight carrier), payload may refer only to revenue-generating cargo or paying passengers.  For a rocket, the payload can be a satellite, space probe, or spacecraft carrying humans, animals, or cargo. For a ballistic missile, the payload is one or more warheads and related systems; the total weight of these systems is referred to as the throw-weight.  The fraction of payload to the total liftoff weight of the air or spacecraft is known as the \"payload fraction\". When the weight of the payload and fuel are considered together, it is known as the \"useful load fraction\". In spacecraft, \"mass fraction\" is normally used, which is the ratio of payload to everything else, including the rocket structure.", "label_id": 21301, "label_title": "Payload", "label_link": "https://en.wikipedia.org/wiki?curid=41495", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "We have successfully been able to see the further activity of the malicious program, which is the actual purpose of this", "context_right": "**—**stealing.", "_context_left": "We have successfully been able to see the further activity of the malicious program, which is the actual purpose of this ", "_context_right": "**—**stealing.", "sentence_left": "*Figure 13: Storing config into memory.*", "sentence_right": "Figure 14 shows the system information being fetched by the stealer.", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "Interesting part is that", "context_right": "allocates a memory space for the Zip file and embeds the Zip file directly to the request data.", "_context_left": "Interesting part is that ", "_context_right": " allocates a memory space for the Zip file and embeds the Zip file directly to the request data.", "sentence_left": "While disassembling the code, we figured out that all the stolen data is being sent as a Zip file.", "sentence_right": "![Zipped all the stolen data](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/zip%20file%20contains%20all%20stealed%20data.PNG)", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Zscaler", "context_left": "We have analyzed the sample in the", "context_right": "Cloud Sandbox and successfully detected the malware.", "_context_left": "We have analyzed the sample in the ", "_context_right": " Cloud Sandbox and successfully detected the malware.", "sentence_left": "**Cloud Sandbox detection**", "sentence_right": "![Cloud Sandbox detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/sandbox%20activity.PNG)", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "We have analyzed the sample in the Zscaler Cloud Sandbox and successfully detected the", "context_right": ".", "_context_left": "We have analyzed the sample in the Zscaler Cloud Sandbox and successfully detected the ", "_context_right": ".", "sentence_left": "**Cloud Sandbox detection**", "sentence_right": "![Cloud Sandbox detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/sandbox%20activity.PNG)", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Zscaler", "context_left": "*Figure 17: The", "context_right": "Cloud Sandbox successfully detected the malware.*", "_context_left": "*Figure 17: The ", "_context_right": " Cloud Sandbox successfully detected the malware.*", "sentence_left": "![Cloud Sandbox detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/sandbox%20activity.PNG)", "sentence_right": "**Conclusion**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "*Figure 17: The Zscaler Cloud Sandbox successfully detected the", "context_right": ".*", "_context_left": "*Figure 17: The Zscaler Cloud Sandbox successfully detected the ", "_context_right": ".*", "sentence_left": "![Cloud Sandbox detection](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Taurus%20Project/sandbox%20activity.PNG)", "sentence_right": "**Conclusion**", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "Zscaler", "context_left": "We are actively monitoring for new threats in the", "context_right": "cloud to protect our customers.", "_context_left": "We are actively monitoring for new threats in the ", "_context_right": " cloud to protect our customers.", "sentence_left": "**Conclusion**", "sentence_right": "We have added details of this malware to our threat library.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}
{"mention": "malware", "context_left": "We have added details of this", "context_right": "to our threat library.", "_context_left": "We have added details of this ", "_context_right": " to our threat library.", "sentence_left": "We are actively monitoring for new threats in the Zscaler cloud to protect our customers.", "sentence_right": "VBA - <https://threatlibrary.zscaler.com/threats/3e4e094a-66e1-407a-8b42-7a683a54bfb1/>", "label": "Malware (a portmanteau for malicious software) is any software intentionally designed to cause damage to a computer, server, client, or computer network. Malware does the damage after it is implanted or introduced in some way into a target's computer and can take the form of executable code, scripts, active content, and other software. The code is described as computer viruses, worms, Trojan horses, ransomware, spyware, adware, and scareware, among other terms. Malware has a malicious intent, acting against the interest of the computer user—and so does not include software that causes unintentional harm due to some deficiency, which is typically described as a software bug.  Programs officially supplied by companies can be considered malware if they secretly act against the interests of the computer user. For example, at one point Sony music Compact discs silently installed a rootkit on purchasers' computers with the intention of preventing illicit copying; but which also reported on users' listening habits, and unintentionally created extra security vulnerabilities.  One strategy for protecting against malware is to prevent the harmful software from gaining access to the target computer. For this reason, antivirus software, firewalls and other strategies are used to help protect against the introduction of malware, in addition to checking for the presence of malware and malicious activity and recovering from attacks.", "label_id": 10247, "label_title": "Malware", "label_link": "https://en.wikipedia.org/wiki?curid=20901", "entity_class": "CE", "entity_type": "CON", "document": "zscaler_2020-06-26_taurus-new-stealer-town"}