{"mention": "Zscaler", "context_left": "Recently,", "context_right": "ThreatlabZ  received a suspicious file from one of our customers, which was named “OrderDetails.zip”.", "_context_left": "Recently, ", "_context_right": " ThreatlabZ  received a suspicious file from one of our customers, which was named “OrderDetails.zip”.", "sentence_left": "**Introduction:**", "sentence_right": "After extracting the executable file from the archive I have performed a virustotal scan  to get some information about the file.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2013-12-29_story-trojan-dropper-i"}
{"mention": "Adobe", "context_left": "We knew from the beginning that this was not a proper PDF file and would not therefore work with", "context_right": "Reader.", "_context_left": "We knew from the beginning that this was not a proper PDF file and would not therefore work with ", "_context_right": " Reader.", "sentence_left": "When doing so, I was greeted with a crash report where Windows was telling me that “Adobe.exe” had crashed during execution.", "sentence_right": "Let’s now look to determine where Adobe.exe exists in the file system.", "label": "Adobe Inc. ( ) is an American multinational computer software company headquartered in San Jose, California. It has historically focused upon the creation of multimedia and creativity software products, with a more recent foray towards digital marketing software. Adobe is best known for its Adobe Flash web software ecosystem, Photoshop image editing software, Acrobat Reader, the Portable Document Format (PDF), and Adobe Creative Suite, as well as its successor Adobe Creative Cloud.  Adobe was founded in December 1982 by John Warnock and Charles Geschke, who established the company after leaving Xerox PARC in order to develop and sell the PostScript page description language. In 1985, Apple Computer licensed PostScript for use in its LaserWriter printers, which helped spark the desktop publishing revolution.  , Adobe has more than 21,000 employees worldwide, about 40% of whom work in San Jose. Adobe also has major development operations in Newton, Massachusetts; New York City, New York; Minneapolis, Minnesota; Lehi, Utah; Seattle, Washington; and San Francisco, California in the United States. It also has major development operations in Noida and Bangalore in India.", "label_id": 738, "label_title": "Adobe Inc.", "label_link": "https://en.wikipedia.org/wiki?curid=1955", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2013-12-29_story-trojan-dropper-i"}