{"mention": "Zscaler", "context_left": "The", "context_right": "ThreatLabZ research team recently spotted a common crypter being used in the recent Emotet, Qbot, and Dridex campaigns.", "_context_left": "The ", "_context_right": " ThreatLabZ research team recently spotted a common crypter being used in the recent Emotet, Qbot, and Dridex campaigns.", "sentence_left": "A crypter is software that can encrypt, obfuscate, and manipulate malware to make it harder to detect by security programs.", "sentence_right": "This same crypter was observed in some of the [Ursnif and BitPaymer](https://blog.trendmicro.com/trendlabs-security-intelligence/ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/) campaigns as well.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-02-14_demystifying-crypter-used-emotet-qbot"}
{"mention": "FBI", "context_left": "Dridex remains active in the wild even after the", "context_right": "’s [takedown attempt](/blogs/research/dridex-activity-continues) in 2015.", "_context_left": "Dridex remains active in the wild even after the ", "_context_right": "’s [takedown attempt](/blogs/research/dridex-activity-continues) in 2015.", "sentence_left": "Dridex is a banking Trojan that evolved from the Zeus Trojan family.", "sentence_right": "Qbot can allow remote access to a victim’s system, steal information, and upload this stolen information to the attacker’s remote server.", "label": "The Federal Bureau of Investigation (FBI) is the domestic intelligence and security service of the United States and its principal federal law enforcement agency. Operating under the jurisdiction of the United States Department of Justice, the FBI is also a member of the U.S. Intelligence Community and reports to both the Attorney General and the Director of National Intelligence. A leading U.S. counter-terrorism, counterintelligence, and criminal investigative organization, the FBI has jurisdiction over violations of more than 200 categories of federal crimes.  Although many of the FBI's functions are unique, its activities in support of national security are comparable to those of the British MI5 and the Russian FSB. Unlike the Central Intelligence Agency (CIA), which has no law enforcement authority and is focused on intelligence collection abroad, the FBI is primarily a domestic agency, maintaining 56 field offices in major cities throughout the United States, and more than 400 resident agencies in smaller cities and areas across the nation. At an FBI field office, a senior-level FBI officer concurrently serves as the representative of the Director of National Intelligence.  Despite its domestic focus, the FBI also maintains a significant international footprint, operating 60 Legal Attache (LEGAT) offices and 15 sub-offices in U.S. embassies and consulates across the globe. These foreign offices exist primarily for the purpose of coordination with foreign security services and do not usually conduct unilateral operations in the host countries. The FBI can and does at times carry out secret activities overseas, just as the CIA has a limited", "label_id": 5289, "label_title": "Federal Bureau of Investigation", "label_link": "https://en.wikipedia.org/wiki?curid=11127", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-02-14_demystifying-crypter-used-emotet-qbot"}
{"mention": "MS", "context_left": "The 5th stage binary is the Emotet executable file that is downloaded via malicious links in MalSpams or malicious macros in", "context_right": "Office documents.", "_context_left": "The 5th stage binary is the Emotet executable file that is downloaded via malicious links in MalSpams or malicious macros in ", "_context_right": " Office documents.", "sentence_left": "### **Stage 5:**", "sentence_right": "Our goal in stage 5 is to reach stage 4 to obtain the encrypted custom loader binary.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2019-02-14_demystifying-crypter-used-emotet-qbot"}