{"mention": "Ukraine", "context_left": "As we learn more, we will continue to update our blog. * Businesses from several countries, including", "context_right": ", India, France, Russia, and Spain, have been impacted by this ransomware outbreak * The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "_context_left": "* Businesses from several countries, including ", "_context_right": ", India, France, Russia, and Spain, have been impacted by this ransomware outbreak", "sentence_left": "As we learn more, we will continue to update our blog.", "sentence_right": "* The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "label": "Ukraine (; ), sometimes called the Ukraine, is a country in Eastern Europe. Excluding Crimea, Ukraine has a population of about 42.5 million, making it the 32nd most populous country in the world. Its capital and largest city is Kiev. Ukrainian is the official language and its alphabet is Cyrillic. The dominant religions in the country are Eastern Orthodoxy and Greek Catholicism. Ukraine is currently in a territorial dispute with Russia over the Crimean Peninsula, which Russia annexed in 2014. Including Crimea, Ukraine has an area of , making it the largest country entirely within Europe and the 46th largest country in the world.  The territory of modern Ukraine has been inhabited since 32,000 BC. During the Middle Ages, the area was a key centre of East Slavic culture, with the powerful state of Kievan Rus' forming the basis of Ukrainian identity. Following its fragmentation in the 13th century, the territory was contested, ruled and divided by a variety of powers, including Lithuania, Poland, Austria-Hungary, the Ottoman Empire and Russia. A Cossack republic emerged and prospered during the 17th and 18th centuries, but its territory was eventually split between Poland and the Russian Empire, and finally merged fully into the Russian-dominated Soviet Union in the late 1940s as the Ukrainian Soviet Socialist Republic. In 1991, Ukraine gained its independence from the Soviet Union in the aftermath of its dissolution at the end of the Cold War. Before its independence, Ukraine was typically referred to in English as \"The Ukraine\", but most sources have since", "label_id": 15756, "label_title": "Ukraine", "label_link": "https://en.wikipedia.org/wiki?curid=31750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "India", "context_left": "As we learn more, we will continue to update our blog. * Businesses from several countries, including Ukraine,", "context_right": ", France, Russia, and Spain, have been impacted by this ransomware outbreak * The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "_context_left": "* Businesses from several countries, including Ukraine, ", "_context_right": ", France, Russia, and Spain, have been impacted by this ransomware outbreak", "sentence_left": "As we learn more, we will continue to update our blog.", "sentence_right": "* The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "label": "India (official name: the Republic of India; Hindi: ) is a country in South Asia. It is the seventh-largest country by area, the second-most populous country, and the most populous democracy in the world. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand and Indonesia.  The Indian subcontinent was home to the Indus Valley Civilisation of the bronze age. In India's Iron Age, the oldest scriptures of Hinduism were composed, social stratification based on caste emerged, and Buddhism and Jainism arose. Political consolidations took place under the Maurya and Gupta Empires; the peninsular Middle Kingdoms influenced the cultures of Southeast Asia. In India's medieval era, Judaism, Zoroastrianism, Christianity, and Islam arrived, and Sikhism emerged, adding to a diverse culture. North India fell to the Delhi Sultanate; south India was united under the Vijayanagara Empire. In the early modern era, the expansive Mughal Empire was followed by East India Company rule. India's modern age was marked by British Crown rule and a nationalist movement which, under Mahatma Gandhi, was noted for nonviolence and led to India's independence in 1947.  Economic liberalisation, begun in 1991, has caused India to become a fast growing", "label_id": 6938, "label_title": "India", "label_link": "https://en.wikipedia.org/wiki?curid=14533", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "France", "context_left": "As we learn more, we will continue to update our blog. * Businesses from several countries, including Ukraine, India,", "context_right": ", Russia, and Spain, have been impacted by this ransomware outbreak * The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "_context_left": "* Businesses from several countries, including Ukraine, India, ", "_context_right": ", Russia, and Spain, have been impacted by this ransomware outbreak", "sentence_left": "As we learn more, we will continue to update our blog.", "sentence_right": "* The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "label": "France (), officially the French Republic (, ), is a sovereign state whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of and a total population of 67.02 million (). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice.  During the Iron Age, what is now metropolitan France was inhabited by the Gauls, a Celtic people. Rome annexed the area in 51 BC, holding it until the arrival of Germanic Franks in 476, who formed the Kingdom of Francia. The Treaty of Verdun of 843 partitioned Francia into East Francia, Middle Francia and West Francia. West Francia, which became the Kingdom of France in 987, emerged as a major European power in the Late Middle Ages, following its victory in the Hundred Years' War (1337–1453). During the Renaissance, French culture flourished and a global colonial empire was established, which by", "label_id": 1102670, "label_title": "France", "label_link": "https://en.wikipedia.org/wiki?curid=5843419", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Russia", "context_left": "As we learn more, we will continue to update our blog. * Businesses from several countries, including Ukraine, India, France,", "context_right": ", and Spain, have been impacted by this ransomware outbreak * The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "_context_left": "* Businesses from several countries, including Ukraine, India, France, ", "_context_right": ", and Spain, have been impacted by this ransomware outbreak", "sentence_left": "As we learn more, we will continue to update our blog.", "sentence_right": "* The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "label": "Russia (), or the Russian Federation (), is a transcontinental country in Eastern Europe and North Asia. At , Russia is by a considerable margin the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area, and the ninth most populous, with about 146.79 million people , including Crimea. About 77% of the population live in the western, European part of the country. Russia's capital, Moscow, is one of the largest cities in the world and the second largest city in Europe; other major cities include Saint Petersburg, Novosibirsk, Yekaterinburg and Nizhny Novgorod. Extending across the entirety of Northern Asia and much of Eastern Europe, Russia spans eleven time zones and incorporates a wide range of environments and landforms. From northwest to southeast, Russia shares land borders with Norway, Finland, Estonia, Latvia, Lithuania and Poland (both with Kaliningrad Oblast), Belarus, Ukraine, Georgia, Azerbaijan, Kazakhstan, China, Mongolia and North Korea. It shares maritime borders with Japan by the Sea of Okhotsk and the U.S. state of Alaska across the Bering Strait. However, Russia recognises two more countries that border it, Abkhazia and South Ossetia, both of which are internationally recognized as parts of Georgia.  The East Slavs emerged as a recognizable group in Europe between the 3rd and 8th centuries AD. Founded and ruled by a Varangian warrior elite and their descendants, the medieval state of Rus arose in the 9th century. In 988 it adopted Orthodox Christianity from the Byzantine Empire, beginning the synthesis of Byzantine and Slavic", "label_id": 12594, "label_title": "Russia", "label_link": "https://en.wikipedia.org/wiki?curid=25391", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Spain", "context_left": "As we learn more, we will continue to update our blog. * Businesses from several countries, including Ukraine, India, France, Russia, and", "context_right": ", have been impacted by this ransomware outbreak * The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "_context_left": "* Businesses from several countries, including Ukraine, India, France, Russia, and ", "_context_right": ", have been impacted by this ransomware outbreak", "sentence_left": "As we learn more, we will continue to update our blog.", "sentence_right": "* The malware family involved is purported to be a variant of the Petya ransomware family; however, from our analysis up to this point, we are seeing very little resemblance between this code and previous Petya variants", "label": "Spain ( ), officially the Kingdom of Spain (), is a country mostly located in Europe. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Penon de Velez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean.  With an area of , Spain is the largest country in Southern Europe, the second largest country in Western Europe and the European Union, and the fourth largest country in the European continent. By population (about 47 million), Spain is the sixth largest in Europe and the fifth in the European Union. Spain's capital and largest city is Madrid; other major urban areas include Barcelona, Valencia, Seville, Malaga and Bilbao.  Modern humans first arrived in the Iberian Peninsula around 35,000 years ago. Iberian cultures along with ancient Phoenician, Greek, Celtic and Carthaginian settlements developed on the peninsula until it came under Roman rule around 200 BCE, after which the region was named \"Hispania\", based on the", "label_id": 13191, "label_title": "Spain", "label_link": "https://en.wikipedia.org/wiki?curid=26667", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Microsoft", "context_left": "**Protective Actions** * Apply", "context_right": "Windows security update[MS17-010](https://technet.microsoft.com/en-us/library/security/ms17-010.aspx) and [CVE-2017-0199](https://nvd.nist.gov/vuln/detail/CVE-2017-0199) * Block legacy protocols like SMBv1 on your local network", "_context_left": "* Apply ", "_context_right": " Windows security update[MS17-010](https://technet.microsoft.com/en-us/library/security/ms17-010.aspx) and [CVE-2017-0199](https://nvd.nist.gov/vuln/detail/CVE-2017-0199)", "sentence_left": "**Protective Actions**", "sentence_right": "* Block legacy protocols like SMBv1 on your local network", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "* Block connection to ports 135, 139, and 445 on your firewall **How", "context_right": "Can Help with Preventative Measures** Zscaler had generic signature coverage on one of the payloads involved and added multiple signatures and indicators for blocking other known payloads related to this attack.", "_context_left": "**How ", "_context_right": " Can Help with Preventative Measures**", "sentence_left": "* Block connection to ports 135, 139, and 445 on your firewall", "sentence_right": "Zscaler had generic signature coverage on one of the payloads involved and added multiple signatures and indicators for blocking other known payloads related to this attack.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "**How Zscaler Can Help with Preventative Measures**", "context_right": "had generic signature coverage on one of the payloads involved and added multiple signatures and indicators for blocking other known payloads related to this attack. **Advanced Threat Signatures:**", "_context_left": "", "_context_right": " had generic signature coverage on one of the payloads involved and added multiple signatures and indicators for blocking other known payloads related to this attack.", "sentence_left": "**How Zscaler Can Help with Preventative Measures**", "sentence_right": "**Advanced Threat Signatures:**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "* W32/Ransom.Petya.J!Eldorado [**", "context_right": "Cloud Sandbox**](/products/sandboxing) provides the best line of proactive defense against these evolving ransomware strains. A Cloud Sandbox report for a sample payload run is shown below:", "_context_left": "[**", "_context_right": " Cloud Sandbox**](/products/sandboxing) provides the best line of proactive defense against these evolving ransomware strains.", "sentence_left": "* W32/Ransom.Petya.J!Eldorado", "sentence_right": "A Cloud Sandbox report for a sample payload run is shown below:", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Petya_sandboxreport_2.png) *Figure 1:", "context_right": "Cloud Sandbox report of Petya ransomware* **Initial Delivery Vector**", "_context_left": "*Figure 1: ", "_context_right": " Cloud Sandbox report of Petya ransomware*", "sentence_left": "![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/Petya_sandboxreport_2.png)", "sentence_right": "**Initial Delivery Vector**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "This attack shows the importance of a multilayered security approach, and it highlights the gap that exists in applying security patches and securing internal systems (via network segmentation).", "context_right": "ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers. **Indicators of Compromise**", "_context_left": "", "_context_right": " ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for Zscaler customers.", "sentence_left": "This attack shows the importance of a multilayered security approach, and it highlights the gap that exists in applying security patches and securing internal systems (via network segmentation).", "sentence_right": "**Indicators of Compromise**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}
{"mention": "Zscaler", "context_left": "This attack shows the importance of a multilayered security approach, and it highlights the gap that exists in applying security patches and securing internal systems (via network segmentation). Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for", "context_right": "customers. **Indicators of Compromise**", "_context_left": "Zscaler ThreatLabZ is actively monitoring this threat and will continue to ensure coverage for ", "_context_right": " customers.", "sentence_left": "This attack shows the importance of a multilayered security approach, and it highlights the gap that exists in applying security patches and securing internal systems (via network segmentation).", "sentence_right": "**Indicators of Compromise**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2017-06-27_update-petya-ransomware-outbreak"}