{"mention": "Google", "context_left": "Yesterday, researchers from", "context_right": "and Codenomicon made quite a splash when they revealed details of a vulnerability in OpenSSL's implementation of the heartbeat extension, which they have affectionately dubbed *heartbleed*.", "_context_left": "Yesterday, researchers from ", "_context_right": " and Codenomicon made quite a splash when they revealed details of a vulnerability in OpenSSL's implementation of the heartbeat extension, which they have affectionately dubbed *heartbleed*.", "sentence_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/-vXjReoLzsNk/U0TTbYxaM2I/AAAAAAAAB9U/xyOMcDl6G6A/s1600/Heartbleed-Logo.jpg)](/sites/default/files/images/blogs/-vXjReoLzsNk/U0TTbYxaM2I/AAAAAAAAB9U/xyOMcDl6G6A/s1600/Heartbleed-Logo.jpg)", "sentence_right": "In short, heartbleed represents a classic example of a simple programming oversight - not properly validating the length of a message, which leads to a serious memory leak.", "label": "Google LLC is an American multinational technology company that specializes in Internet-related services and products, which include online advertising technologies, search engine, cloud computing, software, and hardware. It is considered one of the Big Four technology companies, alongside Amazon, Apple and Facebook.  Google was founded in 1998 by Larry Page and Sergey Brin while they were Ph.D. students at Stanford University in California. Together they own about 14 percent of its shares and control 56 percent of the stockholder voting power through supervoting stock. They incorporated Google as a privately held company on September 4, 1998. An initial public offering (IPO) took place on August 19, 2004, and Google moved to its headquarters in Mountain View, California, nicknamed the Googleplex. In August 2015, Google announced plans to reorganize its various interests as a conglomerate called Alphabet Inc. Google is Alphabet's leading subsidiary and will continue to be the umbrella company for Alphabet's Internet interests. Sundar Pichai was appointed CEO of Google, replacing Larry Page who became the CEO of Alphabet.  The company's rapid growth since incorporation has triggered a chain of products, acquisitions, and partnerships beyond Google's core search engine (Google Search). It offers services designed for work and productivity (Google Docs, Google Sheets, and Google Slides), email (Gmail/Inbox), scheduling and time management (Google Calendar), cloud storage (Google Drive), instant messaging and video chat (Google Allo, Duo, Hangouts), language translation (Google Translate), mapping and navigation (Google Maps, Waze, Google Earth, Street View), video sharing (YouTube), note-taking (Google Keep), and photo organizing and editing", "label_id": 348100, "label_title": "Google", "label_link": "https://en.wikipedia.org/wiki?curid=1092923", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-04-08_why-you-should-care-about"}
{"mention": "Codenomicon", "context_left": "Yesterday, researchers from Google and", "context_right": "made quite a splash when they revealed details of a vulnerability in OpenSSL's implementation of the heartbeat extension, which they have affectionately dubbed *heartbleed*.", "_context_left": "Yesterday, researchers from Google and ", "_context_right": " made quite a splash when they revealed details of a vulnerability in OpenSSL's implementation of the heartbeat extension, which they have affectionately dubbed *heartbleed*.", "sentence_left": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/-vXjReoLzsNk/U0TTbYxaM2I/AAAAAAAAB9U/xyOMcDl6G6A/s1600/Heartbleed-Logo.jpg)](/sites/default/files/images/blogs/-vXjReoLzsNk/U0TTbYxaM2I/AAAAAAAAB9U/xyOMcDl6G6A/s1600/Heartbleed-Logo.jpg)", "sentence_right": "In short, heartbleed represents a classic example of a simple programming oversight - not properly validating the length of a message, which leads to a serious memory leak.", "label": "Synopsys is an American electronic design automation company that focuses on silicon design and verification, silicon intellectual property and software security and quality. Products include logic synthesis, behavioral synthesis, place and route, static timing analysis, formal verification, hardware description language (SystemC, SystemVerilog/Verilog, VHDL) simulators, and transistor-level circuit simulation. The simulators include development and debugging environments that assist in the design of the logic for chips and computer systems. In recent years, Synopsys has expanded its products and services to include application security testing. Their technology is present in self-driving cars, artificial intelligence, and internet of things consumer products.", "label_id": 5903527, "label_title": "Codenomicon", "label_link": "https://en.wikipedia.org/wiki?curid=12475073", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2014-04-08_why-you-should-care-about"}