{"mention": "Zscaler", "context_left": "April 07, 2020 Recently, the [", "context_right": "ThreatLabZ team](/threatlabz) saw the start of a campaign featuring a new multistage payload distribution technique for the well-known banking Trojan named **Ursnif** (aka **Gozi** aka **Dreambot**)**.** The malware has been around for a long time and remains active leveraging new distribution techniques.", "_context_left": "Recently, the [", "_context_right": " ThreatLabZ team](/threatlabz) saw the start of a campaign featuring a new multistage payload distribution technique for the well-known banking Trojan named **Ursnif** (aka **Gozi** aka **Dreambot**)**.**", "sentence_left": "April 07, 2020", "sentence_right": "The malware has been around for a long time and remains active leveraging new distribution techniques.", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-07_new-ursnif-campaign-shift-powershell"}
{"mention": "Microsoft", "context_left": "**A brief description of mshta** Mshta.exe is a utility that executes", "context_right": "HTML Applications (HTAs). HTAs are stand-alone applications that execute using the same models and technologies of Internet Explorer, but outside of the browser.", "_context_left": "Mshta.exe is a utility that executes ", "_context_right": " HTML Applications (HTAs).", "sentence_left": "**A brief description of mshta**", "sentence_right": "HTAs are stand-alone applications that execute using the same models and technologies of Internet Explorer, but outside of the browser.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-07_new-ursnif-campaign-shift-powershell"}
{"mention": "Zscaler", "context_left": "It appears to be back in a form designed to leave fewer footprints and avoid detection while trying to steal victim's data. The", "context_right": "ThreatLabZ team will continue to observe this new version of Ursnif to help keep our customers safe and to monitor whether it returns in another form. ### **Newly registered campaign domains**", "_context_left": "The ", "_context_right": " ThreatLabZ team will continue to observe this new version of Ursnif to help keep our customers safe and to monitor whether it returns in another form.", "sentence_left": "It appears to be back in a form designed to leave fewer footprints and avoid detection while trying to steal victim's data.", "sentence_right": "### **Newly registered campaign domains**", "label": "Zscaler ((US English)) is a cloud security company, with headquarters in San Jose, California. It offers a platform for businesses that move their data to the cloud, with employees who work remotely.", "label_id": 5903536, "label_title": "Zscaler", "label_link": "https://en.wikipedia.org/wiki?curid=65138718", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2020-04-07_new-ursnif-campaign-shift-powershell"}