{"mention": "United States", "context_left": "| Several sites are phishing users with the promise of illegally obtained content | The bulk of these attacks are hosted in the", "context_right": ". [![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/-f2lDi4N37Vw/VYxnS9-sMfI/AAAAAAAABJI/C0wJ6YCyvvU/s400/hosting_countries.png)](/sites/default/files/images/blogs/-f2lDi4N37Vw/VYxnS9-sMfI/AAAAAAAABJI/C0wJ6YCyvvU/s400/hosting_countries.png)", "_context_left": "The bulk of these attacks are hosted in the ", "_context_right": ".", "sentence_left": "| Several sites are phishing users with the promise of illegally obtained content |", "sentence_right": "[![](/cdn-cgi/image/format=auto/sites/default/files/images/blogs/-f2lDi4N37Vw/VYxnS9-sMfI/AAAAAAAABJI/C0wJ6YCyvvU/s400/hosting_countries.png)](/sites/default/files/images/blogs/-f2lDi4N37Vw/VYxnS9-sMfI/AAAAAAAABJI/C0wJ6YCyvvU/s400/hosting_countries.png)", "label": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country comprising 50 states, a federal district, five major self-governing territories, and various possessions. At , the United States is the world's third or fourth largest country by total area and is slightly smaller than the entire continent of Europe's . With a population of more than 327 million people, the U.S. is the third most populous country. Most of the country is located contiguously in North America between Canada and Mexico.  Paleo-Indians migrated from Siberia to the North American mainland at least 12,000 years ago. European colonization began in the 16th century. The United States emerged from the thirteen British colonies established along the East Coast. Following the French and Indian War, numerous disputes between Great Britain and the colonies led to the American Revolution, which began in 1775, and the subsequent Declaration of Independence in 1776. The war ended in 1783 with the United States becoming the first country to gain independence from a European power. The current constitution was adopted in 1788, with the first ten amendments, collectively named the Bill of Rights, being ratified in 1791 to guarantee many fundamental civil liberties. The United States expanded across North America throughout the 19th century until it spanned the continent by 1848. During the second half of the 19th century, the Civil War led to the abolition of slavery. The United States emerged from as a global superpower and a permanent member of the", "label_id": 783851, "label_title": "United States", "label_link": "https://en.wikipedia.org/wiki?curid=3434750", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2015-06-26_potentially-painful-programs-promising-pirated"}