{"mention": "EU Banking", "context_left": "You may recognize this threat from research done by WeLiveSecurity earlier this year in regards to this threat [targeting", "context_right": "sites](http://www.welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/).", "_context_left": "You may recognize this threat from research done by WeLiveSecurity earlier this year in regards to this threat [targeting ", "_context_right": " sites](http://www.welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/).", "sentence_left": "Over the last month, the ThreatLabZ researchers have been actively monitoring a recent uptick in the numbers of [Win32/Caphaw](http://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Backdoor:Win32/Caphaw.A) (henceforward known as Caphaw) infections that have been actively targeting users' bank accounts since 2011.", "sentence_right": "This time would appear to be no different.", "label": "The European Banking Federation (abbreviated EBF or FBE in French) is a trade association that represent 32 national banking associations in the EU and EFTA countries. It represents over 3,500 banks and about two million employees. The EBF is the voice of Europe’s banking sector in all regulatory debates at European and global level.  The EBF acts as a forum, where members' initiatives are proposed and debated, as well as a dialogue partner with European institutions regarding legislation in the banking sphere, with the aim of ensuring that the experience and the views of banks are taken into consideration in the shaping of relevant policies.", "label_id": 250255, "label_title": "European Banking Federation", "label_link": "https://en.wikipedia.org/wiki?curid=667180", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "UK", "context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the", "context_right": ", Italy, Denmark and Turkey.", "_context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the ", "_context_right": ", Italy, Denmark and Turkey.", "sentence_left": "This limits the ability of traditional network monitoring solution to dissect the packets on the wire for any malicious transactions.", "sentence_right": "This is especially prevalent considering the mapped known infected nodes seen [here](http://www.virusradar.com/en/Win32_Caphaw/map).", "label": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a sovereign country located off the north-western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north-eastern part of the island of Ireland, and many smaller islands. Northern Ireland is the only part of the United Kingdom that shares a land border with another sovereign state, the Republic of Ireland. Apart from this land border, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the south-west, giving it the 12th-longest coastline in the world. The Irish Sea lies between Great Britain and Ireland. The United Kingdom's were home to an estimated 66.0 million inhabitants in 2017.  The United Kingdom is a unitary parliamentary democracy and constitutional monarchy. The current monarch is Queen Elizabeth II, who has reigned since 1952, making her the world's longest-serving current head of state. The United Kingdom's capital and largest city is London, a global city and financial centre with an urban area population of 10.3 million. Other major cities include Birmingham, Manchester, Glasgow, Leeds and Liverpool.  The United Kingdom consists of four constituent countries: England, Scotland, Wales, and Northern Ireland. Their capitals are London, Edinburgh, Cardiff, and Belfast, respectively. Apart from England, the countries have their own devolved governments, each with varying powers, but such power is delegated by the Parliament of the United Kingdom,", "label_id": 15734, "label_title": "United Kingdom", "label_link": "https://en.wikipedia.org/wiki?curid=31717", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Italy", "context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK,", "context_right": ", Denmark and Turkey.", "_context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK, ", "_context_right": ", Denmark and Turkey.", "sentence_left": "This limits the ability of traditional network monitoring solution to dissect the packets on the wire for any malicious transactions.", "sentence_right": "This is especially prevalent considering the mapped known infected nodes seen [here](http://www.virusradar.com/en/Win32_Caphaw/map).", "label": "Italy ( ), officially the Italian Republic ( ), is a European country consisting of a peninsula delimited by the Italian Alps and surrounded by several islands. Located in the middle of the Mediterranean sea and traversed along its length by the Apennines, Italy has a largely temperate seasonal and Mediterranean climate. The country covers an area of and shares open land borders with France, Slovenia, Austria, Switzerland and the enclaved microstates of Vatican City and San Marino. Italy has a territorial exclave in Switzerland (Campione) and a maritime exclave in the Tunisian Sea (Lampedusa). With around 60 million inhabitants, Italy is the fourth-most populous member state of the European Union.  Due to its central geographic location in Southern Europe and the Mediterranean, Italy has historically been home to myriad peoples and cultures. In addition to the various ancient peoples dispersed throughout modern-day Italy, the most predominant being the Indo-European Italic peoples who gave the peninsula its name, beginning from the classical era, Phoenicians and Carthaginians founded colonies mostly in insular Italy, Greeks established settlements in the so-called \"Magna Graecia\" of southern Italy, while Etruscans and Celts inhabited central and northern Italy respectively. An Italic tribe known as the Latins formed the Roman Kingdom in the 8th century BC, which eventually became a republic with a government of the Senate and the People. The Roman Republic initially conquered and assimilated its neighbours on the peninsula, eventually expanding and conquering parts of Europe, North Africa and Asia. By the first century BC, the Roman Empire", "label_id": 6937, "label_title": "Italy", "label_link": "https://en.wikipedia.org/wiki?curid=14532", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Denmark", "context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK, Italy,", "context_right": "and Turkey.", "_context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK, Italy, ", "_context_right": " and Turkey.", "sentence_left": "This limits the ability of traditional network monitoring solution to dissect the packets on the wire for any malicious transactions.", "sentence_right": "This is especially prevalent considering the mapped known infected nodes seen [here](http://www.virusradar.com/en/Win32_Caphaw/map).", "label": "Denmark (, ), officially the Kingdom of Denmark, is a sovereign state in Northern Europe. Denmark proper consists of a peninsula, Jutland, and an archipelago of 443 named islands, with the largest being Zealand, Funen and the North Jutlandic Island. The islands are characterised by flat, arable land and sandy coasts, low elevation and a temperate climate. The southernmost of the Scandinavian nations, Denmark lies southwest of Sweden and south of Norway, and is bordered to the south by Germany. The Kingdom of Denmark also comprises two autonomous constituent countries in the North Atlantic Ocean: the Faroe Islands and Greenland. Denmark has a total area of , land area of , and the total area including Greenland and the Faroe Islands is , and a population of 5.8 million ().  The unified kingdom of Denmark emerged in the 10th century as a proficient seafaring nation in the struggle for control of the Baltic Sea. Denmark, Sweden, and Norway were ruled together under one sovereign ruler in the Kalmar Union, established in 1397 and ending with Swedish secession in 1523. The areas of Denmark and Norway remained under the same monarch until 1814, Denmark–Norway. Beginning in the 17th century, there were several devastating wars with the Swedish Empire, ending with large cessions of territory to Sweden. After the Napoleonic Wars, Norway was ceded to Sweden, while Denmark kept the Faroe Islands, Greenland, and Iceland. In the 19th century there was a surge of nationalist movements, which were defeated in the 1864 Second Schleswig War. Denmark", "label_id": 37019, "label_title": "Denmark", "label_link": "https://en.wikipedia.org/wiki?curid=76972", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Turkey", "context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK, Italy, Denmark and", "context_right": ".", "_context_left": "Caphaw attacks major European banks and previous analysis has shown that the malware is most active in the UK, Italy, Denmark and ", "_context_right": ".", "sentence_left": "This limits the ability of traditional network monitoring solution to dissect the packets on the wire for any malicious transactions.", "sentence_right": "This is especially prevalent considering the mapped known infected nodes seen [here](http://www.virusradar.com/en/Win32_Caphaw/map).", "label": "Turkey ( ), officially the Republic of Turkey ( ), is a transcontinental country located mainly in Western Asia, with a smaller portion on the Balkan Peninsula in Southeast Europe. East Thrace, located in Europe, is separated from Anatolia by the Sea of Marmara, the Bosphorous strait and the Dardanelles (collectively called the Turkish Straits). Turkey is bordered by Greece and Bulgaria to its northwest; Georgia to its northeast; Armenia, the Azerbaijani exclave of Nakhchivan and Iran to the east; and Iraq and Syria to the south. Istanbul is the largest city, but more central Ankara is the capital. Approximately 70 to 80 per cent of the country's citizens identify as Turkish. Kurds are the largest minority; the size of the Kurdish population is a subject of dispute with estimates placing the figure at anywhere from 12 to 25 per cent of the population.  At various points in its history, the region has been inhabited by diverse civilizations including the Assyrians, Greeks, Thracians, Phrygians, Urartians, and Armenians. Hellenization started during the era of Alexander the Great and continued into the Byzantine era. The Seljuk Turks began migrating into the area in the 11th century, and their victory over the Byzantines at the Battle of Manzikert in 1071 symbolizes the start and foundation of Turkey. The Seljuk Sultanate of Rum ruled Anatolia until the Mongol invasion in 1243, when it disintegrated into small Turkish principalities. Beginning in the late 13th-century, the Ottomans started uniting these Turkish principalities. After Mehmed II conquered Constantinople in 1453, Ottoman", "label_id": 1602232, "label_title": "Turkey", "label_link": "https://en.wikipedia.org/wiki?curid=11125639", "entity_class": "NE", "entity_type": "LOC", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Mozilla", "context_left": "The reason we suspect this is that the User-Agent for every single transaction that has come through our Behavioral Analysis (BA) solution has been:", "context_right": "/4.0 (Windows XP 5.1) Java/1.6.0\\_07.", "_context_left": "The reason we suspect this is that the User-Agent for every single transaction that has come through our Behavioral Analysis (BA) solution has been: ", "_context_right": "/4.0 (Windows XP 5.1) Java/1.6.0\\_07.", "sentence_left": "We can tell that it is more than likely arriving as part of an Exploit Kit honing in on vulnerable versions of Java.", "sentence_right": "|  |", "label": "The Mozilla Corporation (stylized as moz://a) is a wholly owned subsidiary of the Mozilla Foundation that coordinates and integrates the development of Internet-related applications such as the Firefox web browser, SeaMonkey Internet suite, and the Mozilla Thunderbird email client by a global community of open-source developers, some of whom are employed by the corporation itself. The corporation also distributes and promotes these products. Unlike the non-profit Mozilla Foundation, and the Mozilla open source project, founded by the now defunct Netscape Communications Corporation, the Mozilla Corporation is a taxable entity. The Mozilla Corporation reinvests all of its profits back into the Mozilla projects. The Mozilla Corporation's stated aim is to work towards the Mozilla Foundation's public benefit to \"promote choice and innovation on the Internet.\"  A MozillaZine article explained:The Mozilla Foundation will ultimately control the activities of the Mozilla Corporation and will retain its 100 percent ownership of the new subsidiary. Any profits made by the Mozilla Corporation will be invested back into the Mozilla project. There will be no shareholders, no stock options will be issued and no dividends will be paid. The Mozilla Corporation will not be floating on the stock market and it will be impossible for any company to take over or buy a stake in the subsidiary. The Mozilla Foundation will continue to own the Mozilla trademarks and other intellectual property and will license them to the Mozilla Corporation. The Foundation will also continue to govern the source code repository and control who is allowed to check in.", "label_id": 607557, "label_title": "Mozilla Corporation", "label_link": "https://en.wikipedia.org/wiki?curid=2370025", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Microsoft", "context_left": "This executable is created using", "context_right": "Visual C++ and the creator has not removed the debugging information from the final executable.", "_context_left": "This executable is created using ", "_context_right": " Visual C++ and the creator has not removed the debugging information from the final executable.", "sentence_left": "A binary executable (.exe) file is created in the attack sequence and masquerades as a .php file.", "sentence_right": "Both the location of where this file is dropped and the name of the file itself is selected quasi-randomly.", "label": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge Web browsers. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. As of 2016, it is the world's largest software maker by revenue, and one of the world's most valuable companies. The word \"Microsoft\" is a portmanteau of \"microcomputer\" and \"software\". Microsoft is ranked No. 30 in the 2018 Fortune 500 rankings of the largest United States corporations by total revenue.  Microsoft was founded by Bill Gates and Paul Allen on April 4, 1975, to develop and sell BASIC interpreters for the Altair 8800. It rose to dominate the personal computer operating system market with MS-DOS in the mid-1980s, followed by Microsoft Windows. The company's 1986 initial public offering (IPO), and subsequent rise in its share price, created three billionaires and an estimated 12,000 millionaires among Microsoft employees. Since the 1990s, it has increasingly diversified from the operating system market and has made a number of corporate acquisitions, their largest being the acquisition of LinkedIn for $26.2 billion in December 2016, followed by their acquisition of Skype Technologies for $8.5 billion in May 2011.  , Microsoft is market-dominant in the IBM PC compatible operating system market and the office software suite", "label_id": 9231, "label_title": "Microsoft", "label_link": "https://en.wikipedia.org/wiki?curid=19001", "entity_class": "NE", "entity_type": "ORG", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Bank of Scotland", "context_left": "This is based on data pulled from an added thread to explorer.exe process.*", "context_right": "", "_context_left": "This is based on data pulled from an added thread to explorer.exe process.* ", "_context_right": "", "sentence_left": "Amongst all samples analyzed, we found the following 24 major banks' sites were actively being monitored by the infection primarily to seek out the victim's online banking credentials.", "sentence_right": "* Barclays Bank", "label": "The Bank of Scotland plc (, ) is a commercial and clearing bank based in Edinburgh, Scotland. With a history dating to the 17th century, it is the fifth-oldest surviving bank in the United Kingdom (the Bank of England having been established one year earlier), and is the only commercial institution created by the Parliament of Scotland to remain in existence. It was one of the first banks in Europe to print its own banknotes, and it continues to print its own sterling banknotes under legal arrangements that allow Scottish banks to issue currency.  In June 2006, the HBOS Group Reorganisation Act 2006 was passed by the Parliament of the United Kingdom, allowing the bank's structure to be simplified. As a result, The Governor and Company of the Bank of Scotland became Bank of Scotland plc on 17 September 2007.  Bank of Scotland has been a subsidiary of Lloyds Banking Group since 19 January 2009, when HBOS was acquired by Lloyds TSB.", "label_id": 134186, "label_title": "Bank of Scotland", "label_link": "https://en.wikipedia.org/wiki?curid=285609", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Barclays Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "This is based on data pulled from an added thread to explorer.exe process.* Bank of Scotland", "sentence_right": "* First Direct", "label": "Barclays plc () is a British multinational investment bank and financial services company, headquartered in London. Apart from investment banking, Barclays is organised into four core businesses: personal banking, corporate banking, wealth management, and investment management.  Barclays traces its origins to a goldsmith banking business established in the City of London in 1690. James Barclay became a partner in the business in 1736. In 1896, several banks in London and the English provinces, including Backhouse's Bank and Gurney's Bank, united as a joint-stock bank under the name Barclays and Co. Over the following decades, Barclays expanded to become a nationwide bank. In 1967, Barclays deployed the world's first cash dispenser. Barclays has made numerous corporate acquisitions, including of London, Provincial and South Western Bank in 1918, British Linen Bank in 1919, Mercantile Credit in 1975, the Woolwich in 2000 and the North American operations of Lehman Brothers in 2008.  Barclays has a primary listing on the London Stock Exchange and is a constituent of the FTSE 100 Index. It has a secondary listing on the New York Stock Exchange. Qatar Holdings, an investment vehicle of the State of Qatar, is the largest shareholder of the company.  According to a 2011 paper by Vitali et al., Barclays was the most powerful transnational corporation in terms of ownership and thus corporate control over global financial stability and market competition, with AXA and State Street Corporation taking the 2nd and 3rd positions, respectively.", "label_id": 3824611, "label_title": "Barclays", "label_link": "https://en.wikipedia.org/wiki?curid=35644201", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "First Direct", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Barclays Bank", "sentence_right": "* Santander Direkt Bank AG", "label": "First Direct (styled first direct) is a telephone and internet based retail bank in the United Kingdom, a division of HSBC Bank plc. First Direct has headquarters in Leeds, West Yorkshire, England, and has 1.35 million customers. It used to maintain a reputation for superior customer service, awarded Most Trusted Financial Provider by Moneywise, first place in the customer service survey for \"Which?\" of August 2015. It is as of 2019 rated as bad by Trustpilot coinciding with HSBC increased influence via restructuring to a wing of HSBC UK Bank Ltd https://uk.trustpilot.com/review/www.firstdirect.com  First Direct has two call centres, in Stourton (Leeds) and Hamilton, South Lanarkshire, Scotland. The Leeds call centre is the main site of the bank, housing all the major departments and being the base for First Direct's head Joe Gordon, and the Hamilton call centre shares space with HSBC Direct banking.", "label_id": 715192, "label_title": "First Direct", "label_link": "https://en.wikipedia.org/wiki?curid=2996499", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "First Citizens Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Santander Direkt Bank AG", "sentence_right": "* Bank of America", "label": "First Citizens is a bank based in Trinidad and Tobago. First Citizens has assets of over TT$38 billion, 25 branches in Trinidad and three in Tobago and five in Barbados. It also has a representative office in Costa Rica, which handles its Latam business. It wholly owns First Citizens (St. Lucia) Limited, which it established as an offshore financial vehicle for the Bank and its subsidiaries and also to conduct selected banking and financial service operations in the Caribbean Region. The Group's Chief Executive Officer is Karen Darbasie and the office of Group Chief Financial Officer is held by Shiva Manraj. There are two deputy CEO's, Jason Julien (Business Generation) and Sterling Frost (Operations and Administration). Lindi Ballah Tull is the Group's Corporate Secretary and head of the legal department.", "label_id": 1806506, "label_title": "First Citizens Bank (Trinidad and Tobago)", "label_link": "https://en.wikipedia.org/wiki?curid=13003028", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Bank of America", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* First Citizens Bank", "sentence_right": "* Bank of the West", "label": "The Bank of America Corporation (abbreviated as BofA) is an American multinational investment bank and financial services company based in Charlotte, North Carolina, with central hubs in New York City, London, Hong Kong, Minneapolis, and Toronto. Bank of America was formed through NationsBank's acquisition of BankAmerica in 1998. It is the second largest banking institution in the United States, after JPMorgan Chase. As a part of the Big Four, it services approximately 10.73% of all American bank deposits, in direct competition with Citigroup, Wells Fargo, and JPMorgan Chase. Its primary financial services revolve around commercial banking, wealth management, and investment banking.  One branch of its history stretches back to Bank of Italy, founded by Amadeo Pietro Giannini in 1904, which provided Italian immigrants who faced service discrimination various banking options. Originally headquartered in San Francisco, California, Giannini acquired Banca d'America e d'Italia (Bank of America and Italy) in 1922. The passage of landmark federal banking legislation facilitated rapid growth in the 1950s, quickly establishing a prominent market share. After suffering a significant loss after the 1998 Russian bond default, BankAmerica, as it was then known, was acquired by the Charlotte-based NationsBank for US$62 billion. Following what was then the largest bank acquisition in history, the Bank of America Corporation was founded. Through a series of mergers and acquisitions, it built upon its commercial banking business by establishing Merrill Lynch for wealth management and Bank of America Merrill Lynch for investment banking in 2008 and 2009, respectively. Since both divisions carry the \"Merrill Lynch\" signage,", "label_id": 154794, "label_title": "Bank of America", "label_link": "https://en.wikipedia.org/wiki?curid=347756", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Bank of the West", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Bank of America", "sentence_right": "* Sovereign Bank", "label": "Bank of the West is a regional financial services company, headquartered in San Francisco, California. It is a subsidiary of BNP Paribas. It has more than 600 branches and offices in the Midwest and Western United States.", "label_id": 220983, "label_title": "Bank of the West", "label_link": "https://en.wikipedia.org/wiki?curid=564284", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Sovereign Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Bank of the West", "sentence_right": "* Co-operative Bank", "label": "Santander Bank, N. A. (), formerly Sovereign Bank, is a wholly owned subsidiary of Spanish Santander Group. It is based in Boston and its principal market is the northeastern United States. It has $57.5 billion in deposits, operates about 650 retail banking offices and over 2,000 ATMs, and employs approximately 9,800 people. It offers an array of financial services and products including retail banking, mortgages, corporate banking, cash management, credit card, capital markets, trust and wealth management, and insurance.  Sovereign Bank was rebranded as Santander Bank on October 17, 2013; the stadium, arena, and performing arts center for which it has naming rights were also rebranded.", "label_id": 1063518, "label_title": "Santander Bank", "label_link": "https://en.wikipedia.org/wiki?curid=5567259", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Co-operative Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Sovereign Bank", "sentence_right": "* Capital One Financial Corporation", "label": "The Co-operative Bank plc is a retail and commercial bank in the United Kingdom, with its headquarters in Balloon Street, Manchester.  The bank markets itself as an ethical bank, and seeks to avoid investing in companies involved in certain elements of the arms trade, fossil fuel extraction, genetic engineering, animal testing and use of sweatshop labour as stated in its ethical policy. The ethical policy was introduced in 1992 and incorporated into the Bank's constitution in 2013. In 2002, the parent company The Co-operative Group Limited brought the bank and the Co-operative Insurance Society under the control of a newly incorporated holding society, Co-operative Financial Services, which became the Co-operative Banking Group in 2011.  As Britain's seventh biggest lender, the majority of the bank's revenue is made from interest charges on loans.  In 2013–14 the bank was the subject of a rescue plan to address a capital shortfall of about £1.9 billion. The bank mostly raised equity to cover the shortfall from hedge funds, while The Co-operative Group became a minority shareholder holding a 20% stake in the bank. Following restructuring and the formation of a new holding company on 1 September 2017, the Co-operative Group no longer owns a stake in the bank and the relationship agreement between the two organisations will end in 2020.", "label_id": 210871, "label_title": "The Co-operative Bank", "label_link": "https://en.wikipedia.org/wiki?curid=526703", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Capital One Financial Corporation", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Co-operative Bank", "sentence_right": "* Chase Manhattan Corporation", "label": "Capital One Financial Corporation is a bank holding company specializing in credit cards, auto loans, banking and savings accounts headquartered in McLean, Virginia.  Capital One is ranked 10th on the list of largest banks in the United States by assets. The bank has 755 branches including 30 cafe style locations and 2,000 ATMs. It is ranked 98th on the Fortune 500, 17th on Fortune's 100 Best Companies to Work For list, and conducts business in the United States, Canada, and the United Kingdom. The company helped pioneer the mass marketing of credit cards in the 1990s. In 2016, it was the 5th largest credit card issuer by purchase volume, after American Express, JP Morgan Chase, Bank of America, and Citigroup.  With a market share of 5%, Capital One is also the 2nd largest auto finance company in the United States, after Ally Financial.  In the fourth quarter of 2018, 75% of the company's revenues were from credit cards, 14% were from consumer banking, and 11% were from commercial banking.", "label_id": 366028, "label_title": "Capital One", "label_link": "https://en.wikipedia.org/wiki?curid=1168152", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Citi Private Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Chase Manhattan Corporation", "sentence_right": "* Comerica Bank", "label": "Citi Private Bank, a subsidiary of multinational banking conglomerate Citigroup, markets Private banking services for ultra high-net-worth individual clients, including entrepreneurs and senior corporate executives. It has 60 offices in 23 countries. Citi Private Bank's major competitors are JP Morgan Chase, Goldman Sachs, United States Trust Corporation, UBS, and HSBC Private Bank.", "label_id": 343535, "label_title": "Citi Private Bank", "label_link": "https://en.wikipedia.org/wiki?curid=1074365", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Comerica Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Citi Private Bank", "sentence_right": "* E*Trade Financial", "label": "Comerica Incorporated is a financial services company headquartered in Dallas, Texas. It has retail banking operations in Texas, Michigan, Arizona, California and Florida, with select business operations in several other U.S. states, as well as in Canada and Mexico.  Comerica is the largest U.S. commercial bank headquartered in Texas and is on the list of largest banks in the United States.  The company's largest offices are in Cincinnati, Philadelphia, Detroit, Livonia, Michigan, Auburn Hills, Michigan and Dallas.  The bank sponsors Comerica Park in Detroit, Comerica Theatre in Phoenix, and sponsored the Comerica Bank New Year's Parade in Dallas between 2007 and 2010.", "label_id": 227774, "label_title": "Comerica", "label_link": "https://en.wikipedia.org/wiki?curid=590091", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "E*Trade Financial", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Comerica Bank", "sentence_right": "* Harris Bank", "label": "E-Trade Financial Corporation (stylized as E*TRADE) offers an electronic trading platform to trade financial assets including common stocks, preferred stocks, futures contracts, exchange-traded funds, options, mutual funds, and fixed income investments. It also provides services for employee stock ownership plans, advisor services, margin lending, online banking, and cash management services.  As of December 31, 2018, the company had 4.9 million brokerage accounts and a total margin receivables balance of $9.560 billion. In 2018, the company processed 282,243 daily average revenue trades. In 2018, 64% of net revenue was from interest income, 17% of net revenue was from commissions for order execution, 15% was from payment for order flow and management services, and 4% was from other sources. The company has 30 branches.  The company is organized in Delaware and headquartered in New York City. The company's primary offices are in Alpharetta, Georgia; Jersey City, New Jersey; Arlington, Virginia; Sandy, Utah; Menlo Park, California; Centennial, Colorado; and New York City.", "label_id": 422244, "label_title": "E-Trade", "label_link": "https://en.wikipedia.org/wiki?curid=1429233", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Harris Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* E*Trade Financial", "sentence_right": "* Intesa Sanpaolo", "label": "BMO Harris Bank, N.A. is a United States bank based in Chicago, Illinois. It is a member of the Federal Reserve System and operates branches in the states of Illinois, Indiana, Arizona, Missouri, Minnesota, Kansas, Florida, and Wisconsin. BMO Harris Bank has over 600 branches and 1,300 ATMs and employs 14,500 staff in the United States.  The bank is a subsidiary of the Canadian multinational Bank of Montreal, commonly known as \"BMO\" (pronounced ), which owns BMO Harris Bank through the holding company BMO Financial Corporation.  The CEO of BMO Harris Bank is David R. Casper.", "label_id": 617732, "label_title": "BMO Harris Bank", "label_link": "https://en.wikipedia.org/wiki?curid=2423039", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Intesa Sanpaolo", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Harris Bank", "sentence_right": "* Regions Bank", "label": "Intesa Sanpaolo S.p.A. is an Italian banking group resulting from the merger of Banca Intesa and Sanpaolo IMI based in Torre Intesa Sanpaolo, Turin, Italy. In 2014 it was the largest banking group in Italy by market capitalization, and second by total assets. The bank has also experienced growth in the international market, focused in Central-Eastern Europe, the Middle East and North Africa.  When it was formed in 2007 it overtook Unicredit Group as the largest bank in Italy with 13 million customers and US$690 billion worth of assets. By 2010 its assets had grown to US$877.66 billion, ranking 26th in \"Forbes Global 2000\". The company is a component of the Euro Stoxx 50 stock market index. In August 2018, Intesa Sanpaolo launched XME pay digital wallet.", "label_id": 1469791, "label_title": "Intesa Sanpaolo", "label_link": "https://en.wikipedia.org/wiki?curid=9468312", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Regions Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Intesa Sanpaolo", "sentence_right": "* SunTrust", "label": "Regions Financial Corporation is a bank holding company headquartered in the Regions Center in Birmingham, Alabama. The company provides retail banking and commercial banking, trust, stockbrokerage, and mortgage services. Its banking subsidiary, Regions Bank, operates 1,952 automated teller machines and 1,454 branches in 15 states in the Southern United States and Midwestern United States.  Regions is ranked 460th on the Fortune 500 and is component headquartered in Alabama. Regions is also on the list of largest banks in the United States.  Regions is the largest deposit holder in Alabama and Tennessee. It is also one of the largest deposit holders in Arkansas, Louisiana, Mississippi, and Florida.  The company sponsors Regions Field, a Minor League Baseball stadium in Birmingham, Alabama, and The Tradition golf tournament. It sponsored the Regions Charity Classic, a golf tournament held in 2009 and 2010.  The company has a partnership with Operation HOPE, Inc. to provide free financial education to underserved community. In 2019, the company expanded its Workday, Inc. system in partnership with EnterpriseAlumni to engage and enable ex-employees to extend their corporate social responsibility initiatives.", "label_id": 795687, "label_title": "Regions Financial Corporation", "label_link": "https://en.wikipedia.org/wiki?curid=3515640", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "SunTrust", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Regions Bank", "sentence_right": "* Bank of Ireland Group Treasury", "label": "SunTrust Banks, Inc. is an American bank holding company. The largest subsidiary is SunTrust Bank. It had US$199 billion in assets as of March 31, 2018. SunTrust Bank's most direct corporate parent was established in 1891 in Atlanta, where its headquarters remain. On February 7, 2019, it was announced that SunTrust Banks would be bought by BB&T for $28 billion in an all-stock deal, creating the sixth largest U.S. lender in the biggest bank deal since the 2007-2009 financial crisis.  As of September 2016, SunTrust Bank operates 1,400 bank branches and 2,160 ATMs across 11 southeastern states and Washington, D.C.. The bank's primary businesses include deposits, lending, credit cards, and trust and investment services. Through its various subsidiaries, the company provides corporate and investment banking, capital market services, mortgage banking, and wealth management. It has nearly 24,000 employees. In 2013, it was ordered to pay $1.5 billion \"to resolve claims of shoddy mortgage lending, servicing and foreclosure practices,\" and it reached a preliminary $968 Million settlement with the US government in 2014.", "label_id": 406037, "label_title": "SunTrust Banks", "label_link": "https://en.wikipedia.org/wiki?curid=1348866", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Bank of Ireland Group Treasury", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* SunTrust", "sentence_right": "* U.S. Bancorp", "label": "Bank of Ireland Group plc (Irish: \"Banc na hEireann\") is a commercial bank operation in Ireland and one of the traditional 'Big Four' Irish banks. Historically the premier banking organisation in Ireland, the Bank occupies a unique position in Irish banking history. At the core of the modern-day group is the old Bank of Ireland, the ancient institution established by Royal Charter in 1783.", "label_id": 211531, "label_title": "Bank of Ireland", "label_link": "https://en.wikipedia.org/wiki?curid=528914", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "U.S. Bancorp", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Bank of Ireland Group Treasury", "sentence_right": "* Banco Mercantil, S.A.", "label": "U.S. Bancorp (stylized as US bancorp) is an American bank holding company based in Minneapolis, Minnesota, and incorporated in Delaware. It is the parent company of U.S. Bank National Association, which is the 7th largest bank in the United States. The company provides banking, investment, mortgage, trust, and payment services products to individuals, businesses, governmental entities, and other financial institutions. It has 3,106 branches and 4,842 ATMs, primarily in the Midwestern United States, and has approximately 72,400 employees. The company also owns Elavon, a processor of credit card transactions.  U.S. Bancorp operates under the second-oldest continuous national charter, originally Charter #24, granted in 1863 following the passage of the National Bank Act. Earlier charters have expired as banks were closed or acquired, raising U.S. Bank's charter number from #24 to #2. The oldest national charter, originally granted to the First National Bank of Philadelphia, is held by Wells Fargo, which it obtained upon its merger with Wachovia.", "label_id": 209658, "label_title": "U.S. Bancorp", "label_link": "https://en.wikipedia.org/wiki?curid=523002", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Banco Mercantil, S.A.", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* U.S. Bancorp", "sentence_right": "* Varazdinska Banka", "label": "Banco Mercantil or simply Mercantil is a Venezuelan financial institution based in Caracas, the second largest bank in the country. At the end of 2007, it had 321 branches, 313 of them established in Venezuela.", "label_id": 2522546, "label_title": "Banco Mercantil", "label_link": "https://en.wikipedia.org/wiki?curid=20959502", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Wintrust Financial Corporation", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Varazdinska Banka", "sentence_right": "* Wells Fargo Bank", "label": "Wintrust is a financial holding company in the United States that operates 15 chartered community banks in northern Illinois and southern Wisconsin. It trades on the Nasdaq Global Select Market with stock symbol WTFC. Wintrust is the second largest banking company in Chicago.", "label_id": 5011293, "label_title": "Wintrust Financial", "label_link": "https://en.wikipedia.org/wiki?curid=49519463", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}
{"mention": "Wells Fargo Bank", "context_left": "*", "context_right": "", "_context_left": "* ", "_context_right": "", "sentence_left": "* Wintrust Financial Corporation", "sentence_right": "|  |", "label": "Wells Fargo & Company is an American multinational financial services company headquartered in San Francisco, California, with central offices throughout the United States. It is the world's fourth-largest bank by market capitalization and the fourth largest bank in the US by total assets. Wells Fargo is ranked #26 on the 2018 Fortune 500 rankings of the largest US corporations by total revenue. In July 2015, Wells Fargo became the world's largest bank by market capitalization, edging past ICBC, before slipping behind JPMorgan Chase in September 2016, in the wake of a scandal involving the creation of over 2 million fake bank accounts by Wells Fargo employees. Wells Fargo fell behind Bank of America to third by bank deposits in 2017 and behind Citigroup to fourth by total assets in 2018.  The firm's primary operating subsidiary is national bank Wells Fargo Bank, N.A., which designates its main office as Sioux Falls, South Dakota. Wells Fargo in its present form is a result of a merger between San Francisco–based Wells Fargo & Company and Minneapolis-based Norwest Corporation in 1998 and the subsequent 2008 acquisition of Charlotte-based Wachovia. Following the mergers, the company transferred its headquarters to Wells Fargo's headquarters in San Francisco and merged its operating subsidiary with Wells Fargo's operating subsidiary in Sioux Falls. Along with JPMorgan Chase, Bank of America, and Citigroup, Wells Fargo is one of the \"Big Four Banks\" of the United States. , it had 8,050 branches and 13,000 ATMs. In 2018 the company had operations in 35 countries with over", "label_id": 2131695, "label_title": "Wells Fargo", "label_link": "https://en.wikipedia.org/wiki?curid=16597487", "entity_class": "NE", "entity_type": "SECTOR", "document": "zscaler_2013-09-18_new-wave-win32caphaw-attacks-threatlabz"}